kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Vendor streaming application (cleaned: duplicates removed) */
#include <stdint.h>
#include "usbd_cdc_custom.h"
#include "usb_device.h"
#include "usbd_core.h"
#include "usb_vendor_app.h"
#include <string.h>
#include <stdint.h>
#include <stdio.h>
#include <stdarg.h>
#include <math.h>
#include "adc_stream.h"
#include "main.h"
#include "usb_cdc_proto.h"
#include "build_info.h"
#include "ws2812_spi.h"
#include <stddef.h> /* offsetof для отладочного вывода */
#include "stm32h7xx_hal.h" /* SCB_* cache maintenance (may HardFault if MPU/cache config incomplete) */

/* External timer handle for TIM5 (32-bit phase counter) */
extern TIM_HandleTypeDef htim5;

/* Для дублирования фрагментов кадров в CDC (Virtual COM) */
#include "usbd_cdc_if.h"
#include "usbd_cdc_custom.h" /* для USBD_VND_RequestSoftReset/DeepReset (объявления находятся в .c) */
#include "vnd_testgen.h"

/* === DC калибровка ROI 200 samples (LOSSLESS_ROI / AVG_ROI) ===
   Требование:
   - DC буферы 200 семплов для каждого (канал A/B) × (even/odd)
   - LOSSLESS_ROI: применяем DC к копии ROI перед USB payload
   - AVG_ROI: единственная DC-таблица применяется и обучается до усреднения
   - RPI задаёт только постоянную скорость settle_ms; 0 выключает обучение
   - DMA/FIFO raw буферы не изменяем
   - Сохранение в Flash только по команде хоста, если не включён периодический save.
*/
#include "stm32h7xx_hal_flash.h"
#include "stm32h7xx_hal_flash_ex.h"

/* В этом проекте операции invalidate/clean DCache могут вызывать HardFault
    (см. комментарий в adc_stream.c). Поэтому по умолчанию отключаем их.
    Если позже будет настроена некэшируемая память/MPU корректно — можно включить. */
#ifndef VND_ENABLE_CACHE_INVALIDATE
#define VND_ENABLE_CACHE_INVALIDATE 0
#endif

/* Управление шумными логами (по умолчанию выключено) */
#ifndef VND_DC_LOG_ENABLE
#define VND_DC_LOG_ENABLE 0
#endif
#if VND_DC_LOG_ENABLE
#define VND_DC_LOGF(...) printf(__VA_ARGS__)
#else
#define VND_DC_LOGF(...) do { } while(0)
#endif

#ifndef VND_PROF_LOG_ENABLE
#define VND_PROF_LOG_ENABLE 0
#endif
#if VND_PROF_LOG_ENABLE
#define VND_PROF_LOGF(...) printf(__VA_ARGS__)
#else
#define VND_PROF_LOGF(...) do { } while(0)
#endif

/* Verification build default: keep the COM port quiet except explicit DC speed
   confirmation in SET_DC_SPEED. Define VND_UART_LOG_ENABLE=1 to restore logs. */
#ifndef VND_UART_LOG_ENABLE
#define VND_UART_LOG_ENABLE 0
#endif
#if !VND_UART_LOG_ENABLE
#define printf(...) ((void)0)
#endif

#ifndef VND_CDC_LOG_ENABLE
#define VND_CDC_LOG_ENABLE 0
#endif

#ifndef VND_LED_EVENTS_ENABLE
#define VND_LED_EVENTS_ENABLE 0
#endif

#ifndef VND_SYNC_DIAG_ENABLE
#define VND_SYNC_DIAG_ENABLE 1
#endif

#ifndef VND_SYNC_DIAG_PRINTF
#define VND_SYNC_DIAG_PRINTF 0
#endif

#ifndef VND_AVG_DIAG_PRINTF
#define VND_AVG_DIAG_PRINTF 0
#endif

/* Forward declaration (реализация ниже) для предотвращения implicit-function-warning при раннем вызове */
void vnd_diag_log_possible_stall(void);
static void cdc_logf(const char *fmt, ...);
static void vnd_apply_tx_enable_outputs(void);
static uint8_t vnd_tx_set_enabled_internal(uint8_t enable, const char *reason);
static uint8_t vnd_tx_refresh_effective(uint32_t now_ms, const char *reason);
static void vnd_tx_failsafe_service(uint32_t now_ms);
static void vnd_log_dc_cmd_rx(const uint8_t *data, uint32_t len);

/* Управление дублированием данных кадров в CDC (COM-порт):
 *  0 — отключено (оставляем только события START/STOP и 1 Гц статистику)
 *  1 — включено (превью первых 64 сэмплов раз в ≤10 Гц)
 */
#ifndef VND_CDC_PREVIEW_ENABLE
#define VND_CDC_PREVIEW_ENABLE 0
#endif

#ifndef VND_DIAG_BUFFER_ID_MODE
#define VND_DIAG_BUFFER_ID_MODE 1  /* Режим отладки: использовать ID буфера вместо seq */
#endif

#ifndef VND_ENABLE_LOG
#define VND_ENABLE_LOG 0 /* ОТКЛЮЧЕНО: логи засоряют терминал */
#endif
#if VND_ENABLE_LOG
#define VND_LOG(...) do { printf("[VND] " __VA_ARGS__); printf("\r\n"); } while(0)
#else
#define VND_LOG(...) do{}while(0)
#endif

extern USBD_HandleTypeDef hUsbDeviceHS;
extern volatile uint8_t need_usb_status_refresh;

/* В диагностическом режиме упростим логику: отправлять только A-кадр (без обязательного B).
    Это помогает подтвердить транспорт USB IN и исключает потенциальные блокировки на pending_B. */
#ifndef VND_DIAG_SEND_A_ONLY
#define VND_DIAG_SEND_A_ONLY 0
#endif

/* Полностью отключить тестовые кадры (TEST) и связанную с ними
    стартовую/keepalive логику, чтобы исключить гонки и зависания EP
    на некоторых хостах. При включении — начинаем сразу с A/B. */
#ifndef VND_DISABLE_TEST
#define VND_DISABLE_TEST 1
#endif

/* Команды */
#define VND_CMD_START_STREAM   0x20u
#define VND_CMD_STOP_STREAM    0x21u
#define VND_CMD_DEVICE_RESET   0x22u  /* ПОЛНЫЙ RESET MCU (для отладки) */
#define VND_CMD_GET_STATUS     0x30u
/* Диагностический статус: отправить STAT немедленно даже при pending_B (для отладки зависаний) */
#define VND_CMD_GET_STATUS_IMM 0x31u
/* Отладка фаз/буферов: инверсия тестового выхода PA2 (TIM2_CH3) */
#define VND_CMD_TOGGLE_TIM2CH3_INV 0x32u
#ifndef VND_CMD_SET_TX_ENABLE
#define VND_CMD_SET_TX_ENABLE   0x33u /* payload: u8 0/1; persistent active-low external TX enable on PA1 */
#endif
#ifndef VND_CMD_SET_OPTIC_POWER
#define VND_CMD_SET_OPTIC_POWER 0x34u /* payload: u8 0..255 (мощность оптического TX) */
#endif
#ifndef VND_CMD_LED_EVENT
#define VND_CMD_LED_EVENT       0x35u /* payload: u8 event, u16 duration_ms */
#endif
#ifndef VND_CMD_SET_OPTIC_HOLD
#define VND_CMD_SET_OPTIC_HOLD  0x39u /* payload: u16 deciseconds; legacy u8 seconds accepted */
#endif
#ifndef VND_CMD_SET_LED_PATTERN
#define VND_CMD_SET_LED_PATTERN 0x3Bu /* payload: u8 ws2812_pattern_t */
#endif
#ifndef VND_CMD_SET_DET_ADC
#define VND_CMD_SET_DET_ADC     0x3Cu /* payload: u8 bit0=DetADC1, bit1=DetADC2 */
#endif
#ifndef VND_CMD_HOST_RX_ACK
#define VND_CMD_HOST_RX_ACK     0x36u /* payload: u32 total host-received A/B frames */
#endif
#ifndef VND_CMD_HOST_RX_CLEAR
#define VND_CMD_HOST_RX_CLEAR   0x37u /* payload: none, clear host receive heartbeat */
#endif
/* ДОБАВЛЕНО: управление окнами/частотой */
#define VND_CMD_SET_WINDOWS    0x10u /* payload: start0,len0,start1,len1 (LE, u16) */
#define VND_CMD_SET_BUF_RATE_FINE 0x1Cu /* payload: marker_hz (<=350) или buf_rate_hz (>350), fine 180-250 Hz */
#ifndef VND_CMD_SET_SYNC_MODE
#define VND_CMD_SET_SYNC_MODE     0x1Du /* persistent local MASTER/SLAVE: mode + u64 Unix ms LE */
#endif
#define VND_CMD_SET_RS485_ID      0x3Du /* local USB only: u8 device_id 0..31 */
#ifndef VND_CMD_SET_RS485_IP
#define VND_CMD_SET_RS485_IP      0x3Eu /* payload: u8 ip[4] network order */
#endif
#ifndef VND_CMD_REQUEST_RS485_IDENT
#define VND_CMD_REQUEST_RS485_IDENT 0x3Fu /* payload none: start one identity scan */
#endif
#ifndef VND_CMD_GET_RS485_IDENT
#define VND_CMD_GET_RS485_IDENT   0x40u /* payload: optional u8 node_id, returns RID1 */
#endif
#ifndef VND_CMD_SET_LCD_ROLE_OVERLAY
#define VND_CMD_SET_LCD_ROLE_OVERLAY 0x41u /* payload: u8 enable, optional u8 period_s, u8 duration_s */
#endif
#ifndef VND_CMD_SET_RPI_INFO
#define VND_CMD_SET_RPI_INFO      0x42u /* payload: u16 RPI number LE + IPv4[4] */
#endif
#ifndef VND_CMD_GET_RS485_SENSOR
#define VND_CMD_GET_RS485_SENSOR  0x43u /* EP0 IN: SNS1 */
#endif
#define VND_CMD_SET_BLOCK_HZ   0x11u /* payload: u16 hz (20..100) или 0xFFFF=макс (100) */
/* Новая команда: установка ограничения числа выборок на канал в рабочем кадре */
#define VND_CMD_SET_TRUNC_SAMPLES 0x16u /* payload: u16 samples (0=отключить усечение) */
/* Новая команда: явная установка samples_per_frame для управления FPS (пара A+B ≈ Fs/samples) */
#define VND_CMD_SET_FRAME_SAMPLES 0x17u /* payload: u16 samples_per_frame (на канал) */
/* Новый режим: асинхронная передача A/B — без строгого чередования A→B; какой готов, тот и уходит */
#define VND_CMD_SET_ASYNC_MODE   0x18u /* payload: u8 mode (0=pairing/strict A->B, 1=async A/B independent) */
/* Новый режим выбора каналов: 0=A-only, 1=B-only, 2=both */
#define VND_CMD_SET_CHMODE       0x19u /* payload: u8 mode (0=A-only, 1=B-only, 2=both) */

/* Режимы стриминга (поведение выбора кадров/окна)
     SET_STREAM_MODE payload:
         - [1] u8 mode: 0=LATEST (lossy), 1=LOSSLESS_ROI, 2=AVG_ROI
         - [2] u8 avg_n (опционально, только для mode=2): 1..64, default=24
*/
#define VND_CMD_SET_STREAM_MODE  0x1Au
/* One scalar DC speed: u32 settle_ms, 0=learning off. */
#define VND_CMD_SET_DC_SPEED     0x1Fu
#define VND_CMD_SAVE_DC_TO_FLASH 0x2Bu
#define VND_CMD_GET_DC_CONFIG    0x3Au

