kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Sync master/slave via TIM16 CH1 */
static volatile uint8_t  vnd_sync_mode = VND_SYNC_MODE_SLAVE; /* 0=master, 1=slave, 2=off */
static volatile uint16_t vnd_sync_pending_hz = 0;
static volatile uint16_t vnd_sync_last_hz = 0;
static volatile uint32_t vnd_sync_last_apply_ms = 0;
static volatile uint32_t vnd_sync_last_capture = 0;
static volatile uint8_t  vnd_sync_capture_valid = 0;
static volatile uint32_t vnd_sync_tick_hz = 1000000u; /* TIM16 IC tick (Hz) */
static volatile uint32_t vnd_sync_last_capture_ms = 0;

/* Public status for LCD */
volatile uint8_t  vnd_sync_mode_public = VND_SYNC_MODE_SLAVE;
volatile uint8_t  vnd_sync_ok_public = 1u;
static volatile uint8_t  vnd_sync_mode_host_forced = 0u;
volatile uint8_t  vnd_lcd_role_overlay_enabled = 0u;
volatile uint8_t  vnd_lcd_role_overlay_active = 0u;
volatile uint8_t  vnd_lcd_role_overlay_period_s = 4u;
volatile uint8_t  vnd_lcd_role_overlay_duration_s = 4u;
volatile uint8_t  vnd_lcd_role_overlay_color_id = VND_LCD_SYNC_COLOR_WHITE;
volatile uint16_t vnd_lcd_role_overlay_rgb565 = 0xFFFFu;
volatile uint32_t vnd_lcd_role_overlay_config_seq = 0u;

static uint8_t vnd_lcd_role_overlay_clamp_s(uint8_t value_s)
{
    if (value_s < 3u) {
        return 3u;
    }
    if (value_s > 5u) {
        return 5u;
    }
    return value_s;
}

void vnd_lcd_role_overlay_configure(uint8_t enabled, uint8_t period_s, uint8_t duration_s)
{
    vnd_lcd_role_overlay_period_s = vnd_lcd_role_overlay_clamp_s(period_s);
    vnd_lcd_role_overlay_duration_s = vnd_lcd_role_overlay_clamp_s(duration_s);
    vnd_lcd_role_overlay_enabled = (enabled != 0u) ? 1u : 0u;
    vnd_lcd_role_overlay_active = 0u;
    vnd_lcd_role_overlay_config_seq++;
    need_usb_status_refresh = 1u;
}

void vnd_sync_on_edge(void)
{
    vnd_sync_last_capture_ms = HAL_GetTick();
    vnd_sync_ok_public = 1u;
}

/* TX диагностика */
static volatile uint8_t  vnd_tx_ready = 1;      /* готовность к новой передаче */
static volatile uint16_t vnd_last_tx_len = 0;   /* длина последней передачи */
static volatile uint32_t vnd_last_tx_start_ms = 0; /* время начала последней передачи */
/* Резерв: последний отправленный буфер (для fallback классификации при проблемах с meta-FIFO) */
static volatile uint8_t  last_tx_is_frame = 0;
static volatile uint8_t  last_tx_flags = 0;     /* 0x01=A, 0x02=B, 0x80=TEST */
static volatile uint32_t last_tx_seq = 0;
/* Простой «истинный» маркер текущей передачи (в полёте) — не зависит от очереди метаданных */
static volatile uint8_t  inflight_is_frame = 0;
static volatile uint8_t  inflight_flags = 0; /* 0x01/0x02/0x80 */
static volatile uint32_t inflight_seq = 0;
/* Режим полноценный/диагностический */
static volatile uint8_t full_mode = 1;          /* 1 = слать рабочие ADC кадры, 0 = только тест/статус */
static volatile uint64_t vnd_total_tx_bytes = 0ULL;
/* Ограничение выборок (0 = без ограничения -> берём полный буфер профиля) */
static volatile uint16_t vnd_trunc_samples = 0;
/* Параметры кадровой частоты */
static volatile uint16_t vnd_frame_samples_req = 0; /* если 0 — вычислять по умолчанию под ~20 FPS */
static volatile uint16_t vnd_pair_period_ms = 50;   /* целевой период пары A+B в миллисекундах */
static volatile uint32_t vnd_next_pair_ms = 0;      /* следующий момент разрешения отправки A новой пары */
static volatile uint32_t vnd_next_frame_tx_ms = 0;  /* минимальный момент старта следующего A/B IN */
static volatile uint8_t  vnd_last_tx_pace_busy = 0;
/* Флаг: первая полноценная пара (A->B) завершена. До этого STAT между парами стараемся не слать. */
static volatile uint8_t first_pair_done = 0;
/* Базовая отметка суммарных байт на момент START для вычисления дельты к STOP */
static volatile uint64_t vnd_tx_bytes_at_start = 0ULL;
/* Флаг для продолжения передачи из main/таска после TXCPLT */
volatile uint8_t vnd_tx_kick = 0;

/* Асинхронный режим передачи: 0 = строгие пары A->B (по умолчанию), 1 = A/B независимы */
static volatile uint8_t async_mode = 0;
/* Флаг: хост явно задавал async_mode через SET_ASYNC_MODE.
    Нужен, чтобы START не перетирал настройку и можно было включать парный/ROI режим. */
static volatile uint8_t async_mode_host_set = 0;
/* Режим каналов: 0=A-only, 1=B-only, 2=both (default) */
static volatile uint8_t vnd_ch_mode = 2;

/* Дефолтный размер кадра в полном режиме (семплов на канал) */
#ifndef VND_FULL_DEFAULT_SAMPLES
#define VND_FULL_DEFAULT_SAMPLES 300
#endif

/* Тестовый режим: генерация пилообразного сигнала вместо реальных данных ADC */
#define USE_TEST_SAWTOOTH 0 /* Отключаем полную замену пайплайна тестовым источником */
/* Новый мягкий режим: подменяем полезную нагрузку на пилу, но сохраняем ADC/DMA и async. */
#ifndef TEST_OVERLAY_SAWTOOTH
#define TEST_OVERLAY_SAWTOOTH 0  /* DISABLED: Testing real ADC data with forced EXTSEL/EXTEN */
#endif
/* реализация генератора тестового сигнала вынесена в vnd_testgen.* */
/* Разрешение на отправку STAT в стриме: 0=запрещено, 1=разрешён один STAT */
volatile uint8_t vnd_status_permit_once = 0;
/* Отложенная отправка тестового кадра после ACK-STAT */
static volatile uint8_t test_pending = 0;
/* Управление стартовым STAT (ACK на START) и единоразовым тестом */
static volatile uint8_t start_stat_planned = 0;   /* устаревший флаг, не используем для новой логики */
static volatile uint8_t start_stat_inflight = 0;  /* Стартовый STAT начат, ждём его завершения */
/* Флаг «ACK на START завершён» — разрешает единовременную отправку тестового кадра из таска */
static volatile uint8_t start_ack_done = 0;
/* Новые флаги пошаговой последовательности */
static volatile uint8_t status_ack_pending = 0;   /* Нужно отправить ACK-STAT на START (только из таска) */
static volatile uint8_t stop_request = 0;         /* Запрошен STOP (нужно отправить STAT, затем остановить) */
static volatile uint8_t stop_stat_inflight = 0;   /* Сейчас в полёте STAT как ACK на STOP */
/* Диагностика подготовки пар */
static volatile uint32_t dbg_prepare_calls = 0;
static volatile uint32_t dbg_prepare_ok = 0;
static volatile uint32_t dbg_task_calls = 0; /* сколько раз заходили в Vendor_Stream_Task */
static volatile uint32_t dbg_task_gap_count = 0;
static volatile uint32_t dbg_task_gap_last_ms = 0;
static volatile uint32_t dbg_task_gap_max_ms = 0;
static volatile uint32_t dbg_tx_force_idle_count = 0;
static volatile uint32_t dbg_tx_force_idle_last_ms = 0;
static volatile uint32_t dbg_tx_drop_recovery_count = 0;
static volatile uint32_t dbg_tx_drop_recovery_last_ms = 0;
static volatile uint32_t dbg_tx_drop_recovery_request_count = 0;
static volatile uint32_t dbg_tx_active_hold_count = 0;
static volatile uint32_t dbg_tx_active_hold_last_ms = 0;
static volatile uint8_t  vnd_tx_drop_recovery_request = 0;
/* Счётчик пропущенных кадров (last-buffer-wins): сколько кадров FIFO было перескочено */
static volatile uint32_t dbg_skipped_frames = 0;

/* Состояния передачи пары */
static uint8_t channel0_sent_curseq = 0;
static uint8_t channel1_sent_curseq = 0;
static uint32_t __attribute__((unused)) last_sent_seq_adc0 = 0xFFFFFFFFu;
static uint32_t __attribute__((unused)) last_sent_seq_adc1 = 0xFFFFFFFFu;

/* Буфер статуса */
#ifndef VND_STATUS_MAX
#define VND_STATUS_MAX 137u
#endif
#ifndef VND_BULK_STATUS_MAX
#define VND_BULK_STATUS_MAX 136u
#endif
static uint8_t status_buf[VND_BULK_STATUS_MAX];
static vnd_status_v1_t g_status;
static volatile uint8_t pending_status = 0; /* требуется отправить STAT при освобождении EP */
/* Асинхронные event-пакеты для host-side change stream. */
#ifndef VND_EVENT_MAX
#define VND_EVENT_MAX 64u
#endif
#ifndef VND_EVENT_HDR_SIZE
#define VND_EVENT_HDR_SIZE 16u
#endif
#ifndef VND_EVENT_QUEUE_LEN
#define VND_EVENT_QUEUE_LEN 8u
#endif
#ifndef VND_TEMP_EVENT_PERIOD_MS
#define VND_TEMP_EVENT_PERIOD_MS 2000u
#endif
#ifndef VND_STATE_EVENT_PERIOD_MS
#define VND_STATE_EVENT_PERIOD_MS 250u
#endif
#ifndef VND_EVENT_HEARTBEAT_MS
#define VND_EVENT_HEARTBEAT_MS 30000u
#endif
#ifndef VND_SENSOR_VDDA_DELTA_MV
#define VND_SENSOR_VDDA_DELTA_MV 20u
#endif
#ifndef VND_SENSOR_VBAT_DELTA_MV
#define VND_SENSOR_VBAT_DELTA_MV 50u
#endif
static uint8_t vnd_event_q[VND_EVENT_QUEUE_LEN][VND_EVENT_MAX];
static uint8_t vnd_event_tx_buf[VND_EVENT_MAX];
static uint8_t vnd_event_len[VND_EVENT_QUEUE_LEN];
static volatile uint8_t vnd_event_head = 0u;
static volatile uint8_t vnd_event_tail = 0u;
static volatile uint8_t vnd_event_count = 0u;
static volatile uint32_t vnd_event_seq = 0u;
static volatile uint32_t vnd_event_last_enqueue_ms = 0u;
static volatile uint32_t dbg_event_enqueued = 0u;
static volatile uint32_t dbg_event_tx_attempt = 0u;
static volatile uint32_t dbg_event_tx_ok = 0u;
static volatile uint32_t dbg_event_tx_fail = 0u;
static volatile uint32_t dbg_event_tx_defer = 0u;
static volatile uint32_t dbg_event_tx_cplt = 0u;
static volatile uint32_t dbg_event_dropped = 0u;
static volatile uint8_t dbg_event_last_enqueue_type = 0xFFu;
static volatile uint8_t dbg_event_last_tx_type = 0xFFu;
static volatile uint8_t dbg_event_last_cplt_type = 0xFFu;
static volatile uint8_t vnd_event_inflight_type = 0xFFu;
static volatile uint8_t vnd_event_inflight_len = 0u;
static volatile uint32_t vnd_event_next_tx_ms = 0u;
static volatile uint8_t vnd_change_force_event = 1u;
static uint32_t vnd_sensor_last_poll_ms = 0u;
static uint32_t vnd_state_last_poll_ms = 0u;
static int16_t vnd_temp_last_sent_c = (int16_t)-32768;
static int16_t vnd_temp_last_read_c = 0;
static mcu_internal_adc_v1_t vnd_mcu_adc_last_sent;
static uint8_t vnd_mcu_adc_have_last = 0u;
static uint8_t vnd_optic_last_payload[8];
static uint8_t vnd_optic_last_len = 0u;
static uint8_t vnd_optic_have_last = 0u;
static uint8_t vnd_sync_last_payload[16];
static uint8_t vnd_sync_last_len = 0u;
static uint8_t vnd_sync_have_last = 0u;
static uint8_t vnd_sensor_map_last_payload[40];
static uint8_t vnd_sensor_map_last_len = 0u;
static uint8_t vnd_sensor_map_have_last = 0u;
static uint8_t vnd_mode_last_payload[16];
static uint8_t vnd_mode_last_len = 0u;
static uint8_t vnd_mode_have_last = 0u;
static uint8_t vnd_error_last_payload[16];
static uint8_t vnd_error_last_len = 0u;
static uint8_t vnd_error_have_last = 0u;
static volatile uint32_t dbg_frame_crc_finalized = 0u;
static volatile uint16_t dbg_frame_crc_last = 0u;
/* ADC frame reserved2 diagnostics for async source snapshot integrity. */
static volatile uint32_t dbg_async_snapshot_copies[2] = {0u, 0u};
static volatile uint32_t dbg_async_snapshot_gen_move[2] = {0u, 0u};
static volatile uint32_t dbg_async_snapshot_fifo_guard[2] = {0u, 0u};
static volatile uint32_t dbg_async_consume_ok[2] = {0u, 0u};
static volatile uint32_t dbg_async_consume_fail[2] = {0u, 0u};
static volatile uint32_t dbg_async_last_dma_seq[2] = {0u, 0u};
static volatile uint32_t dbg_async_last_wr_before[2] = {0u, 0u};
static volatile uint32_t dbg_async_last_wr_after[2] = {0u, 0u};
static volatile uint32_t dbg_async_last_rd_before[2] = {0u, 0u};
static volatile uint32_t dbg_async_last_rd_after[2] = {0u, 0u};
static volatile uint32_t dbg_async_last_ms[2] = {0u, 0u};
static volatile uint16_t dbg_async_last_samples[2] = {0u, 0u};
static volatile uint16_t dbg_async_last_reserved2[2] = {0u, 0u};
static volatile uint16_t dbg_async_last_crc16[2] = {0u, 0u};

#define VND_R2_BUFFER_INDEX_MASK      0x0007u
#define VND_R2_SOURCE_SLOT_SHIFT      3u
#define VND_R2_SOURCE_SLOT_MASK       0x00F8u
#define VND_R2_SNAPSHOT_USED          0x0100u
#define VND_R2_GENERATION_MOVED       0x0200u
#define VND_R2_FIFO_GUARD             0x0400u
#define VND_R2_CONSUME_OK             0x0800u
#define VND_R2_TXCPLT_SHIFT           12u
#define VND_R2_TXCPLT_MASK            0xF000u
/* Новые этапы (stage) времени старта потока/интерфейса */
volatile uint32_t vnd_stage_alt1_ms = 0;      /* фиксируется при SET_INTERFACE alt=1 */
volatile uint32_t vnd_stage_first_frame_ms = 0; /* фиксируется при первом успешном TXCPLT A/B */

/* Состояние фейковых кадров */
static __attribute__((unused)) uint8_t fake_inflight = 0;   /* reserved for diag */
static uint8_t diag_mode_active = 0; /* 1 = слать диагностические пары постоянно */
static uint16_t diag_hz = 60;        /* частота кадров-пар, Гц (20..100) (информативно) */
static uint32_t diag_period_ms = 0;  /* не используется для темпирования (макс. скорость) */
static uint32_t diag_next_ms = 0;    /* не используется для темпирования (сохранено для совместимости) */
static uint16_t diag_samples = VND_DEFAULT_TEST_SAMPLES; /* сэмплов на канал в диагностическом режиме */
static uint16_t diag_frame_len = 0;  /* общий размер кадра (hdr+payload) в диагностике */
/* Буферы диагностических кадров A/B (живут до завершения передачи) */
static uint8_t diag_a_buf[VND_FRAME_MAX_SIZE];
static uint8_t diag_b_buf[VND_FRAME_MAX_SIZE];
/* Последовательно подготовленная пара для текущего stream_seq в DIAG: */
static uint32_t diag_prepared_seq = 0xFFFFFFFFu;
static uint32_t diag_current_pair_seq = 0xFFFFFFFFu;
static uint16_t win_start0 = 0, win_len0 = 0, win_start1 = 0, win_len1 = 0;
static uint8_t win_auto = 1; /* авто-окно для ROI (зависит от частоты) */

#ifndef VND_ROI_LEN_DEFAULT
#define VND_ROI_LEN_DEFAULT 200u
#endif
#ifndef VND_ROI_BASE_START_200HZ
#define VND_ROI_BASE_START_200HZ 300u
#endif
#ifndef VND_ROI_BASE_MARKER_HZ
#define VND_ROI_BASE_MARKER_HZ 200u
#endif

static uint16_t vnd_compute_auto_roi_start(uint16_t samples, uint16_t marker_hz)
{
    int32_t delta = (int32_t)marker_hz - (int32_t)VND_ROI_BASE_MARKER_HZ;
    int32_t start = (int32_t)VND_ROI_BASE_START_200HZ + delta;
    int32_t max_start = (int32_t)samples - (int32_t)VND_ROI_LEN_DEFAULT;
    if (max_start < 0) max_start = 0;
    if (start < 0) start = 0;
    if (start > max_start) start = max_start;
    return (uint16_t)start;
}

static void vnd_apply_auto_roi_window(void)
{
    uint16_t samples = adc_stream_get_active_samples();
    if (samples == 0u) samples = 600u;
    uint16_t buf_rate = adc_stream_get_buf_rate();
    uint16_t marker_hz = (buf_rate != 0u) ? (uint16_t)(buf_rate / 2u) : (uint16_t)VND_ROI_BASE_MARKER_HZ;
    uint16_t new_start = vnd_compute_auto_roi_start(samples, marker_hz);
    win_len0 = VND_ROI_LEN_DEFAULT;
    win_start0 = new_start;
    win_start1 = 0u;
    win_len1 = 0u;
}

/* Текущий режим стриминга (по умолчанию оставляем текущий "последний буфер") */
static volatile uint8_t vnd_stream_mode = VND_STREAM_MODE_LATEST;

