kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static inline uint8_t vnd_frame_pace_applies(void)
{
#if VND_USB_FRAME_PACE_MS > 0
    if(!streaming || diag_mode_active) return 0u;
    /* AVG_ROI is already rate-limited by buf_rate / avg_n. Extra USB pacing
       throttles avg_n=8/16 below their expected 50/25 fps and delays B after A. */
    return (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI) ? 1u : 0u;
#else
    return 0u;
#endif
}

static inline uint8_t vnd_frame_pace_ready(uint32_t now_ms)
{
    if(!vnd_frame_pace_applies()) return 1u;
#if VND_USB_AFTER_HOST_ACK_PACE_MS > 0
    if(vnd_last_host_rx_ack_ms != 0u){
        uint32_t ack_age_ms = 0u;
        if(vnd_tick_age_ms(now_ms, vnd_last_host_rx_ack_ms, &ack_age_ms) &&
           ack_age_ms < (uint32_t)VND_USB_AFTER_HOST_ACK_PACE_MS){
            return 0u;
        }
    }
#endif
    if(vnd_next_frame_tx_ms == 0u) return 1u;
    return ((int32_t)(now_ms - vnd_next_frame_tx_ms) >= 0) ? 1u : 0u;
}

static inline void vnd_frame_pace_arm(uint32_t now_ms)
{
    if(vnd_frame_pace_applies()){
        vnd_next_frame_tx_ms = now_ms + (uint32_t)VND_USB_FRAME_PACE_MS;
    }
}

/* stream_mode=2: усреднение ROI по N буферам, раздельно для even/odd. */
static volatile uint8_t vnd_avg_n = 24; /* 8..64 (рабочие значения: 8/16/24/32/40/48/56/64) */
static uint8_t vnd_avg_cnt[2] = {0,0};
static uint8_t vnd_avg_next_parity = 0; /* 0=even, 1=odd (legacy; не используется для выпуска кадров) */
static uint32_t vnd_avg_last_dma_seq[2] = {0,0};
static uint32_t vnd_avg_last_ts_ms[2] = {0,0};
static uint32_t vnd_avg_sum[2][2][MAX_FRAME_SAMPLES]; /* [parity][ch][i] */
static __attribute__((unused)) uint16_t vnd_avg_out[2][MAX_FRAME_SAMPLES];    /* [ch][i] */

/* Диагностика stream_mode=2: сколько входных кадров съели / сколько усреднённых выпустили */
static volatile uint32_t dbg_avg_in_frames = 0;
static volatile uint32_t dbg_avg_out_frames = 0;
static volatile uint32_t dbg_avg_tx_pairs = 0;
static uint32_t dbg_avg_last_print_ms = 0;
static uint32_t dbg_avg_in_last = 0, dbg_avg_out_last = 0, dbg_avg_tx_last = 0;

/* DC: параметры */
#ifndef VND_DC_ROI_LEN
#define VND_DC_ROI_LEN 200u
#endif
#ifndef VND_DC_SAVE_PERIOD_MS
#define VND_DC_SAVE_PERIOD_MS (0u) /* отключено: сохранение только по команде хоста (0x2B) */
#endif
#ifndef VND_DC_SAVE_PERIOD_FIRST_MS
#define VND_DC_SAVE_PERIOD_FIRST_MS (0u) /* отключено: сохранение только по команде хоста (0x2B) */
#endif

/* Time-based adaptive DC. RPI sends the only runtime parameter: settle_ms.
   Zero disables learning; 1 is fastest; 1000 means one second. */
#ifndef VND_DC_SETTLE_MAX_MS
#define VND_DC_SETTLE_MAX_MS    (24u*60u*60u*1000u)
#endif
/* Proportional gain 8 gives exp(-8*t/settle). From 32768 LSB to the 16-LSB
   deadband this takes ln(32768/16)/8 = 0.953 * settle_ms. */
#ifndef VND_DC_ADAPTIVE_GAIN
#define VND_DC_ADAPTIVE_GAIN (8u)
#endif
#ifndef VND_DC_TARGET_ZERO
#define VND_DC_TARGET_ZERO (32768u)
#endif

/* Deadband для адаптации DC вокруг midscale.
    Без deadband даже при правильном DC из-за шума знак (v-32768) будет часто меняться,
    что приводит к "random walk" (постоянно dirty и ощущение, что после reboot всё заново).
    Значение в LSB. */
#ifndef VND_DC_DEADBAND
#define VND_DC_DEADBAND 16u
#endif

/* ВНИМАНИЕ: адрес Flash должен быть вне области прошивки.
   Мы резервируем последний сектор через линкер (см. STM32H723VGTX_FLASH.ld).
   Для 1MB FLASH: база последнего сектора = 0x080E0000 (128KB сектор №7). */
#ifndef VND_DC_FLASH_ADDR
#define VND_DC_FLASH_ADDR 0x080E0000u
#endif

#define VND_DC_MAGIC 0x31434456u /* 'V''D''C''1' little-endian */
/* ver=5: one shared DC table; pre/post select only the processing location. */
#define VND_DC_VER   5u

typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint16_t ver;
    uint16_t roi_len; /* ожидаем 200 */
    uint32_t write_counter;
    uint16_t crc16; /* CRC16-CCITT по полю data[] */
    uint16_t _rsv0;

    int16_t  dc[2][2][VND_DC_ROI_LEN]; /* shared [ch][parity][i] DC correction */
    /* The previous blob was 1648 bytes but already occupied a 1664-byte
       flashword-aligned journal slot. The extra 16 bytes therefore add the
       selected-SLAVE metadata without changing slot addresses. */
    uint8_t  _pad[48];
} vnd_dc_blob_t;

/* Stored in the first 28 bytes of vnd_dc_blob_t::_pad. The last four bytes of
   _pad remain the existing DC commit marker, so DC journal v5 stays readable. */
#define VND_RS485_ROLE_META_MAGIC 0x5253u /* 'SR' */
#define VND_RS485_ROLE_META_VER_LEGACY 1u
#define VND_RS485_ROLE_META_VER        2u
typedef struct __attribute__((packed)) {
    uint16_t magic;
    uint8_t version;
    uint8_t flags;
    uint8_t node_id;
    uint8_t slave_id_high_water;
    uint32_t master_assigned_unix_s;
    uint16_t master_assigned_millis;
    uint8_t master_uid[12];
    uint16_t crc16;
    uint8_t reserved[2];
} vnd_rs485_role_meta_t;

/* Stored after the unchanged commit marker at _pad+32. Presence/validity is
   protected by flags in vnd_rs485_role_meta_t; this compact record stores a
   UID64 prefix, sufficient to recognize the selected board after reboot. A
   later RS485 claim/enum ACK upgrades it to the full UID96 in RAM. */
typedef struct __attribute__((packed)) {
    uint32_t slave_assigned_unix_s;
    uint16_t slave_assigned_millis;
    uint8_t slave_uid_prefix[8];
    uint16_t crc16;
} vnd_rs485_slave_meta_t;

/* Flash layout: append-only journal inside the reserved 128KB sector.
   This avoids long sector erase on every save (which can stall USB/main loop).
   We erase the sector only when it becomes full or journal tail is corrupted.
   Slot size must be multiple of 32 bytes for FLASHWORD programming. */
#define VND_DC_FLASH_SECTOR_SIZE (0x20000u)
#define VND_DC_SLOT_SIZE         (((uint32_t)sizeof(vnd_dc_blob_t) + 31u) & ~31u)
#define VND_DC_COMMIT_MAGIC      0x21434456u /* 'VDC!' little-endian */
#define VND_DC_COMMIT_OFFSET     ((uint32_t)offsetof(vnd_dc_blob_t, _pad) + 28u)
#define VND_RS485_SLAVE_META_OFFSET ((uint32_t)offsetof(vnd_dc_blob_t, _pad) + 32u)
#define VND_DC_RECOVERY_MAGIC    0x44524356u /* 'VCRD' little-endian */

_Static_assert((VND_DC_SLOT_SIZE % 32u) == 0u, "DC journal slot must be flashword aligned");
_Static_assert((VND_DC_COMMIT_OFFSET + sizeof(uint32_t)) <= sizeof(vnd_dc_blob_t),
               "DC commit marker must stay inside the blob");
_Static_assert(sizeof(vnd_rs485_role_meta_t) == 28u,
               "RS485 role metadata must leave the DC commit marker intact");
_Static_assert(sizeof(vnd_rs485_slave_meta_t) == 16u,
               "selected-SLAVE metadata must fit the old aligned journal slot");
_Static_assert(sizeof(vnd_dc_blob_t) == VND_DC_SLOT_SIZE,
               "extended DC blob must exactly fill one journal slot");

#ifndef VND_DC_SAVE_DRY_RUN
#define VND_DC_SAVE_DRY_RUN      0u
#endif

#ifndef VND_DC_SAVE_UNLOCK_TEST
#define VND_DC_SAVE_UNLOCK_TEST  0u
#endif

