kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
#ifndef VND_DC_SAVE_ERASE_ENABLE
#define VND_DC_SAVE_ERASE_ENABLE 1u
#endif

#ifndef VND_DC_SAVE_ERASE_ONLY_TEST
#define VND_DC_SAVE_ERASE_ONLY_TEST 0u
#endif

static int16_t  vnd_dc_buf[2][2][VND_DC_ROI_LEN];
static uint8_t  vnd_dc_loaded = 0;
static uint8_t  vnd_dc_dirty = 0;
static uint32_t vnd_dc_write_counter = 0;
static uint32_t vnd_dc_flash_next_off = 0;
static uint32_t vnd_dc_last_save_ms = 0;
static uint32_t vnd_dc_last_dirty_log_ms = 0;
static volatile uint8_t vnd_dc_load_request = 0;
static volatile uint8_t vnd_dc_save_request = 0;
/* One coefficient bank and one time base per channel/parity. Fractional Q16
   progress is kept per sample so slow RPI settings remain accurate without a
   forced one-LSB step. */
static uint32_t vnd_dc_last_adapt_ms[2][2];
static uint32_t vnd_dc_adapt_frac_q16[2][2][VND_DC_ROI_LEN];

volatile uint32_t vnd_dc_speed_settle_ms = 0u;
volatile uint32_t vnd_dc_speed_set_at_ms = 0u;
volatile uint32_t vnd_dc_speed_cmd_count = 0u;
volatile uint32_t vnd_dc_speed_reject_count = 0u;
volatile uint32_t vnd_dc_adapt_call_count = 0u;
volatile uint32_t vnd_dc_adapt_updates = 0u;
volatile uint32_t vnd_dc_adapt_last_ms = 0u;
volatile uint32_t vnd_dc_adapt_last_dt_ms = 0u;
volatile uint32_t vnd_dc_adapt_max_abs_err = 0u;
volatile uint32_t vnd_dc_adapt_max_corr = 0u;
volatile int32_t  vnd_dc_adapt_mean_err = 0;

/* После reboot "чет/нечет" (parity) может оказаться инвертирован относительно того, что было
    во время обучения/сохранения (из-за фазировки старта DMA/TIM).
    Мы НЕ смешиваем 4 DC массива, а один раз на старте определяем swap (0/1) и дальше
    используем parity^swap при применении/адаптации. */
static uint8_t vnd_dc_parity_swap = 0;
static uint8_t vnd_dc_parity_swap_valid = 0;

static void vnd_dc_load_once(void);
static void vnd_dc_apply_only(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len);
static void vnd_dc_apply_and_adapt(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len);
static void vnd_avg_reset(void);

/* Exported counters for LCD/diagnostics (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_save_ok_count = 0;
volatile uint32_t vnd_dc_save_fail_count = 0;
volatile uint32_t vnd_dc_save_last_ms = 0;
volatile uint8_t  vnd_dc_save_last_result = 0; /* 0=none, 1=ok, 2=fail */

/* Public mirror of blob write_counter for LCD/debug (see usb_vendor_app.h) */
volatile uint32_t vnd_dc_write_counter_public = 0;

/* Exported live state for LCD progress indicator */
volatile uint8_t  vnd_dc_dirty_public = 0;
volatile uint32_t vnd_dc_dirty_since_ms = 0;
volatile uint32_t vnd_dc_save_period_ms = (uint32_t)VND_DC_SAVE_PERIOD_MS;

/* DC save diagnostics */
volatile uint32_t vnd_dc_save_last_err = 0;
volatile uint32_t vnd_dc_save_last_sector_error = 0;
volatile uint32_t vnd_dc_save_last_bank = 0;
volatile uint32_t vnd_dc_save_last_sector = 0;

/* DC load diagnostics (published for LCD) */
volatile uint8_t  vnd_dc_load_flags_public = 0; /* bit0=loaded OK, bit1=erase_pending */
volatile uint16_t vnd_dc_loaded_crc16_public = 0;
volatile uint32_t vnd_dc_flash_next_off_public = 0;

void vnd_dc_request_save_to_flash(void)
{
    vnd_dc_save_request = 1u;
}

static void vnd_dc_reset_adapt_timestamps(void)
{
    memset(vnd_dc_last_adapt_ms, 0, sizeof(vnd_dc_last_adapt_ms));
    memset(vnd_dc_adapt_frac_q16, 0, sizeof(vnd_dc_adapt_frac_q16));
}

static void vnd_dc_reset_adapt_state(void)
{
    vnd_dc_reset_adapt_timestamps();
}

/* ADC restart can start the physical even/odd marker from the opposite phase.
   The coefficients themselves remain valid, but their parity mapping must be
   selected again before the first new frame is processed. */
static __attribute__((unused)) void vnd_dc_on_adc_restart(void)
{
    vnd_dc_parity_swap_valid = 0u;
    /* The RPI speed is wall-clock based and remains active across ADC restarts.
       Preserve per-bank timestamps/budgets so the next frame catches up instead
       of restarting the requested settle interval from an artificial 20 ms. */
}

static uint32_t vnd_dc_rd_le32(const uint8_t *p)
{
    return (uint32_t)p[0] |
           ((uint32_t)p[1] << 8) |
           ((uint32_t)p[2] << 16) |
           ((uint32_t)p[3] << 24);
}

static uint8_t vnd_dc_apply_speed_payload(const uint8_t *payload, uint32_t payload_len)
{
    if(payload == NULL || payload_len != sizeof(uint32_t)) return 0u;

    uint32_t settle_ms = vnd_dc_rd_le32(payload);
    if(settle_ms > (uint32_t)VND_DC_SETTLE_MAX_MS) return 0u;
    if(settle_ms != vnd_dc_speed_settle_ms){
        /* A speed change only changes the gain from the next update onward.
           Keep the per-bank wall-clock timestamps and sub-LSB Q16 residue so
           repeated RPI speed commands cannot restart or stall convergence. */
        vnd_dc_speed_settle_ms = settle_ms;
    }
    vnd_dc_speed_set_at_ms = HAL_GetTick();
    vnd_dc_speed_cmd_count++;
    return 1u;
}

typedef struct {
    uint32_t magic;
    uint32_t magic_inv;
    uint32_t fault_addr;
    uint32_t cfsr;
    uint32_t count;
} vnd_dc_recovery_t;

static volatile vnd_dc_recovery_t __attribute__((section(".noinit"))) vnd_dc_recovery;

static uint8_t vnd_dc_flash_addr_in_range(uint32_t addr)
{
    return (uint8_t)((addr >= (uint32_t)VND_DC_FLASH_ADDR) &&
                     (addr < ((uint32_t)VND_DC_FLASH_ADDR + (uint32_t)VND_DC_FLASH_SECTOR_SIZE)));
}

uint8_t vnd_dc_note_flash_fault(uint32_t fault_addr, uint32_t cfsr)
{
    if(!vnd_dc_flash_addr_in_range(fault_addr)) return 0u;

    if(vnd_dc_recovery.magic != VND_DC_RECOVERY_MAGIC ||
       vnd_dc_recovery.magic_inv != ~VND_DC_RECOVERY_MAGIC){
        vnd_dc_recovery.count = 0;
    }
    vnd_dc_recovery.magic = VND_DC_RECOVERY_MAGIC;
    vnd_dc_recovery.magic_inv = ~VND_DC_RECOVERY_MAGIC;
    vnd_dc_recovery.fault_addr = fault_addr;
    vnd_dc_recovery.cfsr = cfsr;
    vnd_dc_recovery.count++;
    return 1u;
}

static void vnd_dc_flash_clear_error_flags(void)
{
#if defined(FLASH_FLAG_ALL_ERRORS)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
#elif defined(FLASH_FLAG_ALL_ERRORS_BANK1)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK1);
    #if defined(FLASH_FLAG_ALL_ERRORS_BANK2)
        __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK2);
    #endif
#else
    /* Nothing to clear on this HAL variant. */
#endif
}

static void vnd_dc_flash_erase_target(uint32_t *bank, uint32_t *sector)
{
    uint32_t erase_bank = FLASH_BANK_1;
    uint32_t erase_sector;
    uint32_t rel = (uint32_t)VND_DC_FLASH_ADDR - 0x08000000u;
    uint32_t sec_global = rel / 0x20000u;

