kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    if(sec_global >= (uint32_t)FLASH_SECTOR_TOTAL){
        sec_global = (uint32_t)FLASH_SECTOR_TOTAL - 1u;
    }

#if defined(FLASH_BANK_2)
    if(sec_global >= 4u) erase_bank = FLASH_BANK_2;
#endif

#if defined(FLASH_SECTOR_0)
    erase_sector = (uint32_t)FLASH_SECTOR_0 + sec_global;
#else
    erase_sector = sec_global;
#endif

    *bank = erase_bank;
    *sector = erase_sector;
}

static HAL_StatusTypeDef vnd_dc_erase_reserved_sector(uint32_t *sector_error,
                                                       uint32_t *erase_bank,
                                                       uint32_t *erase_sector)
{
    FLASH_EraseInitTypeDef e;
    vnd_dc_flash_erase_target(erase_bank, erase_sector);
    memset(&e, 0, sizeof(e));
    e.TypeErase = FLASH_TYPEERASE_SECTORS;
    e.Banks = *erase_bank;
    e.Sector = *erase_sector;
    e.NbSectors = 1;
    return HAL_FLASHEx_Erase(&e, sector_error);
}

static uint32_t vnd_dc_blob_commit_value(const vnd_dc_blob_t *b)
{
    uint32_t commit = 0u;
    memcpy(&commit, ((const uint8_t*)b) + VND_DC_COMMIT_OFFSET, sizeof(commit));
    return commit;
}

static void vnd_dc_blob_set_commit(vnd_dc_blob_t *b)
{
    const uint32_t commit = VND_DC_COMMIT_MAGIC;
    memcpy(((uint8_t*)b) + VND_DC_COMMIT_OFFSET, &commit, sizeof(commit));
}

static void vnd_dc_boot_recovery_erase_if_requested(void)
{
    static uint8_t checked = 0;
    if(checked) return;
    checked = 1;

    if(vnd_dc_recovery.magic != VND_DC_RECOVERY_MAGIC ||
       vnd_dc_recovery.magic_inv != ~VND_DC_RECOVERY_MAGIC){
        return;
    }

    uint32_t erase_bank = 0;
    uint32_t erase_sector = 0;
    uint32_t sector_error = 0;
    uint32_t err = 0;

    printf("[DC] RECOVERY: erase reserved flash after fault addr=0x%08lX cfsr=0x%08lX count=%lu\r\n",
           (unsigned long)vnd_dc_recovery.fault_addr,
           (unsigned long)vnd_dc_recovery.cfsr,
           (unsigned long)vnd_dc_recovery.count);

    HAL_FLASH_Unlock();
    vnd_dc_flash_clear_error_flags();
    HAL_StatusTypeDef st = vnd_dc_erase_reserved_sector(&sector_error, &erase_bank, &erase_sector);
    HAL_FLASH_Lock();

#if defined(HAL_FLASH_GetError)
    err = HAL_FLASH_GetError();
#endif
    vnd_dc_save_last_bank = erase_bank;
    vnd_dc_save_last_sector = erase_sector;
    vnd_dc_save_last_sector_error = sector_error;
    vnd_dc_save_last_err = err;
    vnd_dc_save_last_ms = HAL_GetTick();

    if(st == HAL_OK){
        vnd_dc_recovery.magic = 0;
        vnd_dc_recovery.magic_inv = 0;
        vnd_dc_flash_next_off = 0;
        vnd_dc_flash_next_off_public = 0;
        vnd_dc_load_flags_public = 0;
        printf("[DC] RECOVERY OK: erased bank=%lu sector=%lu\r\n",
               (unsigned long)erase_bank, (unsigned long)erase_sector);
    } else {
        vnd_dc_save_fail_count++;
        vnd_dc_save_last_result = 2;
        vnd_dc_loaded = 1;
        memset(vnd_dc_buf, 0, sizeof(vnd_dc_buf));
        vnd_dc_dirty = 0;
        vnd_dc_dirty_public = 0;
        vnd_dc_dirty_since_ms = 0;
        vnd_dc_flash_next_off = VND_DC_FLASH_SECTOR_SIZE;
        vnd_dc_flash_next_off_public = vnd_dc_flash_next_off;
        printf("[DC] RECOVERY FAIL: bank=%lu sector=%lu err=0x%08lX sec_err=%lu; DC disabled for this boot\r\n",
               (unsigned long)erase_bank, (unsigned long)erase_sector,
               (unsigned long)err, (unsigned long)sector_error);
    }
}

/* DC compensation is independent of stream_mode and runs on every new raw frame. */

static uint16_t vnd_crc16_ccitt(const uint8_t *data, uint32_t len); /* объявлена ниже в файле */

static uint16_t vnd_rs485_role_meta_crc(const vnd_rs485_role_meta_t *meta)
{
    uint32_t start = (uint32_t)offsetof(vnd_rs485_role_meta_t, version);
    uint32_t end = (uint32_t)offsetof(vnd_rs485_role_meta_t, crc16);
    return vnd_crc16_ccitt(((const uint8_t *)meta) + start, end - start);
}

static uint16_t vnd_rs485_slave_meta_crc(const vnd_rs485_slave_meta_t *meta)
{
    return vnd_crc16_ccitt((const uint8_t *)meta,
                           (uint32_t)offsetof(vnd_rs485_slave_meta_t, crc16));
}

static void vnd_rs485_role_meta_store(vnd_dc_blob_t *blob)
{
    rs485_role_persist_state_t state;
    vnd_rs485_role_meta_t meta;
    vnd_rs485_slave_meta_t slave_meta;

    if(blob == NULL) return;
    memset(&state, 0, sizeof(state));
    memset(&meta, 0, sizeof(meta));
    memset(&slave_meta, 0, sizeof(slave_meta));
    rs485_role_persist_export(&state);

    meta.magic = VND_RS485_ROLE_META_MAGIC;
    meta.version = VND_RS485_ROLE_META_VER;
    meta.flags = state.flags;
    meta.node_id = state.node_id;
    meta.slave_id_high_water = state.slave_id_high_water;
    meta.master_assigned_unix_s = state.master_assigned_unix_s;
    meta.master_assigned_millis = state.master_assigned_millis;
    memcpy(meta.master_uid, state.master_uid, sizeof(meta.master_uid));
    meta.crc16 = vnd_rs485_role_meta_crc(&meta);
    memcpy(blob->_pad, &meta, sizeof(meta));

    if ((state.flags & RS485_ROLE_PERSIST_SLAVE_EPOCH) != 0u) {
        slave_meta.slave_assigned_unix_s = state.slave_assigned_unix_s;
        slave_meta.slave_assigned_millis = state.slave_assigned_millis;
        if ((state.flags & RS485_ROLE_PERSIST_SLAVE_VALID) != 0u) {
            memcpy(slave_meta.slave_uid_prefix,
                   state.slave_uid,
                   sizeof(slave_meta.slave_uid_prefix));
        }
        slave_meta.crc16 = vnd_rs485_slave_meta_crc(&slave_meta);
        memcpy(((uint8_t *)blob) + VND_RS485_SLAVE_META_OFFSET,
               &slave_meta,
               sizeof(slave_meta));
    }
}

static void vnd_rs485_role_meta_restore(const vnd_dc_blob_t *blob)
{
    rs485_role_persist_state_t state;
    vnd_rs485_role_meta_t meta;
    vnd_rs485_slave_meta_t slave_meta;

    if(blob == NULL) return;
    memcpy(&meta, blob->_pad, sizeof(meta));
    if(meta.magic != VND_RS485_ROLE_META_MAGIC ||
       ((meta.version != VND_RS485_ROLE_META_VER_LEGACY) &&
        (meta.version != VND_RS485_ROLE_META_VER)) ||
       meta.crc16 != vnd_rs485_role_meta_crc(&meta)){
        return;
    }

    memset(&state, 0, sizeof(state));
    state.flags = meta.flags;
    state.node_id = meta.node_id;
    state.slave_id_high_water = meta.slave_id_high_water;
    state.master_assigned_unix_s = meta.master_assigned_unix_s;
    state.master_assigned_millis = meta.master_assigned_millis;
    memcpy(state.master_uid, meta.master_uid, sizeof(state.master_uid));
    if (meta.version == VND_RS485_ROLE_META_VER_LEGACY) {
        /* v1 could preserve sparse/provisional ids such as S23 and could also
           leave several boards unassigned. Keep the network-wide MASTER and
           selected sensor-SLAVE, but commission slave ids again exactly once.
           The first successful assignment saves this record as v2. */
        state.flags &= (uint8_t)~RS485_ROLE_PERSIST_NODE_VALID;
        state.node_id = 0u;
        state.slave_id_high_water = 0u;
    }
    if ((state.flags & RS485_ROLE_PERSIST_SLAVE_EPOCH) != 0u) {
        memcpy(&slave_meta,
               ((const uint8_t *)blob) + VND_RS485_SLAVE_META_OFFSET,
               sizeof(slave_meta));
        if ((slave_meta.slave_assigned_unix_s == 0u) ||
            (slave_meta.slave_assigned_millis >= 1000u) ||
            (slave_meta.crc16 != vnd_rs485_slave_meta_crc(&slave_meta))) {
            state.flags &= (uint8_t)~(RS485_ROLE_PERSIST_SLAVE_EPOCH |
                                      RS485_ROLE_PERSIST_SLAVE_VALID |
                                      RS485_ROLE_PERSIST_SLAVE_UID64);
        } else {
            state.slave_assigned_unix_s = slave_meta.slave_assigned_unix_s;
            state.slave_assigned_millis = slave_meta.slave_assigned_millis;
            if ((state.flags & RS485_ROLE_PERSIST_SLAVE_VALID) != 0u) {
                memcpy(state.slave_uid,
                       slave_meta.slave_uid_prefix,
                       sizeof(slave_meta.slave_uid_prefix));
                state.flags |= RS485_ROLE_PERSIST_SLAVE_UID64;
            }
        }
    }
    rs485_role_persist_import(&state);
}

/* === TIM5 sync helpers (32-bit phase counter) === */
__attribute__((unused))
static uint32_t vnd_tim5_get_tim_clk(void)
{
    uint32_t pclk1 = HAL_RCC_GetPCLK1Freq();
    uint32_t ppre1 = (RCC->D2CFGR & RCC_D2CFGR_D2PPRE1) >> RCC_D2CFGR_D2PPRE1_Pos;
    return ((ppre1 & 0x4u) != 0u) ? (pclk1 * 2u) : pclk1;
}

__attribute__((unused))
static void vnd_sync_stop_tim5(void)
{
    (void)HAL_TIM_Base_Stop(&htim5);
}

__attribute__((unused))
static void vnd_sync_start_tim5_base(void)
{
    (void)HAL_TIM_Base_Start(&htim5);
}

static void vnd_sync_set_master(uint16_t buf_rate_hz)
{
    /* TIM5 теперь используется как 32-битный счётчик фазы, не как генератор синхроимпульсов */
    (void)buf_rate_hz;
    vnd_sync_last_hz = buf_rate_hz;
}

