kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static void vnd_sync_set_slave(void)
{
    /* TIM5 как 32-битный счётчик фазы: запускается базовым таймером в main.c */
    vnd_sync_capture_valid = 0;
}

static void vnd_sync_apply_mode(uint8_t mode)
{
    if(mode > VND_SYNC_MODE_OFF) mode = VND_SYNC_MODE_OFF;

    /* A repeated role announcement is state refresh, not a reason to touch
       timers, ADC/DMA or the host-controlled TX200 output. */
    if(mode == vnd_sync_mode_public) {
        vnd_sync_mode = mode;
        return;
    }

    vnd_sync_mode = mode;
    {
        extern volatile uint8_t sync_edge_seen;
        extern volatile uint32_t sync_last_edge_ms;
        extern TIM_HandleTypeDef htim5;
        extern volatile uint8_t sync_align_pending;
        extern volatile uint8_t sync_phase_lock_armed;
        extern volatile uint8_t sync_phase_lock_active;
        extern volatile uint8_t sync_restart_on_edge;
        sync_edge_seen = 0u;
        sync_last_edge_ms = 0u;
        htim5.Instance->CNT = 0u;
        sync_align_pending = 0u;
        sync_phase_lock_armed = 0u;
        sync_phase_lock_active = 0u;
        sync_restart_on_edge = 0u;
    }
    if(mode == VND_SYNC_MODE_MASTER){
        vnd_sync_mode_public = VND_SYNC_MODE_MASTER;
        vnd_sync_set_master(0u);
        vnd_sync_ok_public = 1u;
    } else if(mode == VND_SYNC_MODE_SLAVE){
        vnd_sync_mode_public = VND_SYNC_MODE_SLAVE;
        vnd_sync_set_slave();
        vnd_sync_ok_public = 0u;
        vnd_sync_start_tim5_base();
    } else {
        vnd_sync_mode_public = VND_SYNC_MODE_OFF;
        vnd_sync_ok_public = 0u;
    }
    vnd_sync_pending_hz = 0u;
    vnd_sync_last_capture_ms = 0u;
    vnd_sync_last_apply_ms = 0u;
    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
    /* Role changes must not clear the RPI rate override, restart ADC/DMA,
       reset frame parity, or alter the persistent SET_TX_ENABLE request. */
    cdc_logf("EVT SYNC_MODE APPLY mode=%u continuous_adc=1 tx_unchanged=1",
             (unsigned)mode);
}

static void vnd_sync_apply_host_forced_mode(uint8_t mode)
{
    if(mode > VND_SYNC_MODE_OFF) mode = VND_SYNC_MODE_OFF;

    vnd_sync_mode_host_forced = 1u;
    vnd_sync_apply_mode(mode);
}

/* Принудительная установка режима (не блокируется флагом host_forced) */
void vnd_sync_apply_mode_forced(uint8_t mode)
{
    if(mode == VND_SYNC_MODE_MASTER) {
        /* Network MASTER may only be appointed by the timestamped host
           command handled by rs485_role_assign_master_from_host(). */
        return;
    }
    vnd_sync_apply_host_forced_mode(mode);
}

/* A newer network-wide host assignment must be able to demote an older local
   host-forced MASTER. */
void vnd_sync_apply_network_mode(uint8_t mode)
{
    vnd_sync_mode_host_forced = 0u;
    vnd_sync_apply_mode(mode);
}

/* Снятие принудительного режима, возврат к автоматическому */
void vnd_sync_release_host_forced(void)
{
    uint8_t persisted_mode = VND_SYNC_MODE_SLAVE;

    vnd_sync_mode_host_forced = 0u;
    if(rs485_role_get_local_persisted_mode(&persisted_mode) == 0u) {
        persisted_mode = VND_SYNC_MODE_SLAVE;
    }
    vnd_sync_apply_mode(persisted_mode);
}

uint8_t vnd_sync_is_mode_host_forced(void)
{
    return vnd_sync_mode_host_forced;
}

static int16_t *vnd_dc_bank(uint8_t ch, uint8_t parity)
{
    if(ch > 1u || parity > 1u) return NULL;
    return vnd_dc_buf[ch][parity];
}

__attribute__((unused))
static uint16_t vnd_dc_bank_crc16(uint8_t ch, uint8_t parity)
{
    if(ch > 1u || parity > 1u) return 0;
    return vnd_crc16_ccitt((const uint8_t*)vnd_dc_buf[ch][parity], (uint32_t)sizeof(vnd_dc_buf[ch][parity]));
}

static uint32_t vnd_dc_score_bank(const uint16_t *raw, uint16_t raw_ns, uint16_t roi_start, uint16_t roi_len, uint8_t ch, uint8_t parity)
{
    if(!raw) return 0xFFFFFFFFu;
    if(ch > 1u || parity > 1u) return 0xFFFFFFFFu;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return 0xFFFFFFFFu;
    if(raw_ns < (uint16_t)(roi_start + roi_len)) return 0xFFFFFFFFu;
    int16_t *bank = vnd_dc_bank(ch, parity);
    if(bank == NULL) return 0xFFFFFFFFu;

    /* Скоринг: весь ROI (200 точек). Это выполняется редко (один раз после reboot),
       поэтому лучше быть надёжным, чем быстрым. */
    uint32_t acc = 0;
    for(uint16_t i = 0; i < roi_len; i++){
        uint16_t v = raw[roi_start + i];
        int16_t dc = bank[i];
        int32_t y = (int32_t)v + (int32_t)dc;
        int32_t e = y - (int32_t)VND_DC_TARGET_ZERO;
        if(e < 0) e = -e;
        acc += (uint32_t)e;
    }
    return acc;
}

/* Resolve the physical even/odd phase against the two persistent banks from
   the first complete pair after boot or ADC restart. This helper must be used
   by every 200-sample path: AVG streaming intentionally skips the background
   maintenance pass, so relying on that pass would leave a stale/default map. */
static void vnd_dc_ensure_parity_mapping(const uint16_t *raw_a,
                                         const uint16_t *raw_b,
                                         uint16_t raw_ns,
                                         uint16_t roi_start,
                                         uint16_t roi_len,
                                         uint8_t raw_parity)
{
    if(vnd_dc_parity_swap_valid) return;
    if(raw_a == NULL || raw_b == NULL) return;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return;
    if(raw_ns < (uint16_t)(roi_start + roi_len)) return;

    raw_parity &= 1u;
    uint32_t score_direct = 0u;
    uint32_t score_swapped = 0u;
    score_direct += vnd_dc_score_bank(raw_a, raw_ns, roi_start, roi_len, 0u, raw_parity);
    score_direct += vnd_dc_score_bank(raw_b, raw_ns, roi_start, roi_len, 1u, raw_parity);
    score_swapped += vnd_dc_score_bank(raw_a, raw_ns, roi_start, roi_len, 0u, (uint8_t)(raw_parity ^ 1u));
    score_swapped += vnd_dc_score_bank(raw_b, raw_ns, roi_start, roi_len, 1u, (uint8_t)(raw_parity ^ 1u));

    vnd_dc_parity_swap = (score_swapped < score_direct) ? 1u : 0u;
    vnd_dc_parity_swap_valid = 1u;
    VND_DC_LOGF("[DC] PARITY_REMAP=%u raw_p=%u direct=%lu swapped=%lu\r\n",
                (unsigned)vnd_dc_parity_swap,
                (unsigned)raw_parity,
                (unsigned long)score_direct,
                (unsigned long)score_swapped);
}

static inline void vnd_invalidate_dcache_range(uint32_t addr, uint32_t len)
{
#if (VND_ENABLE_CACHE_INVALIDATE && (__DCACHE_PRESENT == 1U))
    if(len == 0u) return;
    uint32_t a0 = addr & ~31u;
    uint32_t a1 = (addr + len + 31u) & ~31u;
    uint32_t alen = a1 - a0;
    SCB_InvalidateDCache_by_Addr((uint32_t*)a0, (int32_t)alen);
#else
    (void)addr; (void)len;
#endif
}

