kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
/* Background DC maintenance (always-on, independent of stream_mode).
   Uses every new raw ADC latest FIFO frame (peek) and the one RPI-set speed.
   IMPORTANT: uses peek API so it does NOT consume FIFO frames used for USB streaming. */
static void vnd_dc_background_step(uint16_t roi_start, uint16_t roi_len)
{
    /* Обязательно загрузить DC из Flash как можно раньше после reboot,
       даже если окно пока не выставлено в 200. */
    vnd_dc_load_once();
    /* DC owns one fixed 200-sample region. The current USB window length is not
       a permission flag and must never stop adaptation. */
    (void)roi_len;
    roi_len = (uint16_t)VND_DC_ROI_LEN;

     /* Обновляемся на каждом новом FIFO-кадре; скорость обучения задаёт host через settle_ms. */
    static uint32_t last_seq = 0xFFFFFFFFu;

    uint16_t *a_ptr = NULL, *b_ptr = NULL; uint16_t ns = 0; uint32_t dma_seq = 0;
    if(!adc_peek_latest_frame_pair_fifo(&a_ptr, &b_ptr, &ns, &dma_seq)){
        return;
    }
    if(dma_seq == last_seq) return;
    last_seq = dma_seq;
    if(!a_ptr || !b_ptr) return;
    if(ns < roi_len) return;
    if(((uint32_t)roi_start + (uint32_t)roi_len) > (uint32_t)ns){
        uint16_t default_start = (uint16_t)VND_ROI_BASE_START_200HZ;
        roi_start = (((uint32_t)default_start + (uint32_t)roi_len) <= (uint32_t)ns)
                  ? default_start
                  : (uint16_t)(ns - roi_len);
    }

    uint32_t now_ms = HAL_GetTick();

    uint8_t parity = (uint8_t)(adc_get_buffer_parity(dma_seq) & 1u);

    /* Use local copy of ROI so we don't mutate ADC buffers. */
    static uint16_t tmp_a[VND_DC_ROI_LEN];
    static uint16_t tmp_b[VND_DC_ROI_LEN];
    memcpy(tmp_a, a_ptr + roi_start, (size_t)roi_len * sizeof(uint16_t));
    memcpy(tmp_b, b_ptr + roi_start, (size_t)roi_len * sizeof(uint16_t));

    /* Диагностика согласования с GUI: раз в секунду печатаем min/max/mean по ROI
       до и после применения DC (для тех же данных). */
    static uint32_t last_stats_ms = 0;
    uint8_t do_stats = 0u;
    if(last_stats_ms == 0u || (now_ms - last_stats_ms) >= 1000u){
        last_stats_ms = now_ms;
        do_stats = 1u;
    }
    uint16_t raw_mn_a = 0xFFFFu, raw_mx_a = 0u;
    uint16_t raw_mn_b = 0xFFFFu, raw_mx_b = 0u;
    __attribute__((unused)) int32_t raw_mean_a = 0;
    __attribute__((unused)) int32_t raw_mean_b = 0;
    if(do_stats){
        int64_t sum_a = 0;
        int64_t sum_b = 0;
        for(uint16_t i = 0; i < roi_len; i++){
            uint16_t va = tmp_a[i];
            uint16_t vb = tmp_b[i];
            if(va < raw_mn_a) raw_mn_a = va;
            if(va > raw_mx_a) raw_mx_a = va;
            if(vb < raw_mn_b) raw_mn_b = vb;
            if(vb > raw_mx_b) raw_mx_b = vb;
            sum_a += (int32_t)va;
            sum_b += (int32_t)vb;
        }
        raw_mean_a = (int32_t)(sum_a / (int32_t)roi_len);
        raw_mean_b = (int32_t)(sum_b / (int32_t)roi_len);
    }

    /* Ensure persisted DC is loaded before first adapt. */
    vnd_dc_load_once();

    vnd_dc_ensure_parity_mapping(a_ptr, b_ptr, ns, roi_start, roi_len, parity);

    /* Один раз после загрузки определяем, не инвертирован ли parity. */
    if(!vnd_dc_parity_swap_valid){
        uint32_t s0 = 0, s1 = 0;
        /* swap=0: используем parity как есть */
        s0 += vnd_dc_score_bank(a_ptr, ns, roi_start, roi_len, 0u, parity);
        s0 += vnd_dc_score_bank(b_ptr, ns, roi_start, roi_len, 1u, parity);
        /* swap=1: используем инвертированный parity */
        s1 += vnd_dc_score_bank(a_ptr, ns, roi_start, roi_len, 0u, (uint8_t)(parity ^ 1u));
        s1 += vnd_dc_score_bank(b_ptr, ns, roi_start, roi_len, 1u, (uint8_t)(parity ^ 1u));

        if(s1 < s0){
            vnd_dc_parity_swap = 1u;
        } else {
            vnd_dc_parity_swap = 0u;
        }
        vnd_dc_parity_swap_valid = 1u;
        VND_DC_LOGF("[DC] PARITY_SWAP=%u (raw_parity=%u s0=%lu s1=%lu)\r\n",
               (unsigned)vnd_dc_parity_swap, (unsigned)parity,
               (unsigned long)s0, (unsigned long)s1);

        /* Одноразовая проверка, что применяемый банк действительно центрирует ROI. */
        {
            uint8_t p_use = (uint8_t)(parity ^ vnd_dc_parity_swap);
            uint8_t p_alt = (uint8_t)(p_use ^ 1u);
            int16_t *bank_a = vnd_dc_bank(0u, p_use);
            int16_t *bank_b = vnd_dc_bank(1u, p_use);
            int16_t *bank2_a = vnd_dc_bank(0u, p_alt);
            int16_t *bank2_b = vnd_dc_bank(1u, p_alt);

            int64_t raw_sum_a = 0, raw_sum_b = 0;
            for(uint16_t i = 0; i < roi_len; i++){
                raw_sum_a += (int32_t)a_ptr[roi_start + i];
                raw_sum_b += (int32_t)b_ptr[roi_start + i];
            }
            __attribute__((unused)) int32_t raw_mean_a = (int32_t)(raw_sum_a / (int32_t)roi_len);
            __attribute__((unused)) int32_t raw_mean_b = (int32_t)(raw_sum_b / (int32_t)roi_len);

            /* check for chosen bank */
            int64_t sum_a = 0, sum_b = 0;
            uint32_t err_a = 0, err_b = 0;
            for(uint16_t i = 0; i < roi_len; i++){
                int32_t ya = (int32_t)a_ptr[roi_start + i] + (int32_t)(bank_a ? bank_a[i] : 0);
                int32_t yb = (int32_t)b_ptr[roi_start + i] + (int32_t)(bank_b ? bank_b[i] : 0);
                sum_a += ya;
                sum_b += yb;
                int32_t ea = ya - (int32_t)VND_DC_TARGET_ZERO; if(ea < 0) ea = -ea;
                int32_t eb = yb - (int32_t)VND_DC_TARGET_ZERO; if(eb < 0) eb = -eb;
                err_a += (uint32_t)ea;
                err_b += (uint32_t)eb;
            }
            __attribute__((unused)) int32_t mean_a = (int32_t)(sum_a / (int32_t)roi_len);
            __attribute__((unused)) int32_t mean_b = (int32_t)(sum_b / (int32_t)roi_len);

            /* check for alternative bank (flip parity bank) */
            int64_t sum2_a = 0, sum2_b = 0;
            uint32_t err2_a = 0, err2_b = 0;
            for(uint16_t i = 0; i < roi_len; i++){
                int32_t ya = (int32_t)a_ptr[roi_start + i] + (int32_t)(bank2_a ? bank2_a[i] : 0);
                int32_t yb = (int32_t)b_ptr[roi_start + i] + (int32_t)(bank2_b ? bank2_b[i] : 0);
                sum2_a += ya;
                sum2_b += yb;
                int32_t ea = ya - (int32_t)VND_DC_TARGET_ZERO; if(ea < 0) ea = -ea;
                int32_t eb = yb - (int32_t)VND_DC_TARGET_ZERO; if(eb < 0) eb = -eb;
                err2_a += (uint32_t)ea;
                err2_b += (uint32_t)eb;
            }
            __attribute__((unused)) int32_t mean2_a = (int32_t)(sum2_a / (int32_t)roi_len);
            __attribute__((unused)) int32_t mean2_b = (int32_t)(sum2_b / (int32_t)roi_len);

                 VND_DC_LOGF("[DC] APPLY_CHECK: roi=%u+%u raw_meanA=%ld raw_meanB=%ld p=%u meanA=%ld meanB=%ld errA=%lu errB=%lu alt_p=%u alt_meanA=%ld alt_meanB=%ld alt_errA=%lu alt_errB=%lu\r\n",
                   (unsigned)roi_start, (unsigned)roi_len,
                   (long)raw_mean_a, (long)raw_mean_b,
                   (unsigned)p_use,
                   (long)mean_a, (long)mean_b,
                   (unsigned long)err_a, (unsigned long)err_b,
                   (unsigned)p_alt,
                   (long)mean2_a, (long)mean2_b,
                   (unsigned long)err2_a, (unsigned long)err2_b);
        }
    }

