kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    vnd_dc_apply_and_adapt(0, parity, tmp_a, roi_len);
    vnd_dc_apply_and_adapt(1, parity, tmp_b, roi_len);

    if(do_stats && vnd_dc_parity_swap_valid){
        __attribute__((unused)) uint8_t p_use = (uint8_t)(parity ^ vnd_dc_parity_swap);

        uint16_t mn_a = 0xFFFFu, mx_a = 0u;
        uint16_t mn_b = 0xFFFFu, mx_b = 0u;
        int64_t sum_a = 0;
        int64_t sum_b = 0;
        for(uint16_t i = 0; i < roi_len; i++){
            uint16_t va = tmp_a[i];
            uint16_t vb = tmp_b[i];
            if(va < mn_a) mn_a = va;
            if(va > mx_a) mx_a = va;
            if(vb < mn_b) mn_b = vb;
            if(vb > mx_b) mx_b = vb;
            sum_a += (int32_t)va;
            sum_b += (int32_t)vb;
        }
        __attribute__((unused)) int32_t mean_a = (int32_t)(sum_a / (int32_t)roi_len);
        __attribute__((unused)) int32_t mean_b = (int32_t)(sum_b / (int32_t)roi_len);

        VND_DC_LOGF("[DC] ROI_STATS: roi=%u+%u raw_p=%u swap=%u p=%u "
               "A_raw(mn=%u mx=%u mean=%ld) A_dc(mn=%u mx=%u mean=%ld) "
               "B_raw(mn=%u mx=%u mean=%ld) B_dc(mn=%u mx=%u mean=%ld)\r\n",
               (unsigned)roi_start, (unsigned)roi_len,
               (unsigned)parity, (unsigned)vnd_dc_parity_swap, (unsigned)p_use,
               (unsigned)raw_mn_a, (unsigned)raw_mx_a, (long)raw_mean_a,
               (unsigned)mn_a, (unsigned)mx_a, (long)mean_a,
               (unsigned)raw_mn_b, (unsigned)raw_mx_b, (long)raw_mean_b,
               (unsigned)mn_b, (unsigned)mx_b, (long)mean_b);
    }
}

static void vnd_dc_apply_only(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len)
{
    if(!out) return;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return;
    if(ch > 1u || parity > 1u) return;

    uint8_t p = (uint8_t)(parity ^ (vnd_dc_parity_swap_valid ? vnd_dc_parity_swap : 0u));
    int16_t *bank = vnd_dc_bank(ch, p);
    if(bank == NULL) return;
    for(uint16_t i=0;i<roi_len;i++){
        int16_t dc = bank[i];
        int32_t y = (int32_t)out[i] + (int32_t)dc;
        if(y < 0){
            y = 0;
        } else if(y > 65535){
            y = 65535;
        }
        out[i] = (uint16_t)y;
    }
}

static void vnd_dc_apply_and_adapt(uint8_t ch, uint8_t parity, uint16_t *out, uint16_t roi_len)
{
    if(!out) return;
    if(roi_len != (uint16_t)VND_DC_ROI_LEN) return;
    if(ch > 1u || parity > 1u) return;

     uint8_t p = (uint8_t)(parity ^ (vnd_dc_parity_swap_valid ? vnd_dc_parity_swap : 0u));
    int16_t *bank = vnd_dc_bank(ch, p);
    if(bank == NULL) return;

    /* Apply the one persistent table even when RPI has set speed to zero. */
    for(uint16_t i=0;i<roi_len;i++){
        int16_t dc = bank[i];
        uint16_t v = out[i];
        int32_t y = (int32_t)v + (int32_t)dc;
        if(y < 0) y = 0;
        else if(y > 65535) y = 65535;
        out[i] = (uint16_t)y;
    }

    uint32_t now_ms = HAL_GetTick();
    uint32_t settle_ms = vnd_dc_speed_settle_ms;
    vnd_dc_adapt_call_count++;
    vnd_dc_adapt_last_ms = now_ms;
    vnd_dc_adapt_last_dt_ms = 0u;
    vnd_dc_adapt_max_corr = 0u;

     /* 2) Adaptive proportional DC for every sample of the 200-sample ROI.
         corr[i] is proportional to that sample's current distance from the
         deadband and to elapsed wall time. Large errors move quickly; the step
         decreases smoothly near zero. Q16 residue is independent per sample.
         Модель: out = raw + dc[i]; если out[i] выше 32768 -> dc[i] делаем более отрицательным. */
    int64_t sum = 0;
    uint32_t max_abs_err = 0u;
    for(uint16_t i=0;i<roi_len;i++){
        int32_t e_i = (int32_t)out[i] - (int32_t)VND_DC_TARGET_ZERO;
        uint32_t abs_i = (e_i < 0) ? (uint32_t)(-e_i) : (uint32_t)e_i;
        if(abs_i > max_abs_err){
            max_abs_err = abs_i;
        }
        sum += (int32_t)out[i];
    }
    int32_t mean = (int32_t)(sum / (int32_t)roi_len);
    __attribute__((unused)) int32_t err = mean - (int32_t)VND_DC_TARGET_ZERO;
    vnd_dc_adapt_max_abs_err = max_abs_err;
    vnd_dc_adapt_mean_err = err;

    if(settle_ms == 0u){
        vnd_dc_last_adapt_ms[ch][p] = now_ms;
        memset(vnd_dc_adapt_frac_q16[ch][p], 0,
               sizeof(vnd_dc_adapt_frac_q16[ch][p]));
        return;
    }

    int32_t dead = (int32_t)VND_DC_DEADBAND;
    if(dead < 0) dead = 0;
    if(max_abs_err <= (uint32_t)dead){
        vnd_dc_last_adapt_ms[ch][p] = now_ms;
        memset(vnd_dc_adapt_frac_q16[ch][p], 0,
               sizeof(vnd_dc_adapt_frac_q16[ch][p]));
        return;
    }

    uint8_t changed = 0;
    uint32_t last_ms = vnd_dc_last_adapt_ms[ch][p];
    uint32_t dt_ms;
    if(last_ms != 0u){
        dt_ms = (uint32_t)(now_ms - last_ms);
    } else if(vnd_dc_speed_set_at_ms != 0u){
        dt_ms = (uint32_t)(now_ms - vnd_dc_speed_set_at_ms);
    } else {
        dt_ms = 20u;
    }
    vnd_dc_last_adapt_ms[ch][p] = now_ms;
    if(dt_ms == 0u){
        return;
    }
    /* Preserve wall-clock progress across short ADC/USB interruptions, while
       never applying more than one complete settling interval at once. */
    if(dt_ms > settle_ms){
        dt_ms = settle_ms;
    }
    vnd_dc_adapt_last_dt_ms = dt_ms;
    uint32_t max_corr_applied = 0u;

    /* Every point gets its own magnitude as well as its own sign. */
    {
        for(uint16_t i=0;i<roi_len;i++){
            int32_t e = (int32_t)out[i] - (int32_t)VND_DC_TARGET_ZERO;
            uint32_t abs_e = (e < 0) ? (uint32_t)(-e) : (uint32_t)e;
            if(abs_e <= (uint32_t)dead){
                vnd_dc_adapt_frac_q16[ch][p][i] = 0u;
                continue;
            }

            int32_t dc_i32 = (int32_t)bank[i];
            uint32_t remaining = abs_e - (uint32_t)dead;
            uint64_t add_q16 =
                ((uint64_t)abs_e * (uint64_t)dt_ms *
                 (uint64_t)VND_DC_ADAPTIVE_GAIN * 65536ULL) /
                (uint64_t)settle_ms;
            uint64_t budget_q16 =
                (uint64_t)vnd_dc_adapt_frac_q16[ch][p][i] + add_q16;
            uint64_t limit_q16 = (uint64_t)remaining << 16;
            if(budget_q16 > limit_q16){
                budget_q16 = limit_q16;
            }
            uint32_t corr = (uint32_t)(budget_q16 >> 16);
            vnd_dc_adapt_frac_q16[ch][p][i] =
                (uint32_t)(budget_q16 - ((uint64_t)corr << 16));
            if(corr == 0u) continue;
            if(corr > max_corr_applied) max_corr_applied = corr;

            if(e > 0){
                dc_i32 -= (int32_t)corr;
            } else {
                dc_i32 += (int32_t)corr;
            }
            if(dc_i32 < -32768){
                dc_i32 = -32768;
            }
            if(dc_i32 > 32767){
                dc_i32 = 32767;
            }

            int16_t nv = (int16_t)dc_i32;
            if(nv != bank[i]){
                bank[i] = nv;
                changed = 1;
            }
        }
    }
    vnd_dc_adapt_max_corr = max_corr_applied;

    if(changed){
        if(!vnd_dc_dirty){
            uint32_t now_ms = HAL_GetTick();
            vnd_dc_dirty_since_ms = now_ms;
        }
        /* ограничим частоту DIRTY лога */
        {
            uint32_t now_ms = HAL_GetTick();
            if(vnd_dc_last_dirty_log_ms == 0u || (now_ms - vnd_dc_last_dirty_log_ms) > 1000u){
                vnd_dc_last_dirty_log_ms = now_ms;
                   VND_DC_LOGF("[DC] DIRTY: ch=%u p=%u settle=%lums dt=%lums maxcorr=%lu maxerr=%lu mean=%ld err=%ld\r\n",
                       (unsigned)ch, (unsigned)p,
                       (unsigned long)settle_ms,
                       (unsigned long)dt_ms,
                       (unsigned long)max_corr_applied,
                       (unsigned long)max_abs_err,
                       (long)mean, (long)err);
            }
        }
        vnd_dc_adapt_updates++;
        vnd_dc_dirty = 1;
        vnd_dc_dirty_public = 1;
    }
}

static void vnd_dc_load_once(void)
{
    vnd_dc_boot_recovery_erase_if_requested();
    if(vnd_dc_loaded) return;
    vnd_dc_loaded = 1;

    /* Scan journal once after reset: find last valid record + compute next write offset.
       If tail is corrupted (non-empty but invalid), mark sector as "needs erase" for next save. */
    const uint8_t *base = (const uint8_t *)(uintptr_t)VND_DC_FLASH_ADDR;
    const vnd_dc_blob_t *best = NULL;
    uint32_t best_cnt = 0;
    uint32_t next_off = 0;
    uint8_t need_erase = 0;

    for(uint32_t off = 0; (off + (uint32_t)sizeof(vnd_dc_blob_t)) <= VND_DC_FLASH_SECTOR_SIZE; off += VND_DC_SLOT_SIZE){
        const vnd_dc_blob_t *b = (const vnd_dc_blob_t *)(const void *)(base + off);
        if(b->magic == 0xFFFFFFFFu){
            next_off = off;
            break;
        }
        if(b->magic != VND_DC_MAGIC || b->ver != (uint16_t)VND_DC_VER || b->roi_len != (uint16_t)VND_DC_ROI_LEN){
            next_off = off;
            need_erase = 1;
            break;
        }
        if(vnd_dc_blob_commit_value(b) != VND_DC_COMMIT_MAGIC){
            next_off = off;
            need_erase = 1;
            break;
        }
        uint32_t data_off = (uint32_t)offsetof(vnd_dc_blob_t, dc);
        uint32_t data_len = (uint32_t)offsetof(vnd_dc_blob_t, _pad) - data_off;
        uint16_t crc = vnd_crc16_ccitt(((const uint8_t*)b) + data_off, data_len);
        if(crc != b->crc16){
            next_off = off;
            need_erase = 1;
            break;
        }
        if(best == NULL || b->write_counter >= best_cnt){
            best = b;
            best_cnt = b->write_counter;
        }
        next_off = off + VND_DC_SLOT_SIZE;
    }

    if(next_off > (VND_DC_FLASH_SECTOR_SIZE - VND_DC_SLOT_SIZE)){
        /* Full sector */
        need_erase = 1;
    }
    vnd_dc_flash_next_off = need_erase ? VND_DC_FLASH_SECTOR_SIZE : next_off;
    vnd_dc_flash_next_off_public = vnd_dc_flash_next_off;

