kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    for(uint8_t iter = 0; iter < drain_limit; ++iter)
    {
        uint16_t *a_ptr = NULL, *b_ptr = NULL; uint16_t ns = 0; uint32_t dma_seq = 0;
        if(!adc_peek_frame_pair_fifo(&a_ptr, &b_ptr, &ns, &dma_seq)){
            break; /* нет новых кадров */
        }
        if(ns < (uint16_t)(roi_start + roi_len)){
            (void)adc_consume_frame_pair_fifo(dma_seq);
            continue; /* кадр не подходит под окно */
        }
        dbg_avg_in_frames++;

        uint8_t parity = (uint8_t)(adc_get_buffer_parity(dma_seq) & 1u);
        if(vnd_avg_cnt[parity] == 0){
            for(uint16_t i=0;i<roi_len;i++){
                vnd_avg_sum[parity][0][i] = 0;
                vnd_avg_sum[parity][1][i] = 0;
            }
        }
        uint16_t *a_roi = a_ptr + roi_start;
        uint16_t *b_roi = b_ptr + roi_start;
        const uint16_t *a_sum_src = a_roi;
        const uint16_t *b_sum_src = b_roi;

        /* В AVG_ROI DC применяется до усреднения: берём raw ROI в локальную копию,
           применяем единственный процесс DC/адаптации и уже скорректированные точки добавляем в сумму.
           Raw DMA/FIFO буферы остаются неизменными. */
        if(roi_len == (uint16_t)VND_DC_ROI_LEN){
            static uint16_t avg_dc_tmp_a[VND_DC_ROI_LEN];
            static uint16_t avg_dc_tmp_b[VND_DC_ROI_LEN];

            vnd_dc_load_once();
            vnd_dc_ensure_parity_mapping(a_roi, b_roi, roi_len, 0u, roi_len, parity);
            memcpy(avg_dc_tmp_a, a_roi, (size_t)roi_len * sizeof(uint16_t));
            memcpy(avg_dc_tmp_b, b_roi, (size_t)roi_len * sizeof(uint16_t));
            vnd_dc_apply_and_adapt(0, parity, avg_dc_tmp_a, roi_len);
            vnd_dc_apply_and_adapt(1, parity, avg_dc_tmp_b, roi_len);
            a_sum_src = avg_dc_tmp_a;
            b_sum_src = avg_dc_tmp_b;
        }

        for(uint16_t i=0;i<roi_len;i++){
            vnd_avg_sum[parity][0][i] += (uint32_t)a_sum_src[i];
            vnd_avg_sum[parity][1][i] += (uint32_t)b_sum_src[i];
        }
        vnd_avg_cnt[parity]++;
        vnd_avg_last_dma_seq[parity] = dma_seq;
        vnd_avg_last_ts_ms[parity] = HAL_GetTick();
        (void)adc_consume_frame_pair_fifo(dma_seq);

        /* Группа готова: выпускаем усреднённый кадр РОВНО после получения avg_n кадров этой parity.
           Важно: не используем vnd_avg_next_parity для условия выпуска, иначе при «прогреве»
           оба счётчика могут стать >= avg_n и кадры начнут выпускаться почти с входной частотой.
           Каждый входной кадр должен попасть ровно в одну группу (по своей parity). */
        if(vnd_avg_cnt[parity] >= avg_n)
        {
#if VND_AVG_LATEST_WINS
            if(vnd_avg_q_count != 0u){
                dbg_avg_drop_frames += (uint32_t)vnd_avg_q_count;
                vnd_avg_q_head = vnd_avg_q_tail;
                vnd_avg_q_count = 0u;
            }
#else
            if(vnd_avg_q_count >= VND_AVG_OUT_Q){
                vnd_avg_q_head = (uint8_t)((vnd_avg_q_head + 1u) % VND_AVG_OUT_Q);
                vnd_avg_q_count--;
                dbg_avg_drop_frames++;
            }
#endif

            uint8_t out_parity = parity;
            uint8_t q = vnd_avg_q_tail;
            for(uint16_t i=0;i<roi_len;i++){
                vnd_avg_q_out[q][0][i] = (uint16_t)((vnd_avg_sum[out_parity][0][i] + (uint32_t)(avg_n/2u)) / (uint32_t)avg_n);
                vnd_avg_q_out[q][1][i] = (uint16_t)((vnd_avg_sum[out_parity][1][i] + (uint32_t)(avg_n/2u)) / (uint32_t)avg_n);
            }

            /* DSP (корреляции/профилирование) — на готовом усреднённом DC-corrected ROI */
            vnd_dwt_init_once();
            uint32_t c0 = vnd_dwt_cycles();
            vnd_dsp_update(out_parity, vnd_avg_q_out[q][0], vnd_avg_q_out[q][1], roi_len);
            uint32_t c1 = vnd_dwt_cycles();
            uint32_t dus = vnd_cycles_to_us(c1 - c0);
            vnd_dsp.dsp_us_total += dus;
            vnd_dsp.dsp_us_cnt++;
            if(dus > vnd_dsp.dsp_us_max) vnd_dsp.dsp_us_max = dus;

            vnd_avg_q_dma_seq[q] = vnd_avg_last_dma_seq[out_parity];
            vnd_avg_q_ts_ms[q] = vnd_avg_last_ts_ms[out_parity];
                /* ВАЖНО: parity/индекс для GUI должны быть стабильны.
                    Нельзя вычислять parity позже по dma_seq, потому что s_buffer_parity[] — кольцевой буфер.
                    Поэтому сохраняем метку 0..7 прямо в очереди. */
                vnd_avg_q_bufidx[q] = (uint8_t)((vnd_avg_gui_ctr & 0x06u) | (out_parity & 1u));
                if((out_parity & 1u) != 0u){
                    vnd_avg_gui_ctr = (uint8_t)((vnd_avg_gui_ctr + 2u) & 0x06u);
                }

            vnd_avg_q_tail = (uint8_t)((vnd_avg_q_tail + 1u) % VND_AVG_OUT_Q);
            vnd_avg_q_count++;

            dbg_avg_out_frames++;

            vnd_avg_cnt[out_parity] = 0;
        }
    }
}



/* === FPS измерение === */
static uint32_t fps_pair_count = 0;       /* Кол-во завершённых пар с момента старта измерения */
static uint32_t fps_frame_a_count = 0;    /* Кол-во отправленных A-кадров */
static uint32_t fps_frame_b_count = 0;    /* Кол-во отправленных B-кадров */
static uint32_t fps_prepare_count = 0;    /* Кол-во вызовов vnd_prepare_pair */
static uint32_t fps_measurement_start_ms = 0; /* Время начала измерения */
static uint32_t fps_last_report_ms = 0;   /* Время последнего отчёта */

/* === Профилирование производительности === */
typedef struct {
    uint32_t prepare_total_us;    /* Суммарное время подготовки пар (мкс) */
    uint32_t prepare_count;       /* Кол-во вызовов prepare */
    uint32_t transmit_total_us;   /* Суммарное время transmit (мкс) */
    uint32_t transmit_count;      /* Кол-во вызовов transmit */
    uint32_t txcplt_total_us;     /* Суммарное время TxCplt (мкс) */
    uint32_t txcplt_count;        /* Кол-во вызовов TxCplt */
    uint32_t last_pair_complete_ms; /* Время последнего завершения пары */
    uint32_t min_pair_interval_ms;  /* Минимальный интервал между парами */
    uint32_t max_pair_interval_ms;  /* Максимальный интервал между парами */
} perf_stats_t;

