kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    if(vnd_sync_mode_public != VND_SYNC_MODE_SLAVE){
        return;
    }

    if(!adc_sync_dbg_updated){
        return;
    }
    adc_sync_dbg_updated = 0u;

    uint16_t idx = adc_sync_dbg_last_idx;
    uint16_t n = adc_sync_dbg_last_samples;
    uint32_t buf = adc_sync_dbg_last_buf;
    uint32_t age = now_ms - adc_sync_dbg_last_ms;

    uint16_t delta = 0;
    if(prev_valid && n > 0u){
        uint16_t d = (idx >= prev_idx) ? (uint16_t)(idx - prev_idx) : (uint16_t)(prev_idx - idx);
        if(d > (n / 2u)) d = (uint16_t)(n - d);
        delta = d;
    }
    prev_idx = idx;
    prev_valid = 1u;

    cdc_logf("SYNC_DBG t=%lums buf=%lu idx=%u/%u d=%u age=%lums",
             (unsigned long)now_ms,
             (unsigned long)buf,
             (unsigned)idx,
             (unsigned)n,
             (unsigned)delta,
             (unsigned long)age);
#if VND_SYNC_DIAG_PRINTF
    printf("[SYNC_DBG] t=%lums buf=%lu idx=%u/%u d=%u age=%lums\r\n",
           (unsigned long)now_ms,
           (unsigned long)buf,
           (unsigned)idx,
           (unsigned)n,
           (unsigned)delta,
           (unsigned long)age);
#endif
}

static void vnd_cdc_periodic_stats(uint32_t now_ms)
{
    /* В диагностическом режиме не трогаем CDC вовсе — уменьшаем накладные расходы */
    if(diag_mode_active){ return; }
    vnd_cdc_sync_diag(now_ms);
    if(now_ms - cdc_stats_last_ms < 1000) return; /* не чаще 1 Гц */
    cdc_stats_last_ms = now_ms;
    uint64_t cur = vnd_total_tx_bytes;
    uint64_t d   = (cur >= cdc_stats_prev_bytes) ? (cur - cdc_stats_prev_bytes) : 0ULL;
    cdc_stats_prev_bytes = cur;
    uint32_t bps = (uint32_t)d; /* за ~1 секунду */
    /* Добавляем количество переданных кадров A/B для сравнения с host RX */
    /* Новая расширенная строка: выводим попытки/отказы TX и частичные abort'ы для анализа стабильности */
    extern volatile uint32_t dbg_tx_attempt; /* объявлены выше */
    extern volatile uint32_t dbg_tx_reject;
    extern volatile uint32_t dbg_partial_frame_abort;
    extern volatile uint32_t dbg_size_mismatch;
    uint32_t tx_attempt = dbg_tx_attempt;
    uint32_t tx_reject  = dbg_tx_reject;
    uint32_t tx_ok      = dbg_tx_cplt; /* число завершённых передач (может включать STAT/TEST) */
    uint32_t frame_abort = dbg_partial_frame_abort;
    uint32_t size_mism   = dbg_size_mismatch;
    uint16_t diag_samples_cur = cur_samples_per_frame;
    uint16_t buf_rate = adc_stream_get_buf_rate();
    uint8_t channel_count = (vnd_ch_mode == 2u) ? 2u : 1u;
    uint16_t frame_bytes = 0u;
    uint32_t demand_bps = 0u;
    /* Оценка потока в Мбит/с (грубая: только пользовательские байты за 1с *8/1e6) */
    float mbps = (float)(bps * 8ULL) / 1000000.0f;

    if (diag_samples_cur == 0u) {
        if ((vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI) || (vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)) {
            diag_samples_cur = (win_len0 != 0u) ? win_len0 : (uint16_t)VND_ROI_LEN_DEFAULT;
        } else if (vnd_frame_samples_req != 0u) {
            diag_samples_cur = vnd_frame_samples_req;
        } else {
            diag_samples_cur = adc_stream_get_active_samples();
            if (diag_samples_cur == 0u) {
                diag_samples_cur = (uint16_t)VND_FULL_DEFAULT_SAMPLES;
            }
        }
    }
    if (diag_samples_cur > VND_MAX_SAMPLES) {
        diag_samples_cur = VND_MAX_SAMPLES;
    }
    frame_bytes = (uint16_t)(VND_FRAME_HDR_SIZE + ((uint32_t)diag_samples_cur * 2u));
    demand_bps = (uint32_t)channel_count * (uint32_t)frame_bytes * (uint32_t)buf_rate;

    cdc_logf("STAT bytes_total=%llu bps=%lu (%.2f Mbps) streaming=%u diag=%u sentA=%lu sentB=%lu seq=%lu tx_attempt=%lu tx_reject=%lu tx_cplt=%lu abort=%lu sz_mm=%lu",
             (unsigned long long)cur, (unsigned long)bps, (double)mbps,
             (unsigned)streaming, (unsigned)diag_mode_active,
             (unsigned long)dbg_sent_ch0_total, (unsigned long)dbg_sent_ch1_total, (unsigned long)stream_seq,
             (unsigned long)tx_attempt, (unsigned long)tx_reject, (unsigned long)tx_ok,
             (unsigned long)frame_abort, (unsigned long)size_mism);
#if VND_SYNC_DIAG_PRINTF
    printf("[USB_RATE] tx=%luB/s raw=%luB/s tx=%.2fMbps raw=%.2fMbps ns=%u frame=%u ch=%u buf=%u A=%lu B=%lu txcplt=%lu\r\n",
           (unsigned long)bps,
           (unsigned long)demand_bps,
           (double)mbps,
           (double)((float)(demand_bps * 8ULL) / 1000000.0f),
           (unsigned)diag_samples_cur,
           (unsigned)frame_bytes,
           (unsigned)channel_count,
           (unsigned)buf_rate,
           (unsigned long)dbg_sent_ch0_total,
           (unsigned long)dbg_sent_ch1_total,
           (unsigned long)tx_ok);
#endif
}

/* CRC16-CCITT-FALSE: poly 0x1021, init 0xFFFF. */
static uint16_t vnd_crc16_ccitt_update(uint16_t crc, const uint8_t *data, uint32_t len)
{
    static const uint16_t crc4_table[16] = {
        0x0000u, 0x1021u, 0x2042u, 0x3063u,
        0x4084u, 0x50A5u, 0x60C6u, 0x70E7u,
        0x8108u, 0x9129u, 0xA14Au, 0xB16Bu,
        0xC18Cu, 0xD1ADu, 0xE1CEu, 0xF1EFu
    };

    for(uint32_t i = 0; i < len; ++i){
        uint8_t v = data[i];
        uint8_t idx = (uint8_t)(((crc >> 12) ^ (v >> 4)) & 0x0Fu);
        crc = (uint16_t)((crc << 4) ^ crc4_table[idx]);
        idx = (uint8_t)(((crc >> 12) ^ (v & 0x0Fu)) & 0x0Fu);
        crc = (uint16_t)((crc << 4) ^ crc4_table[idx]);
    }
    return crc;
}

static uint16_t vnd_crc16_ccitt(const uint8_t *data, uint32_t len)
{
    return vnd_crc16_ccitt_update(0xFFFFu, data, len);
}

/* Заголовок кадра */
/*
 * Формат под спецификацию хоста (ровно 32 байта, LE):
 *   [0..1] magic = 0xA55A -> 5A A5
 *   [2]    ver   = 0x01
 *   [3]    flags: 0x01=ADC0, 0x02=ADC1, 0x80=TEST, +0x04 если есть CRC16
 *   [4..7] seq (u32 LE) — общий для пары
 *   [8..11] timestamp (u32 LE) — одинаковый в паре
 *   [12..13] total_samples (u16 LE)
 *   [14..15] zone_count=0
 *   [16..19] zone1_offset=0
 *   [20..23] zone1_length=0
 *   [24..27] reserved=dma_seq/source generation
 *   [28..29] reserved2=buffer_index + source snapshot diagnostics
 *   [30..31] crc16: CRC16-CCITT-FALSE по header[0..29] + payload, если flags bit2=1
 */
typedef struct __attribute__((packed)) {
    uint16_t magic;           /* 0xA55A */
    uint8_t  ver;             /* 0x01 */
    uint8_t  flags;           /* см. описание выше */
    uint32_t seq;             /* номер логической последовательности (пары) */
    uint32_t timestamp;       /* HAL_GetTick */
    uint16_t total_samples;   /* кол-во сэмплов */
    uint16_t zone_count;      /* 0 */
    uint32_t zone1_offset;    /* 0 */
    uint32_t zone1_length;    /* 0 */
    uint32_t reserved;        /* 0 */
    uint16_t reserved2;       /* 0 */
    uint16_t crc16;           /* CRC16-CCITT-FALSE без самого поля crc16 */
} vnd_frame_hdr_t;
_Static_assert(sizeof(vnd_frame_hdr_t)==32, "vnd_frame_hdr_t must be 32 bytes (PACKING ERROR)");

static uint16_t vnd_pack_frame_reserved2(uint32_t dma_seq, uint16_t diag_flags)
{
    uint16_t buffer_index = (uint16_t)(adc_get_buffer_parity(dma_seq) & 0x07u);
    uint16_t source_slot = (uint16_t)((dma_seq % (uint32_t)FIFO_FRAMES) & 0x1Fu);
    uint16_t txcplt_lsb = (uint16_t)((dbg_tx_cplt & 0x0Fu) << VND_R2_TXCPLT_SHIFT);

    return (uint16_t)((buffer_index & VND_R2_BUFFER_INDEX_MASK) |
                      ((source_slot << VND_R2_SOURCE_SLOT_SHIFT) & VND_R2_SOURCE_SLOT_MASK) |
                      (diag_flags & (uint16_t)(VND_R2_SNAPSHOT_USED |
                                               VND_R2_GENERATION_MOVED |
                                               VND_R2_FIFO_GUARD |
                                               VND_R2_CONSUME_OK)) |
                      (txcplt_lsb & VND_R2_TXCPLT_MASK));
}

static uint16_t vnd_refresh_frame_reserved2_buffer_index(uint16_t reserved2, uint32_t dma_seq)
{
    uint16_t buffer_index = (uint16_t)(adc_get_buffer_parity(dma_seq) & 0x07u);
    return (uint16_t)((reserved2 & (uint16_t)~VND_R2_BUFFER_INDEX_MASK) | buffer_index);
}

static uint16_t vnd_frame_crc16(const uint8_t *frame, uint32_t payload_len)
{
    uint16_t crc = 0xFFFFu;
    crc = vnd_crc16_ccitt_update(crc, frame, VND_FRAME_HDR_SIZE - 2u);
    crc = vnd_crc16_ccitt_update(crc, frame + VND_FRAME_HDR_SIZE, payload_len);
    return crc;
}

