kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    prev_task = task;
    prev_hb = hb;
    prev_txcplt = txcplt;
    prev_sent_a = sent_a;
    prev_sent_b = sent_b;
    prev_wr = wr;
    prev_rd = rd;
    prev_avg_in = avg_in;
    prev_avg_out = avg_out;
    prev_avg_tx = avg_tx;
    prev_data_in = data_in;

    extern uint8_t USBD_VND_TxIsBusy(void);
    uint8_t ll_busy = USBD_VND_TxIsBusy();
    uint32_t last_age = 0xFFFFFFFFu;
    (void)vnd_tick_age_ms(now_ms, vnd_last_txcplt_ms, &last_age);
    uint32_t frame_age = 0xFFFFFFFFu;
    (void)vnd_tick_age_ms(now_ms, vnd_last_frame_txcplt_ms, &frame_age);
    uint32_t tx_age = 0u;
    if(!vnd_tick_age_ms(now_ms, vnd_last_tx_start_ms, &tx_age)){
        tx_age = 0u;
    }
    uint32_t hb_age = 0xFFFFFFFFu;
    (void)vnd_tick_age_ms(now_ms, last_heartbeat_ms, &hb_age);
    uint32_t sof_age = 0xFFFFFFFFu;
    (void)vnd_tick_age_ms(now_ms, g_usb_last_sof_ms, &sof_age);
    uint32_t host_rx_age = 0xFFFFFFFFu;
    (void)vnd_tick_age_ms(now_ms, vnd_last_host_rx_ack_ms, &host_rx_age);
    uint32_t force_idle_age = 0xFFFFFFFFu;
    (void)vnd_tick_age_ms(now_ms, dbg_tx_force_idle_last_ms, &force_idle_age);
    uint16_t in_total_len = USBD_VND_InTotalLength();
    char role = (vnd_sync_mode_public == VND_SYNC_MODE_MASTER) ? 'M' :
                (vnd_sync_mode_public == VND_SYNC_MODE_SLAVE) ? 'S' : 'O';

    printf("[USBSTAT] t=%lu role=%c stream=%u mode=%u async=%u ch=%u dt=%lu task=%lu(+%lu) gap=%lu/%lu/%lu hb=%lu(+%lu) hbage=%lu sof=%lu loop=%lu ep=%u ll=%u infl=%u pendB=%u err=%lu kick=%u meta=%u q=%u last=%lu frame=%lu txage=%lu len=%u tl=%u din=%lu(+%lu) unst=%lu/%lu rxage=%lu rx=%lu txcplt=%lu(+%lu) A=%lu(+%lu) B=%lu(+%lu) wr=%lu(+%lu) rd=%lu(+%lu) avg=%lu/%lu/%lu(+%lu/%lu/%lu)\r\n",
           (unsigned long)now_ms,
           role,
           (unsigned)streaming,
           (unsigned)vnd_stream_mode,
           (unsigned)async_mode,
           (unsigned)vnd_ch_mode,
           (unsigned long)dt_ms,
           (unsigned long)task,
           (unsigned long)d_task,
           (unsigned long)dbg_task_gap_last_ms,
           (unsigned long)dbg_task_gap_max_ms,
           (unsigned long)dbg_task_gap_count,
           (unsigned long)hb,
           (unsigned long)d_hb,
           (unsigned long)hb_age,
           (unsigned long)sof_age,
           (unsigned long)loop_cycle_last_avg,
           (unsigned)vnd_ep_busy,
           (unsigned)ll_busy,
           (unsigned)vnd_inflight,
           (unsigned)pending_B,
           (unsigned long)vnd_last_error,
           (unsigned)vnd_tx_kick,
           (unsigned)vnd_tx_meta_depth(),
           (unsigned)vnd_avg_q_count,
           (unsigned long)last_age,
           (unsigned long)frame_age,
           (unsigned long)tx_age,
           (unsigned)vnd_last_tx_len,
           (unsigned)in_total_len,
           (unsigned long)data_in,
           (unsigned long)d_data_in,
           (unsigned long)dbg_tx_force_idle_count,
           (unsigned long)force_idle_age,
           (unsigned long)host_rx_age,
           (unsigned long)vnd_host_rx_last_counter,
           (unsigned long)txcplt,
           (unsigned long)d_txcplt,
           (unsigned long)sent_a,
           (unsigned long)d_a,
           (unsigned long)sent_b,
           (unsigned long)d_b,
           (unsigned long)wr,
           (unsigned long)d_wr,
           (unsigned long)rd,
           (unsigned long)d_rd,
           (unsigned long)avg_in,
           (unsigned long)avg_out,
           (unsigned long)avg_tx,
           (unsigned long)d_avg_in,
           (unsigned long)d_avg_out,
           (unsigned long)d_avg_tx);
}

static void vnd_recover_avg_pending_b_stall(uint32_t now_ms)
{
    if(!streaming || !full_mode || diag_mode_active) return;
    if(vnd_stream_mode != VND_STREAM_MODE_AVG_ROI) return;
    if(!pending_B) return;

    extern uint8_t USBD_VND_TxIsBusy(void);
    uint8_t ll_busy = USBD_VND_TxIsBusy();
    if(vnd_ep_busy || ll_busy || vnd_inflight) return;

    uint32_t frame_age = 0u;
    if(!vnd_tick_age_ms(now_ms, vnd_last_frame_txcplt_ms, &frame_age)){
        frame_age = 0u;
    }
    uint32_t pend_age = 0u;
    if(!vnd_tick_age_ms(now_ms, pending_B_since_ms, &pend_age)){
        pend_age = 0u;
    }

    uint8_t b_slot = vnd_get_active_stream_slot(1u);
    ChanFrame *fA = &g_frames[b_slot][0];
    ChanFrame *fB = &g_frames[b_slot][1];

    if(fB->st == FB_READY) return;
    if(fB->st == FB_SENDING && vnd_last_tx_start_ms != 0u){
        uint32_t b_tx_age = 0u;
        if(!vnd_tick_age_ms(now_ms, vnd_last_tx_start_ms, &b_tx_age) || b_tx_age <= 250u){
            return;
        }
    }

    uint8_t queue_ready = (vnd_avg_q_count != 0u) ? 1u : 0u;
    if(!((queue_ready && (frame_age > 350u || pend_age > 350u)) ||
         frame_age > 1200u || pend_age > 1200u)){
        return;
    }

    printf("[USBRECOVER] avg_pendB age=%lu pend=%lu slot=%u A=%u B=%u q=%u meta=%u seq=%lu\r\n",
           (unsigned long)frame_age,
           (unsigned long)pend_age,
           (unsigned)b_slot,
           (unsigned)fA->st,
           (unsigned)fB->st,
           (unsigned)vnd_avg_q_count,
           (unsigned)vnd_tx_meta_depth(),
           (unsigned long)stream_seq);
    VND_LOG("AVG_PENDB_RECOVER age=%lums pend=%lums slot=%u A=%u B=%u q=%u",
            (unsigned long)frame_age,
            (unsigned long)pend_age,
            (unsigned)b_slot,
            (unsigned)fA->st,
            (unsigned)fB->st,
            (unsigned)vnd_avg_q_count);

    vnd_tx_meta_head = vnd_tx_meta_tail = 0;
    vnd_ep_busy = 0;
    vnd_tx_ready = 1;
    vnd_inflight = 0;
    vnd_last_tx_start_ms = 0;
    inflight_is_frame = 0;
    inflight_flags = 0;
    inflight_seq = 0;
    vnd_reset_buffers();

    stream_seq++;
    dbg_produced_seq++;
    vnd_tx_kick = 1;
}

static inline void vnd_tx_meta_push(uint8_t is_frame, uint8_t flags, uint32_t seq_field){
    uint8_t next = (uint8_t)((vnd_tx_meta_head + 1u) % VND_TX_META_FIFO);
    if(next == vnd_tx_meta_tail){
        /* overflow - drop oldest */
        vnd_tx_meta_tail = (uint8_t)((vnd_tx_meta_tail + 1u) % VND_TX_META_FIFO);
        meta_overflow_events++;
        VND_LOG("WARN META_FIFO_OVF depth_before=%u", (unsigned)vnd_tx_meta_depth());
    }
    vnd_tx_meta_fifo[vnd_tx_meta_head].is_frame = is_frame;
    vnd_tx_meta_fifo[vnd_tx_meta_head].flags = flags;
    vnd_tx_meta_fifo[vnd_tx_meta_head].seq_field = seq_field;
    vnd_tx_meta_fifo[vnd_tx_meta_head].push_tick = HAL_GetTick();
    vnd_tx_meta_head = next;
    meta_push_total++;
    /* Умеренный лог только для рабочих кадров (A/B/TEST); STAT слишком часты не будут */
    if(is_frame){
        VND_LOG("META_PUSH fl=0x%02X seq=%lu depth=%u", (unsigned)flags, (unsigned long)seq_field, (unsigned)vnd_tx_meta_depth());
    }
}
static inline int vnd_tx_meta_pop(vnd_tx_meta_t *out){
    if(vnd_tx_meta_tail == vnd_tx_meta_head){ meta_empty_events++; return 0; } /* empty */
    *out = vnd_tx_meta_fifo[vnd_tx_meta_tail];
    vnd_tx_meta_tail = (uint8_t)((vnd_tx_meta_tail + 1u) % VND_TX_META_FIFO);
    meta_pop_total++;
    return 1;
}

static inline void vnd_clear_inflight_meta(void)
{
    inflight_is_frame = 0;
    inflight_flags = 0;
    inflight_seq = 0;
}

