kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static inline void vnd_mark_service_inflight(void)
{
    vnd_inflight = 1;
    vnd_clear_inflight_meta();
}

static inline void vnd_rollback_tx_start(void)
{
    vnd_tx_ready = 1;
    vnd_ep_busy = 0;
    vnd_inflight = 0;
    vnd_clear_inflight_meta();
}

/* Унифицированная фиксация метаданных после успешного запуска передачи */
static inline void vnd_tx_meta_after(uint8_t *buf, uint16_t len){
    uint8_t is_frame = 0, flags = 0; uint32_t seq_field = 0;
    if(len >= VND_FRAME_HDR_SIZE){
        const vnd_frame_hdr_t *h = (const vnd_frame_hdr_t*)buf;
        if(h->magic == 0xA55A){ is_frame = 1; flags = h->flags; seq_field = h->seq; }
    }
    /* Сохраняем последнюю отправку для fallback-классификации */
    last_tx_is_frame = is_frame; last_tx_flags = flags; last_tx_seq = seq_field;
    vnd_tx_meta_push(is_frame, flags, seq_field);
}
/* Нейтрализовать «застрявшую» запись в meta-FIFO (например, после ForceTxIdle),
   чтобы последующий TxCplt не принял её за реальный кадр и не исказил порядок. */
static __attribute__((unused)) void vnd_meta_neutralize(uint8_t flags_mask, uint32_t seq_field)
{
    uint8_t t = vnd_tx_meta_tail;
    while(t != vnd_tx_meta_head){
        vnd_tx_meta_t *m = &vnd_tx_meta_fifo[t];
        if(m->is_frame &&
           (((uint8_t)(m->flags ^ flags_mask) & 0x83u) == 0u) &&
           (m->seq_field == seq_field)){
            m->is_frame = 0; m->flags = 0; /* превратить в служебный */
            VND_LOG("META_NEUTRALIZE fl=0x%02X seq=%lu", (unsigned)flags_mask, (unsigned long)seq_field);
            break;
        }
        t = (uint8_t)((t + 1u) % VND_TX_META_FIFO);
    }
}

static uint8_t vnd_slot_has_active_frames(uint8_t slot)
{
    if(slot >= VND_PAIR_BUFFERS) return 0u;
    return (g_frames[slot][0].st != FB_FILL || g_frames[slot][1].st != FB_FILL) ? 1u : 0u;
}

static uint8_t vnd_usb_in_active_slot_for_recovery(uint32_t seq_field, uint8_t flags)
{
    uint8_t ch_bits = (uint8_t)(flags & 0x03u);
    if(ch_bits != 0u){
        int seq_slot = vnd_find_pair_by_seq(seq_field);
        if(seq_slot >= 0){
            return (uint8_t)seq_slot;
        }
    }

    return vnd_get_active_stream_slot((pending_B || sending_channel == 1u || ch_bits == 0x02u) ? 1u : 0u);
}

static uint8_t vnd_usb_in_has_recoverable_state(void)
{
    if(vnd_ep_busy || vnd_inflight || pending_B || sending_channel != 0xFFu || vnd_tx_meta_depth() != 0u){
        return 1u;
    }

    return vnd_slot_has_active_frames(vnd_get_active_stream_slot(0u));
}

static uint8_t vnd_usb_in_active_abort_allowed(uint8_t ll_busy, uint32_t age_ms)
{
    if(!ll_busy){
        return 1u;
    }

#if VND_USB_IN_ABORT_ACTIVE_STREAM
    return (age_ms >= (uint32_t)VND_USB_IN_ACTIVE_HARD_STALL_MS) ? 1u : 0u;
#else
    (void)age_ms;
    return 0u;
#endif
}

static void vnd_usb_in_note_active_hold(const char *reason, uint32_t now_ms, uint32_t age_ms)
{
    uint32_t log_age_ms = 0u;

    dbg_tx_active_hold_count++;
    if(dbg_tx_active_hold_last_ms != 0u &&
       vnd_tick_age_ms(now_ms, dbg_tx_active_hold_last_ms, &log_age_ms) &&
       log_age_ms < (uint32_t)VND_USB_IN_ACTIVE_HOLD_LOG_MS){
        return;
    }
    dbg_tx_active_hold_last_ms = now_ms;

    extern uint8_t USBD_VND_TxIsBusy(void);
    extern uint16_t USBD_VND_InTotalLength(void);
    USBD_VND_InHwState hw;
    USBD_VND_GetInHwState(&hw);
    printf("[WARN EP_HOLD] kind=%s age=%lu len=%u tl=%u ll=%u ep=%u infl=%u ch=%u pendB=%u meta=%u q=%u hwctl=0x%08lX hwsz=0x%08lX hwint=0x%08lX hsts=0x%08lX hemp=0x%08lX xfer=%lu/%lu cnt=%lu\r\n",
           reason ? reason : "?",
           (unsigned long)age_ms,
           (unsigned)vnd_last_tx_len,
           (unsigned)USBD_VND_InTotalLength(),
           (unsigned)USBD_VND_TxIsBusy(),
           (unsigned)vnd_ep_busy,
           (unsigned)vnd_inflight,
           (unsigned)sending_channel,
           (unsigned)pending_B,
           (unsigned)vnd_tx_meta_depth(),
           (unsigned)vnd_avg_q_count,
           (unsigned long)hw.diepctl,
           (unsigned long)hw.dieptsiz,
           (unsigned long)hw.diepint,
           (unsigned long)hw.dtxfsts,
           (unsigned long)hw.diepempmsk,
           (unsigned long)hw.xfer_count,
           (unsigned long)hw.xfer_len,
           (unsigned long)dbg_tx_active_hold_count);
}

static uint8_t vnd_drop_current_stream_unit(uint8_t slot, uint8_t flags)
{
    uint8_t ch_bits = (uint8_t)(flags & 0x03u);

    if(slot >= VND_PAIR_BUFFERS){
        slot = pair_send_idx;
    }

    if(vnd_stream_mode == VND_STREAM_MODE_LATEST){
        uint8_t had_sending = 0u;
        for(uint8_t i = 0u; i < VND_PAIR_BUFFERS; i++){
            if(vnd_slot_has_active_frames(i)){
                if(g_frames[i][0].st == FB_SENDING || g_frames[i][1].st == FB_SENDING){
                    had_sending = 1u;
                    break;
                }
            }
        }
        uint8_t data_context = (ch_bits != 0u || sending_channel != 0xFFu || had_sending) ? 1u : 0u;
        if(data_context){
            vnd_reset_buffers();
            stream_seq++;
            dbg_produced_seq++;
            return 1u;
        }
        return 0u;
    }

    uint8_t had_slot = vnd_slot_has_active_frames(slot);
    uint8_t had_sending = (had_slot &&
                           (g_frames[slot][0].st == FB_SENDING || g_frames[slot][1].st == FB_SENDING)) ? 1u : 0u;
    uint8_t should_drop = (ch_bits != 0u || sending_channel != 0xFFu || had_sending) ? 1u : 0u;

    if(should_drop && had_slot){
        if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI){
            vnd_consume_strict_fifo_pair(slot);
        }
        vnd_clear_pair_slot(slot);
    }

    if(should_drop){
        pair_send_idx = (uint8_t)((slot + 1u) % VND_PAIR_BUFFERS);
        pair_fill_idx = pair_send_idx;
        pending_B = 0;
        pending_B_since_ms = 0;
        sending_channel = 0xFFu;
        stream_seq++;
        dbg_produced_seq++;
        return 1u;
    }

    pending_B = 0;
    pending_B_since_ms = 0;
    sending_channel = 0xFFu;
    return 0u;
}

static void vnd_usb_in_drop_recover(const char *reason, uint32_t now_ms, uint32_t age_ms)
{
    extern uint8_t USBD_VND_TxIsBusy(void);
    extern void USBD_VND_ForceTxIdle(void);

    uint8_t ll_busy_before = USBD_VND_TxIsBusy();
    uint8_t ep_before = vnd_ep_busy;
    uint8_t inflight_before = vnd_inflight;
    uint8_t meta_before = vnd_tx_meta_depth();
    uint8_t ch_before = sending_channel;
    uint8_t pend_before = pending_B;
    uint16_t stuck_len = vnd_last_tx_len;
    uint8_t flags_before = inflight_flags;
    uint32_t seq_before = inflight_seq;

