kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    if(!vnd_usb_in_active_abort_allowed(ll_busy_before, age_ms)){
        vnd_tx_drop_recovery_request = 0u;
        vnd_usb_in_note_active_hold(reason, now_ms, age_ms);
        return;
    }

    if((flags_before & 0x03u) == 0u && last_tx_is_frame){
        flags_before = last_tx_flags;
        seq_before = last_tx_seq;
    }

    uint8_t recoverable_before = vnd_usb_in_has_recoverable_state();
    uint8_t need_force_idle = (ll_busy_before || ep_before || inflight_before || meta_before != 0u) ? 1u : 0u;

    if(!need_force_idle && !recoverable_before){
        vnd_tx_drop_recovery_request = 0u;
        return;
    }

    uint8_t slot = vnd_usb_in_active_slot_for_recovery(seq_before, flags_before);

    if(!need_force_idle && ((flags_before & 0x03u) == 0u) && vnd_slot_has_active_frames(slot)){
        if(g_frames[slot][0].st != FB_FILL){
            flags_before = 0x01u;
            seq_before = g_frames[slot][0].seq;
        } else if(g_frames[slot][1].st != FB_FILL){
            flags_before = 0x02u;
            seq_before = g_frames[slot][1].seq;
        }
    }

    if(need_force_idle){
        USBD_VND_ForceTxIdle();
        dbg_tx_force_idle_count++;
        dbg_tx_force_idle_last_ms = now_ms;
    }
    dbg_tx_drop_recovery_count++;
    dbg_tx_drop_recovery_last_ms = now_ms;

    uint8_t dropped = vnd_drop_current_stream_unit(slot, flags_before);

    vnd_tx_meta_head = vnd_tx_meta_tail = 0u;
    vnd_clear_inflight_meta();
    vnd_ep_busy = 0u;
    vnd_tx_ready = 1u;
    vnd_inflight = 0u;
    vnd_last_tx_start_ms = 0u;
    test_in_flight = 0u;
    status_ack_pending = 0u;
    start_stat_inflight = 0u;
    start_ack_done = 1u;
    vnd_tx_drop_recovery_request = 0u;
    vnd_tx_kick = 1u;

    printf("[WARN EP_DROP] kind=%s age=%lu len=%u force=%u ll=%u ep=%u infl=%u ch=%u pendB=%u slot=%u fl=0x%02X meta=%u mode=%u dropped=%u cnt=%lu req=%lu\r\n",
           reason ? reason : "?",
           (unsigned long)age_ms,
           (unsigned)stuck_len,
           (unsigned)need_force_idle,
           (unsigned)ll_busy_before,
           (unsigned)ep_before,
           (unsigned)inflight_before,
           (unsigned)ch_before,
           (unsigned)pend_before,
           (unsigned)slot,
           (unsigned)flags_before,
           (unsigned)meta_before,
           (unsigned)vnd_stream_mode,
           (unsigned)dropped,
           (unsigned long)dbg_tx_drop_recovery_count,
           (unsigned long)dbg_tx_drop_recovery_request_count);
}

static void vnd_usb_in_request_drop_recovery_from_status(uint32_t now_ms)
{
    if(!streaming || stop_request) return;

    extern uint8_t USBD_VND_TxIsBusy(void);
    uint8_t ll_busy = USBD_VND_TxIsBusy();
    uint8_t busyish = (ll_busy || vnd_ep_busy || vnd_inflight || vnd_tx_meta_depth() != 0u) ? 1u : 0u;
    uint32_t age_ms = 0u;

    if(busyish &&
       vnd_last_tx_start_ms != 0u &&
       vnd_tick_age_ms(now_ms, vnd_last_tx_start_ms, &age_ms) &&
       age_ms > VND_USB_IN_BUSY_STALL_MS){
        if(!vnd_usb_in_active_abort_allowed(ll_busy, age_ms)){
            vnd_usb_in_note_active_hold("status_busy", now_ms, age_ms);
            return;
        }
        if(!vnd_tx_drop_recovery_request){
            dbg_tx_drop_recovery_request_count++;
        }
        vnd_tx_drop_recovery_request = 1u;
        vnd_tx_kick = 1u;
        return;
    }

    if(vnd_stream_active &&
       vnd_last_frame_txcplt_ms != 0u &&
       vnd_usb_in_has_recoverable_state() &&
       vnd_tick_age_ms(now_ms, vnd_last_frame_txcplt_ms, &age_ms) &&
       age_ms > VND_USB_IN_NO_PROGRESS_MS){
        if(!vnd_usb_in_active_abort_allowed(ll_busy, age_ms)){
            vnd_usb_in_note_active_hold("status_no_progress", now_ms, age_ms);
            return;
        }
        if(!vnd_tx_drop_recovery_request){
            dbg_tx_drop_recovery_request_count++;
        }
        vnd_tx_drop_recovery_request = 1u;
        vnd_tx_kick = 1u;
    }
}

static void vnd_usb_in_drop_recovery_poll(uint32_t now_ms)
{
    if(!streaming || stop_request){
        vnd_tx_drop_recovery_request = 0u;
        return;
    }

    uint32_t cooldown_age = 0u;
    uint32_t last_recovery_ms = dbg_tx_drop_recovery_last_ms;
    if(last_recovery_ms == 0u){
        last_recovery_ms = dbg_tx_force_idle_last_ms;
    }
    if(last_recovery_ms != 0u &&
       vnd_tick_age_ms(now_ms, last_recovery_ms, &cooldown_age) &&
       cooldown_age < VND_USB_IN_RECOVERY_COOLDOWN_MS){
        return;
    }

    extern uint8_t USBD_VND_TxIsBusy(void);
    uint8_t ll_busy = USBD_VND_TxIsBusy();
    uint8_t busyish = (ll_busy || vnd_ep_busy || vnd_inflight || vnd_tx_meta_depth() != 0u) ? 1u : 0u;
    uint32_t age_ms = 0u;

    if(vnd_tx_drop_recovery_request){
        if(vnd_last_tx_start_ms != 0u){
            (void)vnd_tick_age_ms(now_ms, vnd_last_tx_start_ms, &age_ms);
        } else if(vnd_last_frame_txcplt_ms != 0u){
            (void)vnd_tick_age_ms(now_ms, vnd_last_frame_txcplt_ms, &age_ms);
        }
        if(!vnd_usb_in_active_abort_allowed(ll_busy, age_ms)){
            vnd_tx_drop_recovery_request = 0u;
            vnd_usb_in_note_active_hold("status", now_ms, age_ms);
            return;
        }
        vnd_usb_in_drop_recover("status", now_ms, age_ms);
        return;
    }

    if(busyish &&
       vnd_last_tx_start_ms != 0u &&
       vnd_tick_age_ms(now_ms, vnd_last_tx_start_ms, &age_ms) &&
       age_ms > VND_USB_IN_BUSY_STALL_MS){
        if(!vnd_usb_in_active_abort_allowed(ll_busy, age_ms)){
            vnd_usb_in_note_active_hold("busy", now_ms, age_ms);
            return;
        }
        vnd_usb_in_drop_recover("busy", now_ms, age_ms);
        return;
    }

    if(vnd_stream_active &&
       vnd_last_frame_txcplt_ms != 0u &&
       vnd_usb_in_has_recoverable_state() &&
       vnd_tick_age_ms(now_ms, vnd_last_frame_txcplt_ms, &age_ms) &&
       age_ms > VND_USB_IN_NO_PROGRESS_MS){
        if(!vnd_usb_in_active_abort_allowed(ll_busy, age_ms)){
            vnd_usb_in_note_active_hold("no_progress", now_ms, age_ms);
            return;
        }
        vnd_usb_in_drop_recover("no_progress", now_ms, age_ms);
    }
}
static __attribute__((unused)) void vnd_debug_force_status_tick(void);
static void vnd_debug_raw_stat_tick(void);
static void __attribute__((unused)) vnd_send_fake_pair(void); // удалим позже; сейчас заглушка ниже
static void vnd_log_hdr_layout(void);
static void vnd_try_send_pending_status_from_task(void);
static void vnd_try_send_test_from_task(void);
/* Быстрый пайплайн: немедленная отправка следующего кадра из TxCplt */
static int vnd_try_send_B_immediate(void);
static int vnd_try_send_A_nextpair_immediate(void);
/* Заглушки для отключённых диагностик в static-mode */
static __attribute__((unused)) void vnd_debug_raw_stat_tick(void){ }
static void vnd_send_fake_pair(void){ }
static __attribute__((unused)) void vnd_debug_force_status_tick(void){ }
static __attribute__((unused)) void vnd_try_start_tx(void){ }
/* Аварийный keepalive: если совсем нет успешных завершений передач первые секунды */
static void vnd_emergency_keepalive(uint32_t now_ms);
/* Сервис: асинхронная обработка команд управления (EP0 SOFT/DEEP RESET) */
extern void USBD_VND_ProcessControlRequests(void);
/* Асинхронный планировщик A/B */
static int vnd_async_try_tx(void);
static int vnd_find_pair_by_seq(uint32_t seq);

