kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    vnd_sensor_last_poll_ms = now_ms;
    if(mcu_internal_adc_read(&snap)){
        vnd_emit_mcu_adc_events(&snap, force);
    }
}

#define VND_RPI_OPTIC_STATUS_BIT 0x20u

static uint8_t vnd_optic_rpi_report_allowed(void)
{
    vnd_lcd_sync_snapshot_t lcd;

    memset(&lcd, 0, sizeof(lcd));
    vnd_get_lcd_sync_snapshot(&lcd);

    /* OFF is an intentional standalone mode, not a synchronization failure.
       In synchronized MASTER/SLAVE operation, never expose an active optical
       sensor to RPI until the local synchronization state is trustworthy. */
    if(lcd.raw_mode == VND_SYNC_MODE_OFF){
        return 1u;
    }
    if((rs485_node_local_id_conflict() != 0u) ||
       (rs485_multiple_master_detected() != 0u)){
        return 0u;
    }
    return (uint8_t)(((lcd.sync_signal_alive != 0u) &&
                      (lcd.sync_ok_visual != 0u)) ? 1u : 0u);
}

static void vnd_optic_rpi_sanitize_queued_event(uint8_t *packet,
                                                uint16_t packet_len)
{
    uint8_t changed = 0u;
    uint8_t event_type;

    if((packet == NULL) ||
       (packet_len < VND_EVENT_HDR_SIZE) ||
       (vnd_optic_rpi_report_allowed() != 0u)){
        return;
    }

    event_type = packet[5];
    if((event_type == VND_EVT_TYPE_OPTIC_STATE) &&
       (packet_len >= (uint16_t)(VND_EVENT_HDR_SIZE + 8u))){
        if((packet[VND_EVENT_HDR_SIZE + 1u] & 0x01u) != 0u){
            packet[VND_EVENT_HDR_SIZE + 1u] &= (uint8_t)~0x01u;
            changed = 1u;
        }
        if(changed != 0u){
            vnd_optic_have_last = 0u;
        }
    } else if((event_type == VND_EVT_TYPE_SYNC_STATE) &&
              (packet_len >= (uint16_t)(VND_EVENT_HDR_SIZE + 16u))){
        if((packet[VND_EVENT_HDR_SIZE + 13u] &
            VND_RPI_OPTIC_STATUS_BIT) != 0u){
            packet[VND_EVENT_HDR_SIZE + 13u] &=
                (uint8_t)~VND_RPI_OPTIC_STATUS_BIT;
            changed = 1u;
        }
        if(changed != 0u){
            vnd_sync_have_last = 0u;
        }
    } else if((event_type == VND_EVT_TYPE_SENSOR_MAP) &&
              (packet_len >= (uint16_t)(VND_EVENT_HDR_SIZE + 40u))){
        for(uint8_t device_id = 0u; device_id < 32u; device_id++){
            uint8_t *status =
                &packet[VND_EVENT_HDR_SIZE + 8u + device_id];
            if((*status & VND_RPI_OPTIC_STATUS_BIT) != 0u){
                *status &= (uint8_t)~VND_RPI_OPTIC_STATUS_BIT;
                changed = 1u;
            }
        }
        if(changed != 0u){
            vnd_sensor_map_have_last = 0u;
        }
    }
}

static void vnd_emit_optic_state_event(uint8_t force)
{
    uint8_t payload[8];
    uint8_t flags = 0u;

    if((vnd_optic_rpi_report_allowed() != 0u) &&
       (optic_sensor_get_state() != 0u)){
        flags |= 0x01u;
    }
    if(vnd_tx_enable != 0u){
        flags |= 0x02u;
    }

    payload[0] = 1u;
    payload[1] = flags;
    payload[2] = optic_tx_get_power();
    payload[3] = dynamic_led_get_pattern();
    vnd_put_le16(&payload[4], optic_sensor_get_hold_deciseconds());
    payload[6] = 0u;
    payload[7] = 0u;

    if((force != 0u) ||
       vnd_payload_changed(payload, (uint8_t)sizeof(payload),
                           vnd_optic_last_payload, &vnd_optic_last_len, &vnd_optic_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_OPTIC_STATE, payload, (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, (uint8_t)sizeof(payload),
                                 vnd_optic_last_payload, &vnd_optic_last_len, &vnd_optic_have_last);
        }
    }
}

static void vnd_emit_sync_state_event(uint8_t force)
{
    vnd_lcd_sync_snapshot_t lcd;
    uint8_t local_status = 0u;
    uint8_t active_status_count = 0u;
    uint32_t seen_mask = 0u;
    uint8_t payload[16];
    uint8_t flags = 0u;
    uint8_t total_devices = 1u;
    uint8_t persisted_mode = VND_SYNC_MODE_SLAVE;
    uint32_t age_ds = 0xFFFFu;

    memset(&lcd, 0, sizeof(lcd));
    vnd_get_lcd_sync_snapshot(&lcd);
    (void)rs485_status_get_snapshot(&local_status, &active_status_count, &seen_mask, NULL, 32u);

    if((lcd.raw_mode == VND_SYNC_MODE_MASTER) ||
       (lcd.raw_mode == VND_SYNC_MODE_SLAVE)){
        total_devices = (active_status_count != 0u) ? active_status_count : 1u;
    }
    if(total_devices == 0u){
        total_devices = 1u;
    }

    if(lcd.sync_signal_alive != 0u) flags |= 0x01u;
    if(lcd.sync_ok_visual != 0u) flags |= 0x02u;
    if(lcd.sync_color_locked != 0u) flags |= 0x04u;
    if(vnd_sync_is_mode_host_forced() != 0u) flags |= 0x08u;
    if(vnd_sync_ok_public != 0u) flags |= 0x10u;
    if(rs485_role_get_local_persisted_mode(&persisted_mode) != 0u) flags |= 0x20u;
    if(rs485_node_local_id_conflict() != 0u) flags |= 0x40u;
    if(rs485_multiple_master_detected() != 0u) flags |= 0x80u;
    if(lcd.sync_age_ms != 0xFFFFFFFFu){
        age_ds = lcd.sync_age_ms / 100u;
        if(age_ds > 0xFFFFu) age_ds = 0xFFFFu;
    }

    payload[0] = 1u;
    payload[1] = lcd.raw_mode;
    payload[2] = lcd.display_mode;
    payload[3] = lcd.display_char;
    payload[4] = lcd.node_id;
    payload[5] = active_status_count;
    payload[6] = total_devices;
    payload[7] = flags;
    vnd_put_le32(&payload[8], seen_mask);
    payload[12] = lcd.display_value;
    payload[13] = (uint8_t)(local_status & 0xE0u);
    if(vnd_optic_rpi_report_allowed() == 0u) {
        payload[13] &= (uint8_t)~VND_RPI_OPTIC_STATUS_BIT;
    }
    if(rs485_role_get_local_persisted_mode(&persisted_mode) != 0u) {
        payload[13] |= (persisted_mode == VND_SYNC_MODE_MASTER) ? 0x01u : 0x02u;
    }
    if(lcd.node_id_assigned != 0u) {
        payload[13] |= 0x04u;
    }
    vnd_put_le16(&payload[14], (uint16_t)age_ds);

    if((force != 0u) ||
       vnd_payload_changed(payload, 14u,
                           vnd_sync_last_payload, &vnd_sync_last_len, &vnd_sync_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_SYNC_STATE, payload, (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, 14u,
                                 vnd_sync_last_payload, &vnd_sync_last_len, &vnd_sync_have_last);
        }
    }
}

static void vnd_emit_sensor_map_event(uint8_t force)
{
    vnd_lcd_sync_snapshot_t lcd;
    uint8_t payload[40];
    uint8_t node_count = 0u;
    uint32_t seen_mask = 0u;

    memset(&lcd, 0, sizeof(lcd));
    memset(payload, 0, sizeof(payload));
    vnd_get_lcd_sync_snapshot(&lcd);
    (void)rs485_status_get_snapshot(NULL,
                                    &node_count,
                                    &seen_mask,
                                    &payload[8],
                                    32u);
    if(vnd_optic_rpi_report_allowed() == 0u){
        for(uint8_t device_id = 0u; device_id < 32u; device_id++){
            payload[8u + device_id] &=
                (uint8_t)~VND_RPI_OPTIC_STATUS_BIT;
        }
    }

    payload[0] = 1u;
    payload[1] = lcd.node_id;
    if(lcd.node_id_assigned != 0u) {
        payload[2] |= 0x01u;
    }
    if(lcd.raw_mode == VND_SYNC_MODE_MASTER) {
        payload[2] |= 0x02u;
    }
    payload[3] = node_count;
    vnd_put_le32(&payload[4], seen_mask);

    if((force != 0u) ||
       vnd_payload_changed(payload, (uint8_t)sizeof(payload),
                           vnd_sensor_map_last_payload,
                           &vnd_sensor_map_last_len,
                           &vnd_sensor_map_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_SENSOR_MAP,
                             payload,
                             (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, (uint8_t)sizeof(payload),
                                 vnd_sensor_map_last_payload,
                                 &vnd_sensor_map_last_len,
                                 &vnd_sensor_map_have_last);
        }
    }
}

static uint8_t vnd_host_rx_alive_now(uint32_t now_ms)
{
    uint32_t age_ms = 0u;
    return (uint8_t)(streaming &&
                     vnd_tick_age_ms(now_ms, vnd_last_host_rx_ack_ms, &age_ms) &&
                     age_ms <= VND_HOST_RX_ACK_TIMEOUT_MS);
}

static void vnd_tx_failsafe_service(uint32_t now_ms)
{
    (void)vnd_tx_refresh_effective(now_ms, "failsafe");
}

