kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
static void vnd_emit_mode_state_event(uint32_t now_ms, uint8_t force)
{
    uint8_t payload[16];
    uint8_t flags = 0u;

    if(streaming) flags |= 0x01u;
    if(diag_mode_active) flags |= 0x02u;
    if(vnd_pending_init) flags |= 0x04u;
    if(vnd_stream_active) flags |= 0x08u;
    if(full_mode) flags |= 0x10u;
    if(async_mode) flags |= 0x20u;
    if(vnd_tx_enable) flags |= 0x40u;
    if(vnd_host_rx_alive_now(now_ms)) flags |= 0x80u;

    payload[0] = 1u;
    payload[1] = flags;
    payload[2] = vnd_stream_mode;
    payload[3] = vnd_ch_mode;
    payload[4] = host_profile;
    payload[5] = vnd_avg_n;
    vnd_put_le16(&payload[6], cur_samples_per_frame);
    vnd_put_le16(&payload[8], vnd_frame_samples_req);
    vnd_put_le16(&payload[10], vnd_trunc_samples);
    payload[12] = vnd_sync_mode_public;
    payload[13] = vnd_sync_is_mode_host_forced();
    payload[14] = 0u;
    payload[15] = 0u;

    if((force != 0u) ||
       vnd_payload_changed(payload, (uint8_t)sizeof(payload),
                           vnd_mode_last_payload, &vnd_mode_last_len, &vnd_mode_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_MODE_STATE, payload, (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, (uint8_t)sizeof(payload),
                                 vnd_mode_last_payload, &vnd_mode_last_len, &vnd_mode_have_last);
        }
    }
}

static void vnd_emit_error_state_event(uint8_t force)
{
    uint8_t payload[16];
    uint8_t flags = 0u;
    uint32_t last_error = vnd_last_error;

    if(last_error != 0u){
        flags |= 0x01u;
    }

    payload[0] = 1u;
    payload[1] = flags;
    vnd_put_le16(&payload[2], (last_error > 0xFFFFu) ? 0xFFFFu : (uint16_t)last_error);
    vnd_put_le32(&payload[4], vnd_error_counter);
    vnd_put_le32(&payload[8], dbg_tx_force_idle_count);
    vnd_put_le32(&payload[12], dbg_tx_drop_recovery_count);

    if((force != 0u) ||
       vnd_payload_changed(payload, (uint8_t)sizeof(payload),
                           vnd_error_last_payload, &vnd_error_last_len, &vnd_error_have_last)){
        if(vnd_event_enqueue(VND_EVT_TYPE_ERROR_STATE, payload, (uint16_t)sizeof(payload))){
            vnd_payload_remember(payload, (uint8_t)sizeof(payload),
                                 vnd_error_last_payload, &vnd_error_last_len, &vnd_error_have_last);
        }
    }
}

static void vnd_state_event_poll(uint32_t now_ms, uint8_t force)
{
    uint8_t due = force;
    uint8_t heartbeat = 0u;

    if((uint32_t)(now_ms - vnd_state_last_poll_ms) >= (uint32_t)VND_STATE_EVENT_PERIOD_MS){
        due = 1u;
    }
    if((vnd_event_count == 0u) &&
       ((uint32_t)(now_ms - vnd_event_last_enqueue_ms) >= (uint32_t)VND_EVENT_HEARTBEAT_MS)){
        due = 1u;
        heartbeat = 1u;
    }
    if(due == 0u){
        return;
    }
    vnd_state_last_poll_ms = now_ms;

    vnd_emit_fw_info_event(force);
    vnd_emit_optic_state_event(force);
    vnd_emit_sync_state_event(force);
    vnd_emit_sensor_map_event(force);
    vnd_emit_mode_state_event(now_ms, (uint8_t)(force || heartbeat));
    vnd_emit_error_state_event(force);
}

void Vendor_ChangeEvent_Task(void)
{
    uint32_t now_ms = HAL_GetTick();
    uint8_t force;
    uint8_t refresh;
    uint32_t primask;

    /* RS485 and sensor paths can raise these flags from interrupts. Snapshot
       and clear atomically; a request arriving later remains pending. */
    primask = __get_PRIMASK();
    __disable_irq();
    force = vnd_change_force_event;
    refresh = need_usb_status_refresh;
    vnd_change_force_event = 0u;
    need_usb_status_refresh = 0u;
    if(primask == 0u){
        __enable_irq();
    }

    if((refresh != 0u) && (force == 0u)){
        uint32_t enqueued_before = dbg_event_enqueued;

        /* Only controlled-sensor state is latency-critical. Role/topology,
           mode and error state remain on the 250 ms state poll below. Calling
           SYNC_STATE for every transient RS485 word can otherwise create a
           continuous service stream while the bus window is changing. */
        vnd_emit_optic_state_event(0u);
        vnd_emit_sensor_map_event(0u);
        if(dbg_event_enqueued != enqueued_before){
            pending_status = 1u;
            vnd_tx_kick = 1u;
        }
    } else if((refresh != 0u) && (force != 0u)){
        /* Preserve the legacy STAT companion for a genuine forced report. */
        pending_status = 1u;
        vnd_tx_kick = 1u;
    }

    vnd_state_event_poll(now_ms, force);
    vnd_sensor_event_poll(now_ms, force);
}

static uint8_t vnd_has_pending_event(void)
{
    return (uint8_t)(vnd_event_count != 0u);
}

static uint8_t vnd_can_preempt_stream_with_event(void)
{
    if(!vnd_has_pending_event()) return 0u;
    if(!streaming) return 1u;
    if(!first_pair_done && !vnd_stream_active) return 0u;
    if(pending_B || sending_channel != 0xFFu) return 0u;
    return 1u;
}

static void vnd_try_send_pending_event_from_task(void)
{
    if(!vnd_has_pending_event()) return;
    if(vnd_ep_busy || vnd_inflight){
        dbg_event_tx_defer++;
        return;
    }
    uint32_t now_ms = HAL_GetTick();
    if((vnd_event_next_tx_ms != 0u) && ((int32_t)(now_ms - vnd_event_next_tx_ms) < 0)){
        dbg_event_tx_defer++;
        return;
    }

    uint8_t idx = vnd_event_tail;
    uint16_t l = vnd_event_len[idx];
    if(l < VND_EVENT_HDR_SIZE || l > VND_EVENT_MAX){
        vnd_event_tail = (uint8_t)((vnd_event_tail + 1u) % VND_EVENT_QUEUE_LEN);
        if(vnd_event_count != 0u) vnd_event_count--;
        return;
    }
    uint8_t event_type = vnd_event_q[idx][5];
    memcpy(vnd_event_tx_buf, vnd_event_q[idx], l);
    vnd_optic_rpi_sanitize_queued_event(vnd_event_tx_buf, l);

    vnd_status_permit_once = 1;
    vnd_tx_ready = 0;
    vnd_ep_busy = 1;
    vnd_last_tx_len = l;
    vnd_last_tx_start_ms = now_ms;
    vnd_mark_service_inflight();
    dbg_event_tx_attempt++;
    vnd_event_inflight_type = event_type;
    vnd_event_inflight_len = (uint8_t)l;
    if(USBD_VND_Transmit(&hUsbDeviceHS, vnd_event_tx_buf, l) == USBD_OK){
        vnd_tx_meta_after(vnd_event_tx_buf, l);
        vnd_event_tail = (uint8_t)((vnd_event_tail + 1u) % VND_EVENT_QUEUE_LEN);
        if(vnd_event_count != 0u) vnd_event_count--;
        dbg_event_tx_ok++;
        dbg_event_last_tx_type = event_type;
        vnd_event_next_tx_ms = 0u;
    } else {
        dbg_event_tx_fail++;
        vnd_event_next_tx_ms = now_ms + 20u;
        vnd_event_inflight_type = 0xFFu;
        vnd_event_inflight_len = 0u;
        vnd_status_permit_once = 0;
        vnd_rollback_tx_start();
    }
}

/* Отправка отложенного STAT только из таска */
static void vnd_try_send_pending_status_from_task(void)
{
    /* В диагностическом режиме полностью запрещаем любые STAT по bulk-IN,
       чтобы исключить окна между A и B. Для статуса используйте EP0 (ctrl).
       Также ACK-STOP в DIAG не отправляем через bulk (см. обработчик STOP). */
    if(diag_mode_active){ return; }
    if(!pending_status) return;
    /* Нельзя отправлять STAT, если есть незавершённая передача (даже если busy временно сброшен) */
    if(vnd_ep_busy || vnd_inflight) return;
    uint16_t l = vnd_build_status((uint8_t*)status_buf, sizeof(status_buf));
    if(!l) { pending_status = 0; return; } /* (очистка дублирующего кода STAT уже выполнена выше) */
    vnd_status_permit_once = 1;
    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = l; vnd_last_tx_start_ms = HAL_GetTick();
    vnd_mark_service_inflight();
    if(USBD_VND_Transmit(&hUsbDeviceHS, (uint8_t*)status_buf, l) == USBD_OK){
        vnd_tx_meta_after((uint8_t*)status_buf, l);
        VND_LOG("STAT_TX pending(task) len=%u depth=%u", l, (unsigned)vnd_tx_meta_depth());
        if(stop_request){ stop_stat_inflight = 1; }
        pending_status = 0;
    } else {
        VND_LOG("STAT_TX pending(task) busy/fail");
        vnd_status_permit_once = 0;
        vnd_rollback_tx_start();
    }
}

