kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
void Vendor_Status_Task(void)
{
    if(!streaming && !vnd_ep_busy && !vnd_inflight){
        vnd_try_send_pending_status_from_task();
    }
}

void Vendor_Maintenance_Task(void)
{
#ifndef VND_MAINT_ENABLE_DC_LOAD
#define VND_MAINT_ENABLE_DC_LOAD 1u
#endif
#ifndef VND_MAINT_ENABLE_DC_BACKGROUND
#define VND_MAINT_ENABLE_DC_BACKGROUND 1u
#endif
#ifndef VND_MAINT_ENABLE_DC_SAVE
#define VND_MAINT_ENABLE_DC_SAVE 1u
#endif
#if VND_MAINT_ENABLE_DC_LOAD
    vnd_dc_load_once();

    if(vnd_dc_load_request){
        vnd_dc_load_request = 0;
        vnd_dc_load_once();
    }
#endif
#if VND_MAINT_ENABLE_DC_BACKGROUND
    {
        uint16_t roi_start = win_start0;
        uint16_t roi_len   = win_len0;
        if(roi_len == 0u){
            if(win_auto){
                vnd_apply_auto_roi_window();
                roi_start = win_start0;
                roi_len = win_len0;
            } else {
                roi_start = (uint16_t)VND_ROI_BASE_START_200HZ;
                roi_len = (uint16_t)VND_ROI_LEN_DEFAULT;
            }
        }
        /* AVG_ROI owns DC only for the exact 200-sample table. For any other USB
           window, the fixed background DC process must continue independently. */
        if(!(streaming && full_mode && !diag_mode_active &&
             vnd_stream_mode == VND_STREAM_MODE_AVG_ROI &&
             roi_len == (uint16_t)VND_DC_ROI_LEN)){
            vnd_dc_background_step(roi_start, roi_len);
        }
#if VND_MAINT_ENABLE_DC_SAVE
        vnd_dc_try_save_periodic();
#endif
    }
#endif

    {
        uint32_t now_ms = HAL_GetTick();
        vnd_tx_failsafe_service(now_ms);

        if(vnd_sync_mode == VND_SYNC_MODE_MASTER){
            uint16_t hz = adc_stream_get_buf_rate();
            if(hz != 0u && hz != vnd_sync_last_hz){
                vnd_sync_set_master(hz);
            }
            vnd_sync_ok_public = 1u;
        } else if(vnd_sync_mode == VND_SYNC_MODE_SLAVE){
            uint16_t hz = vnd_sync_pending_hz;
            if(hz != 0u && (now_ms - vnd_sync_last_apply_ms) > 200u){
                vnd_sync_pending_hz = 0;
                vnd_sync_last_apply_ms = now_ms;
                if(win_auto && (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)){
                    uint16_t prev_start = win_start0;
                    vnd_apply_auto_roi_window();
                    if(win_start0 != prev_start){
                        vnd_avg_reset();
                        vnd_update_lcd_params();
                    }
                }
            }
            {
                extern volatile uint32_t sync_last_edge_ms;
                vnd_sync_ok_public = (uint8_t)((sync_last_edge_ms != 0u && (now_ms - sync_last_edge_ms) <= 1000u) ? 1u : 0u);
            }
        }
    }

}

/* Тик от таймера */
static volatile uint8_t vnd_tick_flag = 0;
void usb_vendor_periodic_tick(void){ vnd_tick_flag = 1; }

void vnd_request_adc_restart_from_isr(void)
{
    /* USB/sync control is not allowed to restart acquisition. A real ADC/DMA
       stall is recovered only by adc_stream_watchdog(). */
}

/*
 * ВАЖНО:
 * - В on-wire протоколе поле hdr.seq должно отражать логическую последовательность кадра,
 *   привязанную к данным DMA (а не к счётчику отправок).
 * - Хостовый GUI использует (seq & 1) как even/odd, поэтому seq НЕ должен быть пер-канальным

 *   счётчиком передачи.
 */

/* ---------------- Вспомогательные ---------------- */
static void vnd_reset_buffers(void){
    for(uint8_t p=0;p<VND_PAIR_BUFFERS;p++) for(uint8_t c=0;c<2;c++){ g_frames[p][c].st=FB_FILL; g_frames[p][c].samples=0; g_frames[p][c].flags = c?VND_FLAGS_ADC1:VND_FLAGS_ADC0; g_frames[p][c].frame_size=0; g_frames[p][c].seq=0; g_frames[p][c].dma_seq=0; g_frames[p][c].crc16=0; g_frames[p][c].crc_seq=0; memset(g_frames[p][c].buf,0xCC,sizeof(g_frames[p][c].buf)); }
    pair_fill_idx=pair_send_idx=0; sending_channel=0xFF; channel0_sent_curseq=channel1_sent_curseq=0; pending_B = 0; pending_B_since_ms = 0;
    vnd_next_frame_tx_ms = 0;
    vnd_last_tx_pace_busy = 0;
}

uint16_t vnd_build_status(uint8_t *dst, uint16_t max_len){
    uint8_t sync_master_flags = 0u;
    uint8_t optic_report_allowed = 0u;
    rs485_selected_slave_snapshot_t selected_slave;

    if(max_len < 64) return 0; /* требуется минимум v1 */
    memset(&g_status,0,sizeof(g_status));
    memset(&selected_slave, 0, sizeof(selected_slave));
    /* Сигнатура 'STAT' в первых 4 байтах */
    g_status.sig[0] = 'S';
    g_status.sig[1] = 'T';
    g_status.sig[2] = 'A';
    g_status.sig[3] = 'T';
    g_status.version = 6; /* v6: direct device IDs 0..31, 137 bytes */
    g_status.cur_samples = cur_samples_per_frame;
    g_status.frame_bytes = (uint16_t)(VND_FRAME_HDR_SIZE + cur_samples_per_frame*2u);
    g_status.test_frames = test_sent ? 1u : 0u;
    g_status.produced_seq = dbg_produced_seq;
    g_status.sent0 = dbg_sent_ch0_total;
    g_status.sent1 = dbg_sent_ch1_total;
    g_status.dbg_tx_cplt = dbg_tx_cplt;
    g_status.dbg_partial_frame_abort = dbg_partial_frame_abort;
    g_status.dbg_size_mismatch = dbg_size_mismatch;
    /* Получим DMA счётчики */
    adc_stream_debug_t d; adc_stream_get_debug(&d);
    g_status.dma_done0 = d.dma_full0;
    g_status.dma_done1 = d.dma_full1;
    g_status.frame_wr_seq = d.frame_wr_seq;
    /* Дополнение: сохранить независимые seq по каналам в резервных полях для отладки (LSW) */
    /* Используем zone_count/zone1_offset временно, НЕ нарушая сигнатуру first 4 bytes (для старого парсера останутся нулями, если не читает эти поля) */
    /* Предполагается, что хост обновит парсер позже; сейчас это поле диагностическое. */
    /* ВНИМАНИЕ: если host строго ожидает zone_count==0, можно отключить. */
    /* Формат STAT не расширяем: master optic отдаем битом flags_runtime. */
    (void)rs485_status_get_master_snapshot(NULL, NULL, &sync_master_flags);
    optic_report_allowed = vnd_optic_rpi_report_allowed();

    if(streaming) g_status.flags_runtime |= VND_STFLAG_STREAMING;
    if(diag_mode_active) g_status.flags_runtime |= VND_STFLAG_DIAG_ACTIVE;
    if(vnd_pending_init) g_status.flags_runtime |= VND_STFLAG_PENDING_INIT;
    if(vnd_stream_active) g_status.flags_runtime |= VND_STFLAG_STREAM_ACTIVE;
    if(vnd_tx_enable) g_status.flags_runtime |= VND_STFLAG_TX_ENABLED;
    if((optic_report_allowed != 0u) && optic_sensor_get_state()) {
        g_status.flags_runtime |= VND_STFLAG_OPTIC_ACTIVE;
    }
    if((optic_report_allowed != 0u) &&
       ((sync_master_flags & 0x04u) != 0u)) { /* rs485 master snapshot flag: optic active */
        g_status.flags_runtime |= VND_STFLAG_MASTER_OPTIC_ACTIVE;
    }
    if((optic_report_allowed != 0u) && optic_any_sensor_active()) {
        g_status.flags_runtime |= VND_STFLAG_GROUP_OPTIC_ACTIVE;
    }
    {
        uint8_t persisted_mode = VND_SYNC_MODE_SLAVE;
        if(rs485_role_get_local_persisted_mode(&persisted_mode) != 0u) {
            g_status.flags_runtime |= VND_STFLAG_RS485_ROLE_PERSISTED;
            if(persisted_mode == VND_SYNC_MODE_MASTER) {
                g_status.flags_runtime |= VND_STFLAG_RS485_PERSISTED_MASTER;
            }
        }
        if(rs485_node_get_conflict_mask() != 0u) {
            g_status.flags_runtime |= VND_STFLAG_RS485_ID_CONFLICT;
        }
        if(rs485_multiple_master_detected() != 0u) {
            g_status.flags_runtime |= VND_STFLAG_MULTIPLE_MASTER;
        }
    }
    rs485_role_get_selected_slave_snapshot(&selected_slave);
    if((selected_slave.flags & RS485_SELECTED_SLAVE_FLAG_VALID) != 0u) {
        g_status.flags_runtime |= VND_STFLAG_SELECTED_SLAVE_VALID;
    }
    if((selected_slave.flags & RS485_SELECTED_SLAVE_FLAG_LOCAL) != 0u) {
        g_status.flags_runtime |= VND_STFLAG_SELECTED_SLAVE_LOCAL;
    }
    {
        uint8_t selected_sensor_bits =
            (uint8_t)(selected_slave.sensor_status & 0xE0u);
        if(optic_report_allowed == 0u) {
            selected_sensor_bits &=
                (uint8_t)~VND_RPI_OPTIC_STATUS_BIT;
        }
        if(((selected_slave.flags & RS485_SELECTED_SLAVE_FLAG_FRESH) != 0u) &&
           (selected_sensor_bits != 0u)) {
            g_status.flags_runtime |= VND_STFLAG_SELECTED_SLAVE_SENSOR;
        }
    }
    /* Новые поля диагностики */
    uint16_t f2 = 0;
    /* Бит0 = занятость IN EP: локальная (vnd_ep_busy) ИЛИ низкоуровневая (LL vnd_tx_busy) */
    {
        extern uint8_t USBD_VND_TxIsBusy(void);
        uint8_t ll_busy = USBD_VND_TxIsBusy();
        if(vnd_ep_busy || ll_busy) f2 |= 1u<<0;
    }
    if(vnd_tx_ready)         f2 |= 1u<<1;
    if(pending_B)            f2 |= 1u<<2;
    if(test_in_flight)       f2 |= 1u<<3;
    if(start_ack_done)       f2 |= 1u<<4;
    if(start_stat_inflight)  f2 |= 1u<<5;
    if(start_stat_planned)   f2 |= 1u<<6;
    if(pending_status)       f2 |= 1u<<7;
    if(simple_tx_mode)       f2 |= 1u<<8;
    if(diag_mode_active)     f2 |= 1u<<9;
    if(first_pair_done)      f2 |= 1u<<10; /* переместим ниже биты READY/SENDING */
    /* Доп. диагностика: наличие готовых кадров в g_frames[0] */
    {
        uint8_t st_slot = vnd_get_active_stream_slot(pending_B ? 1u : 0u);
        ChanFrame *fa = &g_frames[st_slot][0];
        ChanFrame *fb = &g_frames[st_slot][1];
        if (fa->st == FB_READY) f2 |= 1u<<11;
        if (fb->st == FB_READY) f2 |= 1u<<12;
        /* Новые биты: состояние SENDING для A/B чтобы различать READY и активную передачу */
        if (fa->st == FB_SENDING) f2 |= 1u<<13;
        if (fb->st == FB_SENDING) f2 |= 1u<<14;
    }
    g_status.flags2 = f2;
    g_status.sending_ch = sending_channel;
    g_status.pair_idx = (uint16_t)(((uint16_t)pair_fill_idx << 8) | pair_send_idx);
    g_status.last_tx_len = vnd_last_tx_len;
    g_status.cur_stream_seq = stream_seq;
     /* Переиспользуем резервные поля для отладки на хосте (совместимо с parser'ом):
        reserved0 = LSB dbg_prepare_calls, reserved2(low) = LSB dbg_prepare_ok,
        reserved3 = LSW frame_rd_seq (для сравнения с frame_wr_seq). */
     /* Упаковываем в reserved0: нижние 4 бита = LSB dbg_prepare_calls, старшие 4 = lastTxRC (LL) */
     do {
         extern uint8_t USBD_VND_LastTxRC(void);
         uint8_t rc = USBD_VND_LastTxRC();
         uint8_t lsb = (uint8_t)(dbg_prepare_calls & 0x0Fu);
         g_status.reserved0 = (uint8_t)((rc << 4) | lsb);
     } while(0);
      /* reserved2 переупаковка:
          низшие 4 бита = LSB dbg_prepare_ok,
          старшие 4 бита = (init_pump_attempts & 0x0F) (диагностика старта).
          Факт отправки A через pump отражаем также в flags2 бит15. */
      uint8_t prep_lsb = (uint8_t)(dbg_prepare_ok & 0x0Fu);
      uint8_t pump_att = (uint8_t)(init_pump_attempts & 0x0Fu);
      g_status.reserved2 = (uint8_t)((pump_att << 4) | prep_lsb);
    /* Оптическая телеметрия для RPI (legacy 64B view):
       reserved3[15:8] = optic_power (0..255),
       reserved3[7:2]  = optic_hold_seconds rounded up (1..63),
       reserved3[1]    = tx_enable,
       reserved3[0]    = optic_active. */
    do {
        uint8_t optic_power = optic_tx_get_power();
        uint8_t optic_hold_seconds = optic_sensor_get_hold_seconds();
        uint8_t optic_bits = (uint8_t)((optic_hold_seconds & 0x3Fu) << 2);
        if ((optic_report_allowed != 0u) && optic_sensor_get_state()) {
            optic_bits |= 0x01u;
        }
        if (vnd_tx_enable) {
            optic_bits |= 0x02u;
        }
        g_status.reserved3 = (uint16_t)(((uint16_t)optic_power << 8) | optic_bits);
    } while (0);
    /* Отразим факт успешной отправки A через init-pump в flags2 бит15 ("A_fill READY" ранее не использовался) */
    if(init_pump_a_sent){ g_status.flags2 |= (uint16_t)(1u<<15); }
    /* v2 расширение: заполняем метки стадий (если доступны) */
    g_status.stage_alt1_ms = vnd_stage_alt1_ms;
    g_status.stage_start_ms = start_cmd_ms;
    g_status.stage_first_frame_ms = vnd_stage_first_frame_ms;
    
