kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* v3 расширение: ДИАГНОСТИКА счётчиков нулевых буферов ADC */
    g_status.ch_zero_buffers_A = d.ch_zero_buffers[0];
    g_status.ch_zero_buffers_B = d.ch_zero_buffers[1];
    /* v4 расширение: текущий tick и метки последнего полного DMA кадра по каналам */
    do {
        uint32_t now_ms = HAL_GetTick();
        extern volatile uint32_t adc_last_full0_ms;
        extern volatile uint32_t adc_last_full1_ms;
        g_status.now_ms = now_ms;
        g_status.last_full0_ms = adc_last_full0_ms;
        g_status.last_full1_ms = adc_last_full1_ms;
        uint32_t host_rx_ack_age_ms = 0u;
        if (streaming &&
            vnd_tick_age_ms(now_ms, vnd_last_host_rx_ack_ms, &host_rx_ack_age_ms) &&
            host_rx_ack_age_ms <= VND_HOST_RX_ACK_TIMEOUT_MS) {
            g_status.flags_runtime |= VND_STFLAG_HOST_RX_ALIVE;
        }
        vnd_usb_in_request_drop_recovery_from_status(now_ms);
    } while(0);
    /* v5 extension: RPI-facing sync and dynamic LED state */
    do {
        g_status.optic_hold_ds = optic_sensor_get_hold_deciseconds();
        g_status.led_pattern = dynamic_led_get_pattern();
        (void)rs485_status_get_snapshot(&g_status.sync_local_status,
                                        &g_status.sync_node_count,
                                        &g_status.sync_seen_mask,
                                        g_status.sync_status_bytes,
                                        (uint8_t)sizeof(g_status.sync_status_bytes));
        if(optic_report_allowed == 0u) {
            g_status.sync_local_status &=
                (uint8_t)~VND_RPI_OPTIC_STATUS_BIT;
            for(uint8_t device_id = 0u;
                device_id < (uint8_t)sizeof(g_status.sync_status_bytes);
                device_id++) {
                g_status.sync_status_bytes[device_id] &=
                    (uint8_t)~VND_RPI_OPTIC_STATUS_BIT;
            }
        }
    } while(0);
     /* Хак: инкремент dbg_skipped_frames отображаем в sent0/sent1 дельтах, но здесь добавим только
        косвенную диагностику: если skips растут, host увидит разницу produced_seq - sent*. Дополнительно
        можно временно печатать в CDC при отладке (сейчас лог выключен для скорости). */
    /* Output length is schema-aligned for old hosts: 64B(v1), 96B(v4),
       136B(v5 prefix), or 137B(v6). */
    if(max_len < 96u){
        g_status.version = 1;
        memcpy(dst, &g_status, 64);
        return 64;
    }
    if(max_len < 136u){
        g_status.version = 4;
        memcpy(dst, &g_status, 96);
        return 96;
    }
    if(max_len < (uint16_t)sizeof(g_status)){
        vnd_status_v1_t legacy_status = g_status;

        /* Preserve the real v5 wire layout for existing RPI software:
           bit/index 0 means device 1, ... bit/index 30 means device 31.
           Device 0 is representable only by the 137-byte v6 layout. */
        legacy_status.version = 5;
        legacy_status.sync_seen_mask = 0u;
        legacy_status.sync_node_count = 0u;
        memset(legacy_status.sync_status_bytes, 0,
               sizeof(legacy_status.sync_status_bytes));
        for(uint8_t device_id = 1u; device_id < 32u; device_id++){
            uint32_t direct_bit = (1u << device_id);
            if((g_status.sync_seen_mask & direct_bit) != 0u){
                uint8_t legacy_index = (uint8_t)(device_id - 1u);
                legacy_status.sync_seen_mask |= (1u << legacy_index);
                legacy_status.sync_status_bytes[legacy_index] =
                    g_status.sync_status_bytes[device_id];
                legacy_status.sync_node_count++;
            }
        }
        memcpy(dst, &legacy_status, 136u);
        return 136u;
    }
    memcpy(dst,&g_status,sizeof(g_status));
    return (uint16_t)sizeof(g_status);
}

uint16_t vnd_build_lcd_status(uint8_t *dst, uint16_t max_len)
{
    vnd_lcd_status_v1_t st;
    vnd_lcd_sync_snapshot_t snap;

    if ((dst == NULL) || (max_len < (uint16_t)sizeof(st))) {
        return 0u;
    }

    memset(&st, 0, sizeof(st));
    memset(&snap, 0, sizeof(snap));
    vnd_get_lcd_sync_snapshot(&snap);

    st.sig[0] = 'L';
    st.sig[1] = 'C';
    st.sig[2] = 'D';
    st.sig[3] = 'S';
    st.version = 1u;
    st.raw_mode = snap.raw_mode;
    st.display_mode = snap.display_mode;
    st.display_value = snap.display_value;
    st.slave_count = snap.slave_count;
    st.node_id = snap.node_id;
    st.display_color_id = snap.display_color_id;
    st.display_char = snap.display_char;
    st.display_rgb565 = snap.display_rgb565;
    st.sync_age_ms = snap.sync_age_ms;

    if (vnd_lcd_role_overlay_active != 0u) {
        st.display_mode = snap.raw_mode;
        if (snap.raw_mode == VND_SYNC_MODE_SLAVE) {
            st.display_char = (uint8_t)'S';
            st.display_value = (uint8_t)(snap.node_id & 0x1Fu);
        } else if (snap.raw_mode == VND_SYNC_MODE_MASTER) {
            st.display_char = (uint8_t)'M';
            st.display_value = (uint8_t)(snap.node_id & 0x1Fu);
        } else {
            st.display_char = (uint8_t)'O';
            st.display_value = 0u;
        }
    }

    if (snap.sync_signal_alive != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_SIGNAL_ALIVE;
    }
    if (snap.sync_ok_visual != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_SYNC_OK_VISUAL;
    }
    if (snap.sync_color_locked != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_COLOR_LOCKED;
    }
    if (snap.sync_signal_alive == 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_DISPLAY_FALLBACK;
    }
    if (vnd_sync_is_mode_host_forced() != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_HOST_FORCED;
    }
    if (vnd_lcd_role_overlay_enabled != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_ROLE_OVERLAY_EN;
    }
    if (vnd_lcd_role_overlay_active != 0u) {
        st.flags |= VND_LCD_SYNC_FLAG_ROLE_OVERLAY_ACT;
        st.display_rgb565 = vnd_lcd_role_overlay_rgb565;
        st.display_color_id = vnd_lcd_role_overlay_color_id;
    }
    {
        uint8_t persisted_mode = VND_SYNC_MODE_SLAVE;
        if (rs485_role_get_local_persisted_mode(&persisted_mode) != 0u) {
            st.flags |= VND_LCD_SYNC_FLAG_ROLE_PERSISTED;
            if (persisted_mode == VND_SYNC_MODE_MASTER) {
                st.flags |= VND_LCD_SYNC_FLAG_PERSISTED_MASTER;
            }
        }
        if (rs485_node_local_id_conflict() != 0u) {
            st.flags |= VND_LCD_SYNC_FLAG_NODE_ID_CONFLICT;
        }
        if (rs485_multiple_master_detected() != 0u) {
            st.flags |= VND_LCD_SYNC_FLAG_MULTIPLE_MASTER;
        }
        if (snap.node_id_assigned != 0u) {
            st.flags |= VND_LCD_SYNC_FLAG_DEVICE_ID_ASSIGNED;
        }
    }

    st.text[0] = (char)st.display_char;
    if (((st.display_mode == VND_SYNC_MODE_SLAVE) ||
         (st.display_mode == VND_SYNC_MODE_MASTER)) &&
        (snap.node_id_assigned == 0u)) {
        st.text[1] = '-';
        st.text[2] = '-';
    } else if (st.display_mode == VND_SYNC_MODE_OFF) {
        st.text[1] = ' ';
        st.text[2] = ' ';
    } else {
        st.text[1] = (char)('0' + ((st.display_value / 10u) % 10u));
        st.text[2] = (char)('0' + (st.display_value % 10u));
    }
    st.text[3] = '\0';

    memcpy(dst, &st, sizeof(st));
    return (uint16_t)sizeof(st);
}

uint16_t vnd_build_dc_config(uint8_t *dst, uint16_t max_len)
{
    vnd_dc_config_v2_t st;
    if ((dst == NULL) || (max_len < (uint16_t)sizeof(st))) {
        return 0u;
    }

