kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    memset(&st, 0, sizeof(st));
    st.sig[0] = 'D';
    st.sig[1] = 'C';
    st.sig[2] = 'C';
    st.sig[3] = 'F';
    st.version = 2u;
    st.enabled = (vnd_dc_speed_settle_ms != 0u) ? 1u : 0u;
    if(vnd_dc_dirty_public) st.flags |= VND_DC_STATUS_FLAG_DIRTY;
    st.settle_ms = vnd_dc_speed_settle_ms;
    st.set_at_ms = vnd_dc_speed_set_at_ms;
    st.adapt_updates = vnd_dc_adapt_updates;

    memcpy(dst, &st, sizeof(st));
    return (uint16_t)sizeof(st);
}

uint16_t vnd_build_rs485_ident(uint8_t node_id, uint8_t *dst, uint16_t max_len)
{
    vnd_rs485_ident_v1_t st;
    rs485_identity_snapshot_t snap;

    if ((dst == NULL) || (max_len < (uint16_t)sizeof(st))) {
        return 0u;
    }

    memset(&st, 0, sizeof(st));
    memset(&snap, 0, sizeof(snap));
    st.sig[0] = 'R';
    st.sig[1] = 'I';
    st.sig[2] = 'D';
    st.sig[3] = '1';
    st.version = 1u;

    if (rs485_identity_get_snapshot(node_id, &snap) != 0u) {
        st.node_id = snap.node_id;
        st.flags = snap.flags;
        memcpy(st.short_id, snap.short_id, sizeof(st.short_id));
        memcpy(st.ip4, snap.ip4, sizeof(st.ip4));
        st.seen_page_mask = snap.seen_page_mask;
        st.last_ms = snap.last_ms;
        st.rpi_number = snap.rpi_number;
    } else {
        memset(st.short_id, '?', 9u);
        st.short_id[9] = '\0';
    }

    memcpy(dst, &st, sizeof(st));
    return (uint16_t)sizeof(st);
}

uint16_t vnd_build_rs485_sensor(uint8_t device_id,
                                uint8_t *dst,
                                uint16_t max_len)
{
    vnd_rs485_sensor_v1_t st;
    rs485_sensor_snapshot_t snap;

    if ((dst == NULL) || (max_len < (uint16_t)sizeof(st))) {
        return 0u;
    }

    memset(&st, 0, sizeof(st));
    memset(&snap, 0, sizeof(snap));
    st.sig[0] = 'S';
    st.sig[1] = 'N';
    st.sig[2] = 'S';
    st.sig[3] = '1';
    st.version = 1u;
    if (rs485_sensor_get_snapshot(device_id, &snap) != 0u) {
        st.device_id = snap.device_id;
        st.flags = snap.flags;
        st.sensor_bits = snap.sensor_bits;
        st.last_changed_index = snap.last_changed_index;
        st.last_change_ms = snap.last_change_ms;
    }

    memcpy(dst, &st, sizeof(st));
    return (uint16_t)sizeof(st);
}

uint8_t vnd_is_streaming(void){ return streaming; }
uint8_t vnd_is_tx_enabled(void){ return vnd_tx_enable; }
uint8_t vnd_is_tx_requested_enabled(void){ return vnd_tx_requested_enable; }
uint32_t vnd_get_tx_host_cmd_count(void){ return vnd_tx_host_cmd_count; }
uint32_t vnd_get_tx_host_cmd_last_ms(void){ return vnd_tx_host_cmd_last_ms; }
uint8_t vnd_get_tx_host_cmd_last_value(void){ return vnd_tx_host_cmd_last_value; }
uint32_t vnd_get_tx_effective_change_count(void){ return vnd_tx_effective_change_count; }
uint32_t vnd_get_tx_effective_off_count(void){ return vnd_tx_effective_off_count; }
uint32_t vnd_get_tx_effective_last_change_ms(void){ return vnd_tx_effective_last_change_ms; }
uint8_t vnd_get_tx_effective_last_value(void){ return vnd_tx_effective_last_value; }
uint8_t vnd_set_tx_enabled(uint8_t enable)
{
    return vnd_tx_set_enabled_internal(enable, "manual");
}

static void vnd_apply_tx_enable_outputs(void)
{
    /* Apply all TX200 pins from one phase source. Do not drive PA1 separately:
       it is the complement of PA2/PC7 and a separate write creates a false edge. */
    adc_stream_refresh_marker_output();
}

static uint8_t vnd_tx_set_enabled_internal(uint8_t enable, const char *reason)
{
    vnd_tx_requested_enable = (enable != 0u) ? 1u : 0u;
    return vnd_tx_refresh_effective(HAL_GetTick(), reason);
}

static uint8_t vnd_tx_refresh_effective(uint32_t now_ms, const char *reason)
{
    /* TX200 is allowed only while both conditions remain true:
       1) the oscilloscope/RPI explicitly requested TX;
       2) the USB stream is logically running.
       Do not gate TX from the short HOST_RX_ACK heartbeat: a transient USB
       scheduling delay must never create a missing TX pulse. */
    uint8_t next = (uint8_t)((vnd_tx_requested_enable != 0u) &&
                             (streaming != 0u));
    if(vnd_tx_enable != next){
        if(next == 0u){
            vnd_tx_effective_off_count++;
        }
        vnd_tx_effective_change_count++;
        vnd_tx_effective_last_change_ms = now_ms;
        vnd_tx_effective_last_value = next;
        vnd_tx_enable = next;
        vnd_apply_tx_enable_outputs();
        cdc_logf("EVT TX_ENABLE=%u req=%u reason=%s",
                 (unsigned)next,
                 (unsigned)vnd_tx_requested_enable,
                 reason ? reason : "?");
    }
    return vnd_tx_enable;
}

/* функция vnd_generate_test_sawtooth() реализована в vnd_testgen.c */

static void vnd_prepare_pair(void)
{
    uint32_t t_start = get_us_approx(); /* Начало измерения */

    dbg_prepare_calls++;
    /* ВАЖНО: полный режим (non-async) отправляет/закрывает пары по pair_send_idx.
       Чтобы не зависать, готовим пару именно в том слоте, который будет отправляться следующим.
       Иначе можно заполнить другой слот и затем бесконечно ждать READY в pair_send_idx. */
    uint8_t active_slot = pair_send_idx;
    if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        /* В строгих режимах не готовим пары "вперёд" в других слотах.
           Иначе при оборачивании кольца можно накопить READY-кадры вне pair_send_idx
           и получить зависание/перестановку A/B. */
        if(g_frames[active_slot][0].st != FB_FILL || g_frames[active_slot][1].st != FB_FILL){
            return;
        }
    } else {
        for(uint8_t i=0;i<VND_PAIR_BUFFERS;i++){
            uint8_t s = (uint8_t)((pair_send_idx + i) % VND_PAIR_BUFFERS);
            if(g_frames[s][0].st == FB_FILL && g_frames[s][1].st == FB_FILL){ active_slot = s; break; }
        }
    }
    
    /* Убран подробный лог PREPARE_PAIR — счётчики агрегируются в периодическую статистику */
    uint16_t *ch1 = NULL, *ch2 = NULL; uint16_t samples = 0;
    (void)ch1; (void)ch2; /* могут быть неиспользованы в режиме overlay */
    uint16_t crc_a = 0; uint32_t crc_seq = 0;
    uint32_t pair_seq = 0;
    uint8_t used_avg_q = 0;
    uint8_t used_avg_q_idx = 0;
    uint32_t used_avg_ts_ms = 0;
    /* Локальный снапшот staging-буфера, чтобы TC не перезаписал usb_stage_bufA во время копирования */
    static __attribute__((unused)) uint16_t stage_copy[MAX_FRAME_SAMPLES];
    static uint16_t lossless_dc_copy_a[VND_DC_ROI_LEN];
    static uint16_t lossless_dc_copy_b[VND_DC_ROI_LEN];
    uint16_t stage_samples = 0;
    (void)stage_samples; /* может быть неиспользован при ADC_USB_STAGE_ENABLE=0 */
    
#if USE_TEST_SAWTOOTH
    /* Тестовый режим: используем последнюю сгенерированную пару буферов */
    {
        /* Генерируем свежий буфер-пилу (1..N) перед выборкой */
        vnd_generate_test_sawtooth();
        uint16_t *tb0 = NULL, *tb1 = NULL; uint16_t avail = 0;
        if(!vnd_testgen_try_consume_latest(&tb0, &tb1, &avail)){
            return; /* нет новых данных */
        }
        ch1 = tb0; ch2 = tb1;
        samples = (avail != 0) ? avail : 302;  /* МАРКЕР #2 - fallback если avail=0 */
        (void)ch1; (void)ch2; /* используем в тестовом режиме, чтобы подавить предупреждения */
        (void)stage_samples; (void)seq; (void)static_mode; (void)static_seq;
        static uint32_t test_seq = 0; pair_seq = ++test_seq;
        /* Зафиксировать размер кадра, если ещё не задан, чтобы отправка не зависела от профиля АЦП */
        if(cur_samples_per_frame == 0){
            uint16_t eff = samples;
            if(eff > VND_MAX_SAMPLES) eff = VND_MAX_SAMPLES;
            cur_samples_per_frame = eff;
            cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)eff * 2u);
        }
    }
#else
        /* Два режима:
             0) LATEST (как сейчас): "последний заполненный буфер", пропуски допустимы.
                 1) LOSSLESS_ROI: строго по FIFO (без пропусков на стороне прошивки), но отправляем только окно ROI.
                         Окно задаётся win_start0/win_len0; по умолчанию 280..480 (200) и сдвигается по частоте. */
    if (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)
    {
        /* ROI окно */
        uint16_t roi_start = win_start0;
        uint16_t roi_len   = win_len0;
        if(roi_len == 0u){
            roi_len = VND_ROI_LEN_DEFAULT;
            if(win_auto){
                vnd_apply_auto_roi_window();
                roi_start = win_start0;
            } else {
                roi_start = 0u;
            }
        }
        if(roi_len > VND_MAX_SAMPLES) roi_len = VND_MAX_SAMPLES;
        if(roi_len > MAX_FRAME_SAMPLES) roi_len = MAX_FRAME_SAMPLES;

        if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI)
        {
            /* Берём следующий кадр строго по очереди (A+B синхронно по DMA seq) */
            if(!adc_peek_frame_pair_fifo(&ch1, &ch2, &samples, &pair_seq)){
                return;
            }
            if(samples < (uint16_t)(roi_start + roi_len)){
                /* Профиль/размер кадра не подходит под ROI — ждём корректного кадра */
                (void)adc_consume_frame_pair_fifo(pair_seq);
                return;
            }
            /* Лочим формат кадра на ROI длину */
            if(cur_samples_per_frame != roi_len){
                cur_samples_per_frame = roi_len;
                cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame * 2u);
            }
            /* Смещаем указатели на начало ROI. Для 200-sample ROI применяем DC к локальной
               копии, чтобы USB payload был скорректирован, но FIFO/DMA raw буферы не менялись. */
            if(roi_len == (uint16_t)VND_DC_ROI_LEN){
                uint8_t parity = (uint8_t)(adc_get_buffer_parity(pair_seq) & 1u);
                vnd_dc_load_once();
                vnd_dc_ensure_parity_mapping(ch1, ch2, samples, roi_start, roi_len, parity);
                memcpy(lossless_dc_copy_a, ch1 + roi_start, (size_t)roi_len * sizeof(uint16_t));
                memcpy(lossless_dc_copy_b, ch2 + roi_start, (size_t)roi_len * sizeof(uint16_t));
                vnd_dc_apply_only(0, parity, lossless_dc_copy_a, roi_len);
                vnd_dc_apply_only(1, parity, lossless_dc_copy_b, roi_len);
                ch1 = lossless_dc_copy_a;
                ch2 = lossless_dc_copy_b;
            } else {
                ch1 = ch1 + roi_start;
                ch2 = ch2 + roi_start;
            }
            /* В ROI режиме не используем precomputed CRC из staging (оно было для полного кадра). */
            crc_a = 0; crc_seq = 0;
            samples = cur_samples_per_frame;
        }
        else
        {
            /* stream_mode=2: выдаём только готовые усреднённые ROI кадры из очереди.
               Сбор/усреднение идёт в фоне через vnd_avg_drain_fifo(), чтобы не терять входные кадры. */
            if(vnd_avg_q_count == 0){
                return;
            }
            used_avg_q = 1;
            used_avg_q_idx = vnd_avg_q_head;

            /* Инициализируем формат кадра по ROI длине */
            if(cur_samples_per_frame != roi_len){
                cur_samples_per_frame = roi_len;
                cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + (uint32_t)cur_samples_per_frame * 2u);
            }

