kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* Для stream_mode=2: только после успешной подготовки выталкиваем элемент из очереди */
    if(used_avg_q && vnd_avg_q_count){
        vnd_avg_q_head = (uint8_t)((vnd_avg_q_head + 1u) % VND_AVG_OUT_Q);
        vnd_avg_q_count--;
        dbg_avg_tx_pairs++;
    }
    /* Продвигаем индекс заполнения, если кадр успешно подготовлен */
    pair_fill_idx = (uint8_t)((active_slot + 1u) % VND_PAIR_BUFFERS);
    dbg_prepare_ok++;
    /* FPS: счётчик подготовленных пар */
    fps_prepare_count++;
    
    /* Измерение времени prepare */
    uint32_t t_end = get_us_approx();
    uint32_t duration = t_end - t_start;
    perf_stats.prepare_total_us += duration;
    perf_stats.prepare_count++;
}

static uint16_t vnd_wire_frame_len(uint16_t useful_len)
{
#if VND_USB_ROI_PAD_TO_MPS
    if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI ||
       vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        const uint32_t unit = (uint32_t)VND_USB_ROI_PAD_BYTES;
        if(unit != 0u){
            uint32_t padded = (((uint32_t)useful_len + unit - 1u) / unit) * unit;
            if(padded > (uint32_t)useful_len && padded <= (uint32_t)VND_FRAME_MAX_SIZE){
                return (uint16_t)padded;
            }
        }
    }
#else
    (void)useful_len;
#endif
    return useful_len;
}

static void vnd_build_frame(ChanFrame *cf)
{
    if(cf->samples == 0){ cf->st = FB_FILL; return; }
    uint32_t payload_len = (uint32_t)cf->samples * 2u;
    uint32_t total = VND_FRAME_HDR_SIZE + payload_len;
    vnd_frame_hdr_t *h = (vnd_frame_hdr_t*)cf->buf;
    
    h->magic = 0xA55A;
    h->ver = 0x01;
    h->flags = (cf->flags & VND_FLAGS_ADC0) ? 0x01 : 0x02;
    h->seq = cf->seq;
    h->total_samples = (uint16_t)cf->samples;

    /* Метаданные ROI для хоста:
       - В режиме LOSSLESS_ROI передаём только окно [win_start0 : win_start0+samples)
       - total_samples = samples (обычно 200)
       - zone1_offset/zone1_length позволяют хосту рисовать ось X как 280..479, а не 0..199
    */
    if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        h->zone_count = 1;
        h->zone1_offset = (uint32_t)win_start0;
        h->zone1_length = (uint32_t)cf->samples;
    } else {
        h->zone_count = 0;
        h->zone1_offset = 0;
        h->zone1_length = 0;
    }
    h->reserved = cf->dma_seq;
    
     /* reserved2: buffer_index (0-7) для GUI. Даже/нечёт можно получить как (buffer_index & 1). */
     h->reserved2 = (uint16_t)(adc_get_buffer_parity(cf->dma_seq) & 0x07u);
    
    h->crc16 = 0u;
    h->flags &= (uint8_t)~VND_FRAME_FLAG_CRC16;
    uint16_t useful_size = (uint16_t)total;
    uint16_t wire_size = vnd_wire_frame_len(useful_size);
    if(wire_size > useful_size){
        memset(cf->buf + useful_size, 0, (uint32_t)wire_size - useful_size);
    }
    cf->frame_size = wire_size;
    if(cur_expected_frame_size && useful_size != cur_expected_frame_size) dbg_size_mismatch++;
    dbg_any_valid_frame = 1; cf->st = FB_READY;
}

/* Поиск индекса пары по seq (линейный поиск по короткому кольцу) */
static int vnd_find_pair_by_seq(uint32_t seq)
{
    for(uint8_t i=0;i<VND_PAIR_BUFFERS;i++){
        if(g_frames[i][0].st != FB_FILL && g_frames[i][0].seq == seq) return (int)i;
        if(g_frames[i][1].st != FB_FILL && g_frames[i][1].seq == seq) return (int)i;
    }
    return -1;
}

static int vnd_find_slot_for_seq_ch(uint32_t seq, uint8_t ch)
{
    if(ch > 1u) return -1;
    for(uint8_t i = 0; i < VND_PAIR_BUFFERS; i++){
        if(g_frames[i][ch].st != FB_FILL && g_frames[i][ch].seq == seq){
            return (int)i;
        }
    }
    return -1;
}

static uint8_t vnd_get_active_stream_slot(uint8_t want_b)
{
    if(async_mode || !full_mode) return pair_send_idx;
    if(vnd_stream_mode != VND_STREAM_MODE_LOSSLESS_ROI && vnd_stream_mode != VND_STREAM_MODE_AVG_ROI){
        return pair_send_idx;
    }

    int slot = want_b ? vnd_find_slot_for_seq_ch(stream_seq, 1u)
                      : vnd_find_slot_for_seq_ch(stream_seq, 0u);
    if(slot < 0){
        slot = vnd_find_pair_by_seq(stream_seq);
    }
    return (slot >= 0) ? (uint8_t)slot : pair_send_idx;
}

static void vnd_clear_pair_slot(uint8_t slot)
{
    if(slot >= VND_PAIR_BUFFERS) return;
    g_frames[slot][0].st = FB_FILL;
    g_frames[slot][1].st = FB_FILL;
}

static void vnd_consume_strict_fifo_pair(uint8_t slot)
{
    if(slot >= VND_PAIR_BUFFERS) return;
    if(vnd_stream_mode != VND_STREAM_MODE_LOSSLESS_ROI) return;

    uint32_t dma_seq = g_frames[slot][0].dma_seq;
    if(g_frames[slot][0].st == FB_FILL && g_frames[slot][1].st != FB_FILL){
        dma_seq = g_frames[slot][1].dma_seq;
    }
    (void)adc_consume_frame_pair_fifo(dma_seq);
}

static void vnd_align_strict_pair_cursor(void)
{
    if(async_mode || !full_mode) return;
    if(vnd_stream_mode != VND_STREAM_MODE_LOSSLESS_ROI && vnd_stream_mode != VND_STREAM_MODE_AVG_ROI) return;

    int exact_slot = -1;
    for(uint8_t i = 0; i < VND_PAIR_BUFFERS; i++){
        uint8_t a_active = (g_frames[i][0].st != FB_FILL);
        uint8_t b_active = (g_frames[i][1].st != FB_FILL);
        if(!a_active && !b_active) continue;

        uint32_t seq = a_active ? g_frames[i][0].seq : g_frames[i][1].seq;
        if(seq == stream_seq){
            if(exact_slot < 0){
                exact_slot = (int)i;
            } else {
                vnd_clear_pair_slot(i);
            }
        }
    }

    if(exact_slot >= 0){
        pair_send_idx = (uint8_t)exact_slot;
        pair_fill_idx = pair_send_idx;
    }
}

static uint8_t vnd_strict_slot_ready_for_stream(uint8_t slot)
{
    if(async_mode || !full_mode) return 1u;
    if(vnd_stream_mode != VND_STREAM_MODE_LOSSLESS_ROI && vnd_stream_mode != VND_STREAM_MODE_AVG_ROI) return 1u;
    if(slot >= VND_PAIR_BUFFERS) return 0u;

    uint8_t a_active = (g_frames[slot][0].st != FB_FILL);
    uint8_t b_active = (g_frames[slot][1].st != FB_FILL);
    if(!a_active && !b_active) return 0u;

    uint32_t seq = a_active ? g_frames[slot][0].seq : g_frames[slot][1].seq;
    if(seq == stream_seq) return 1u;
    if(seq < stream_seq){
        vnd_clear_pair_slot(slot);
        if(slot == pair_send_idx){
            pair_send_idx = (uint8_t)((pair_send_idx + 1u) % VND_PAIR_BUFFERS);
            pair_fill_idx = pair_send_idx;
        }
    }
    return 0u;
}

/* Асинхронный выбор и отправка одного готового кадра (A или B) */
/* Режим строгой парности по желанию: 0 — независимые каналы, 1 — строгая пара A&B на один seq */
static uint8_t vnd_strict_pairing = 0;  /* ОТКЛЮЧЕНО: каналы независимы, отправляем как только готов */
static volatile uint8_t vnd_async_state_reset_req = 0;

