kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
        if(vnd_sync_mode == VND_SYNC_MODE_MASTER){
            uint16_t hz = adc_stream_get_buf_rate();
            if(hz != 0u && hz != vnd_sync_last_hz){
                vnd_sync_set_master(hz);
            }
            vnd_sync_ok_public = 1u;
        } else if(vnd_sync_mode == VND_SYNC_MODE_SLAVE){
            uint16_t hz = vnd_sync_pending_hz;
            if(hz != 0u && (now_ms - vnd_sync_last_apply_ms) > 200u){
                vnd_sync_pending_hz = 0;
                vnd_sync_last_apply_ms = now_ms;
                /* Frequency capture kept for diagnostics only.
                   Do not change buf_rate/TIM15 divider on slave automatically. */
                if(win_auto && (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)){
                    uint16_t prev_start = win_start0;
                    vnd_apply_auto_roi_window();
                    if(win_start0 != prev_start){
                        vnd_avg_reset();
                        vnd_update_lcd_params();
                    }
                }
            }
            {
                extern volatile uint32_t sync_last_edge_ms;
                if(sync_last_edge_ms != 0u && (now_ms - sync_last_edge_ms) <= 1000u){
                vnd_sync_ok_public = 1u;
            } else {
                vnd_sync_ok_public = 0u;
            }
            }
        }
    }

    /* ПРИОРИТЕТ 0: если не сконфигурировано стримингом — обслуживаем оффлайн-STAT
       и параллельно ведём DC адаптацию/сохранение по входному сигналу (если есть кадры в FIFO). */
    if(!streaming)
    {
        if(!vnd_ep_busy && !vnd_inflight){ vnd_try_send_pending_event_from_task(); }
        if(!vnd_ep_busy && !vnd_inflight){ vnd_try_send_pending_status_from_task(); }
        vnd_tick_flag = 0;
        return;
    }
    /* подавляем частый шум лога при каждом заходе в таск */
    if(!dbg_printed_sizes)
    {
        vnd_log_hdr_layout();
        dbg_printed_sizes = 1;
    }

    /* DEBUG: очень шумный вывод sample[95] по всем DMA буферам.
       По умолчанию отключено, включайте только при необходимости. */
#if defined(VND_DEBUG_S95) && (VND_DEBUG_S95 == 1)
    {
        static uint32_t last_s95_ms = 0;
        uint32_t now_ms = HAL_GetTick();
        if (now_ms - last_s95_ms >= 1000u) {
            last_s95_ms = now_ms;
            adc_stream_print_sample95_all_buffers();
        }
    }
#endif

    /* (перезапуск ADC/DMA обработан выше, до выхода при !streaming) */
    /* СУПЕР-ПРИОРИТЕТ: если пришёл STOP — разрешаем только ACK-STAT, полностью блокируем стрим */
    if (stop_request) {
        if (!vnd_ep_busy) {
            if (!pending_status) pending_status = 1; /* гарантируем наличие отложенного STAT */
            vnd_try_send_pending_status_from_task();
        }
        if (vnd_tick_flag) vnd_tick_flag = 0;
        /* Логируем попытки передачи после STOP */
        if (pending_B || test_sent) {
            VND_LOG("BLOCK: попытка передачи после STOP (pending_B=%d, test_sent=%d)", pending_B, test_sent);
            pending_B = 0; test_sent = 0; sending_channel = 0xFF;
        }
        return; /* ждём TxCplt ACK-STOP */
    }

    vnd_usb_in_drop_recovery_poll(HAL_GetTick());

    /* В AVG_ROI B должен уходить сразу после завершения A. Не ставим перед ним
       фоновый drain/DSP, иначе короткий USB hiccup быстро превращается в q=4 и recovery. */
    if(full_mode && !diag_mode_active && vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        if(pending_B && !vnd_ep_busy && !vnd_inflight){
            if(vnd_try_send_B_immediate()){
                if(vnd_tick_flag) vnd_tick_flag = 0;
                return;
            }
        }
    }

    /* stream_mode=2: постоянно дренируем FIFO и готовим усреднённые ROI кадры в очереди.
       Это критично для "lossless" поведения (потребление ADC не должно зависеть от скорости USB). */
    if(full_mode && !diag_mode_active && vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
        /* Выполняем загрузку DC из Flash в main-loop как можно раньше (после SET_STREAM_MODE).
           Это помогает после перезагрузки не начинать адаптацию "с нуля" из-за задержки загрузки. */
        if(vnd_dc_load_request){
            vnd_dc_load_request = 0;
            vnd_dc_load_once();
        }
        uint16_t roi_start = win_start0;
        uint16_t roi_len   = win_len0;
        if(roi_len == 0u){ roi_start = 280u; roi_len = 200u; }
        vnd_avg_drain_fifo(roi_start, roi_len);

        /* Периодическое сохранение DC в Flash (если менялся): вызывать всегда, а не только в 1Hz сводке.
           Внутри есть троттлинг по времени и флаг dirty. */
        vnd_dc_try_save_periodic();

        /* Периодическая сводка (UART): помогает понять реальный коэффициент усреднения и состояние очереди */
        uint32_t now_ms = HAL_GetTick();
        if(dbg_avg_last_print_ms == 0){ dbg_avg_last_print_ms = now_ms; }
        if((now_ms - dbg_avg_last_print_ms) >= 1000u){
            uint32_t in_now = dbg_avg_in_frames;
            uint32_t out_now = dbg_avg_out_frames;
            uint32_t tx_now = dbg_avg_tx_pairs;
            uint32_t din = in_now - dbg_avg_in_last;
            uint32_t dout = out_now - dbg_avg_out_last;
            uint32_t dtx = tx_now - dbg_avg_tx_last;
            dbg_avg_in_last = in_now; dbg_avg_out_last = out_now; dbg_avg_tx_last = tx_now;
            dbg_avg_last_print_ms = now_ms;
                 uint32_t dsp_avg_us = (vnd_dsp.dsp_us_cnt ? (vnd_dsp.dsp_us_total / vnd_dsp.dsp_us_cnt) : 0u);
#if VND_AVG_DIAG_PRINTF
                                 printf("[AVG] n=%u q=%u drop=%lu cnt0=%u cnt1=%u in=%lu(+%lu/s) out=%lu(+%lu/s) tx=%lu(+%lu/s) dsp=%luus(avg) %luus(max) corr_eo=(%.3f,%.3f) corr_ab=(e=%.3f,o=%.3f)\r\n",
                                     (unsigned)vnd_avg_n, (unsigned)vnd_avg_q_count,
                                     (unsigned long)dbg_avg_drop_frames,
                                     (unsigned)vnd_avg_cnt[0], (unsigned)vnd_avg_cnt[1],
                                     (unsigned long)in_now, (unsigned long)din,
                                     (unsigned long)out_now, (unsigned long)dout,
                                         (unsigned long)tx_now, (unsigned long)dtx,
                                         (unsigned long)dsp_avg_us, (unsigned long)vnd_dsp.dsp_us_max,
                                         (double)vnd_dsp.corr_eo[0], (double)vnd_dsp.corr_eo[1],
                                         (double)vnd_dsp.corr_ab[0], (double)vnd_dsp.corr_ab[1]);
#endif

