kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
    /* ДИАГНОСТИКА: детальное состояние передачи каждые 2 секунды */
    {
        static uint32_t last_diag_detail_ms = 0;
        if(streaming && (now - last_diag_detail_ms) > 2000){
            last_diag_detail_ms = now;
            extern uint8_t USBD_VND_TxIsBusy(void);
            uint8_t ll_busy = USBD_VND_TxIsBusy();
            ChanFrame *fA = &g_frames[0][0];
            ChanFrame *fB = &g_frames[0][1];
            const char *stA = (fA->st==FB_READY?"RDY":(fA->st==FB_SENDING?"SND":"FIL"));
            const char *stB = (fB->st==FB_READY?"RDY":(fB->st==FB_SENDING?"SND":"FIL"));
            cdc_logf("DBG ep_busy=%u ll_busy=%u ch=%u pendB=%u A_st=%s B_st=%s metaD=%u",
                (unsigned)vnd_ep_busy, (unsigned)ll_busy, (unsigned)sending_channel, (unsigned)pending_B,
                stA, stB, (unsigned)vnd_tx_meta_depth());
        }
    }
    
    /* Периодическое обновление дисплея LCD с информацией о потоке */
    // stream_display_periodic_update();
    vnd_usb_in_drop_recovery_poll(now);
    /* Аварийный keepalive тестом — только в диагностике; в полном режиме не посылаем TEST повторно */
    if(!full_mode){
        /* В DIAG режиме можно слать keepalive TEST — оставляем как было. */
    if(dbg_tx_cplt == 0 && (now - start_cmd_ms) > 150 && !vnd_ep_busy){
#if !VND_DISABLE_TEST
        vnd_emergency_keepalive(now);
#endif
    }
    }
    /* Периодический диагностический лог ранней стадии: пока нет ни одного TXCPLT или отсутствует прогресс */
    do {
        static uint32_t last_diag_ms = 0;
        static uint32_t last_diag_txcplt = 0;
        if(now - last_diag_ms > 200){
            if(dbg_tx_cplt == 0 || dbg_tx_cplt != last_diag_txcplt){
                /* Получим отладочные счётчики DMA, если доступны */
                VND_LOG("DIAG txcplt=%lu test_sent=%u test_in_flight=%u pendB=%u ep_busy=%u inflight=%u ch=%u ackPend=%u seq=%lu prod=%lu sent0=%lu sent1=%lu wr=%lu rd=%lu metaDepth=%u", (unsigned long)dbg_tx_cplt, (unsigned)test_sent, (unsigned)test_in_flight, (unsigned)pending_B, (unsigned)vnd_ep_busy, (unsigned)vnd_inflight, (unsigned)sending_channel, (unsigned)status_ack_pending, (unsigned long)stream_seq, (unsigned long)dbg_produced_seq, (unsigned long)dbg_sent_ch0_total, (unsigned long)dbg_sent_ch1_total, (unsigned long)frame_wr_seq, (unsigned long)frame_rd_seq, (unsigned)vnd_tx_meta_depth());
                last_diag_txcplt = dbg_tx_cplt;
            }
            last_diag_ms = now;
        }
    } while(0);
    
    /* === FPS отчёт каждые 2 секунды === */
    if(streaming && (now - fps_last_report_ms) > 2000){
        vnd_report_fps_stats();
        fps_last_report_ms = now;
    }

    /* Ускоренный watchdog: считаем зависанием при > 3000мс без TXCPLT и мягко пинаем TX */
    uint32_t txcplt_kick_age = 0u;
    if(streaming &&
       vnd_usb_in_has_recoverable_state() &&
       vnd_tick_age_ms(now, vnd_last_txcplt_ms, &txcplt_kick_age) &&
       txcplt_kick_age > 3000u){
        VND_LOG("WDG_KICK (no TXCPLT >3s) drop current unit");
        vnd_tx_drop_recovery_request = 1u;
        vnd_usb_in_drop_recovery_poll(now);
        /* Важно: не использовать async-путь в ROI режимах, иначе он обходит prepare_pair/AVG очередь
           и начинает слать "сырой" поток. */
        if(async_mode && full_mode && !diag_mode_active && (vnd_stream_mode == VND_STREAM_MODE_LATEST)){
            (void)vnd_async_try_tx();
        }
    }

    /* Fallback стартовой инициализации: если после START прошло >20 мс и ни одного рабочего кадра не ушло,
       пытаемся принудительно подготовить и отправить A кадр первой пары. */
    if(streaming && vnd_pending_init && !vnd_stream_active){
        if(start_cmd_ms && (now - start_cmd_ms) > 20){
            ChanFrame *fA = &g_frames[pair_send_idx][0];
            if(fA->st != FB_READY){ vnd_prepare_pair(); fA = &g_frames[pair_send_idx][0]; }
            if(fA->st == FB_READY && !vnd_ep_busy){
                if(!vnd_strict_slot_ready_for_stream(pair_send_idx)){ return; }
                if(vnd_transmit_frame(fA->buf, fA->frame_size, 0, 0, "ADC0-KICK") == USBD_OK){
                    fA->st = FB_SENDING; sending_channel = 0;
                    pending_B = (vnd_ch_mode == 0) ? 0 : 1; if(pending_B) pending_B_since_ms = HAL_GetTick(); else pending_B_since_ms = 0;
                    vnd_pending_init = 0; /* считаем инициализацию выполненной */
                    vnd_stream_active = 1; /* поток активен */
                    VND_LOG("START_FALLBACK_KICK A queued size=%u", (unsigned)fA->frame_size);
                }
            }
        }
    }

    /* Если нет прогресса — не синтезируем кадры; ждём реальные данные от АЦП */
}

/* TIM16 input-capture callback (slave sync) */
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim)
{
    if(!htim) return;
    if(htim->Instance != TIM16) return;
    if(vnd_sync_mode != VND_SYNC_MODE_SLAVE) return;

    uint32_t cap = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_1);
    if(!vnd_sync_capture_valid){
        vnd_sync_last_capture = cap;
        vnd_sync_capture_valid = 1;
        vnd_sync_last_capture_ms = HAL_GetTick();
        return;
    }
    uint32_t last = vnd_sync_last_capture;
    vnd_sync_last_capture = cap;
    vnd_sync_last_capture_ms = HAL_GetTick();

    uint32_t diff = (cap >= last) ? (cap - last) : ((0x10000u - last) + cap);
    if(diff == 0u) return;

    uint32_t tick_hz = vnd_sync_tick_hz ? vnd_sync_tick_hz : 1000000u;
    uint32_t hz = tick_hz / diff;
    if(hz < 20u || hz > 1000u) return;

    vnd_sync_pending_hz = (uint16_t)hz;
}

/* Обработчик завершения передачи */
void USBD_VND_TxCplt(void)
{
    uint8_t prev_sending = sending_channel;
    dbg_tx_cplt++;
    vnd_tx_ready = 1;
    vnd_ep_busy = 0;
    vnd_inflight = 0;
    
    /* ПРОФИЛИРОВАНИЕ: интервал между TxCplt */
    static uint32_t last_txcplt_time = 0;
    static uint32_t txcplt_interval_sum = 0;
    static uint32_t txcplt_interval_count = 0;
    static uint32_t txcplt_interval_max = 0;
    static uint32_t last_txcplt_log = 0;
    
    uint32_t now_txcplt = HAL_GetTick();
    if(last_txcplt_time > 0){
        uint32_t interval = now_txcplt - last_txcplt_time;
        txcplt_interval_sum += interval;
        txcplt_interval_count++;
        if(interval > txcplt_interval_max) txcplt_interval_max = interval;
        
        if(now_txcplt - last_txcplt_log >= 5000){
            __attribute__((unused)) uint32_t avg = txcplt_interval_count ? (txcplt_interval_sum / txcplt_interval_count) : 0;
                 VND_PROF_LOGF("[PROF_TxCplt] cnt=%lu avg=%lums max=%lums (rate=%.1fHz)\r\n",
                     txcplt_interval_count, avg, txcplt_interval_max,
                     avg > 0 ? (1000.0f / avg) : 0.0f);
            txcplt_interval_sum = 0;
            txcplt_interval_count = 0;
            txcplt_interval_max = 0;
            last_txcplt_log = now_txcplt;
        }
    }
    last_txcplt_time = now_txcplt;
    
