kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
        case VND_CMD_TOGGLE_TIM2CH3_INV:
        {
            /* Переключаем полярность CH3 на лету (PA2 = TIM2_CH3). */
            uint32_t ccer = TIM2->CCER;
            ccer ^= TIM_CCER_CC3P;
            TIM2->CCER = ccer;
        }
        break;

        case VND_CMD_SET_TX_ENABLE:
        {
            if(len >= 2){
                uint8_t en = (data[1] != 0u) ? 1u : 0u;
                last_cmd_received = VND_CMD_SET_TX_ENABLE;
                last_cmd_timestamp_ms = HAL_GetTick();
                vnd_tx_host_cmd_count++;
                vnd_tx_host_cmd_last_ms = last_cmd_timestamp_ms;
                vnd_tx_host_cmd_last_value = en;
                (void)vnd_tx_set_enabled_internal(en, "host_cmd");
            }
        }
        break;

        case VND_CMD_SET_OPTIC_POWER:
        {
            if(len >= 2){
                uint8_t applied = optic_tx_set_power(data[1]);
                cdc_logf("EVT OPTIC_POWER=%u", (unsigned)applied);
            }
        }
        break;

        case VND_CMD_SET_OPTIC_HOLD:
        {
            if(len >= 3){
                uint16_t deciseconds = (uint16_t)(data[1] | (data[2] << 8));
                uint16_t applied = optic_sensor_set_hold_deciseconds(deciseconds);
                cdc_logf("EVT OPTIC_HOLD_DS=%u", (unsigned)applied);
            } else if(len >= 2){
                uint8_t applied = optic_sensor_set_hold_seconds(data[1]);
                cdc_logf("EVT OPTIC_HOLD_S_LEGACY=%u", (unsigned)applied);
            }
        }
        break;

        case VND_CMD_SET_LED_PATTERN:
        {
            if(len >= 2){
                uint8_t applied = dynamic_led_set_pattern(data[1]);
                cdc_logf("EVT LED_PATTERN=%u", (unsigned)applied);
            }
        }
        break;

        case VND_CMD_SET_DET_ADC:
        {
            if(len >= 2){
                uint8_t applied = rs485_status_set_det_adc_bits(data[1]);
                pending_status = 1u;
                vnd_change_event_force_report();
                cdc_logf("EVT DET_ADC=0x%02X", (unsigned)applied);
            }
        }
        break;

        case VND_CMD_SET_RS485_IP:
        {
            if (len >= 5u) {
                rs485_identity_set_local_ip4(&data[1]);
                cdc_logf("EVT RS485_IP=%u.%u.%u.%u",
                         (unsigned)data[1],
                         (unsigned)data[2],
                         (unsigned)data[3],
                         (unsigned)data[4]);
            }
        }
        break;

        case VND_CMD_SET_RPI_INFO:
        {
            if (len == 7u) {
                uint16_t rpi_number =
                    (uint16_t)data[1] | ((uint16_t)data[2] << 8);
                rs485_identity_set_local_rpi_info(rpi_number, &data[3]);
                cdc_logf("EVT RPI_INFO number=%u ip=%u.%u.%u.%u",
                         (unsigned)rpi_number,
                         (unsigned)data[3],
                         (unsigned)data[4],
                         (unsigned)data[5],
                         (unsigned)data[6]);
            }
        }
        break;

        case VND_CMD_REQUEST_RS485_IDENT:
        {
            rs485_identity_request_scan();
            cdc_logf("EVT RS485_IDENT_SCAN_REQUEST");
        }
        break;

        case VND_CMD_GET_RS485_IDENT:
        {
            uint8_t node_id = (len >= 2u) ? data[1] : 0xFFu;
            if (streaming) {
                VND_LOG("GET_RS485_IDENT bulk ignored while streaming (use EP0)");
                break;
            }
            if (!vnd_ep_busy) {
                uint16_t l = vnd_build_rs485_ident(node_id, (uint8_t*)status_buf, sizeof(status_buf));
                if (l != 0u) {
                    vnd_tx_ready = 0;
                    vnd_ep_busy = 1;
                    vnd_last_tx_len = l;
                    vnd_last_tx_start_ms = HAL_GetTick();
                    vnd_mark_service_inflight();
                    if (USBD_VND_Transmit(&hUsbDeviceHS, (uint8_t*)status_buf, l) == USBD_OK) {
                        vnd_tx_meta_after((uint8_t*)status_buf, l);
                        VND_LOG("RID1_TX req len=%u", l);
                    } else {
                        VND_LOG("RID1_BUSY_FAIL");
                        vnd_rollback_tx_start();
                    }
                }
            }
        }
        break;

        case VND_CMD_LED_EVENT:
#if VND_LED_EVENTS_ENABLE
        {
            if (len >= 4) {
                uint8_t event = data[1];
                uint16_t duration_ms = (uint16_t)(data[2] | (data[3] << 8));
                ws2812_event_t led_event = WS2812_EVENT_NONE;

                if (event == VND_LED_EVENT_CHANNEL_B) {
                    led_event = WS2812_EVENT_CHANNEL_B;
                } else if (event == VND_LED_EVENT_CHANNEL_A) {
                    led_event = WS2812_EVENT_CHANNEL_A;
                } else if (event == VND_LED_EVENT_BOTH) {
                    led_event = WS2812_EVENT_CHANNEL_BOTH;
                } else if (event == VND_LED_EVENT_SPLIT_IN) {
                    led_event = WS2812_EVENT_SPLIT_IN;
                } else if (event == VND_LED_EVENT_SPLIT_OUT) {
                    led_event = WS2812_EVENT_SPLIT_OUT;
                }

                if (duration_ms == 0u) {
                    duration_ms = 1600u;
                }

                ws2812_spi_trigger_event(led_event, duration_ms);
                cdc_logf("EVT LED_EVENT event=%u dur=%u", (unsigned)event, (unsigned)duration_ms);
            }
        }
#endif
        break;

        case VND_CMD_SET_WINDOWS:
            if(len >= 9)
            {
                /* 1 + 8 байт */
                win_start0 = (uint16_t)(data[1] | (data[2] << 8));
                win_len0   = (uint16_t)(data[3] | (data[4] << 8));
                win_start1 = (uint16_t)(data[5] | (data[6] << 8));
                win_len1   = (uint16_t)(data[7] | (data[8] << 8));
                win_auto = 0; /* ручное окно отключает авто-смещение */
                VND_LOG("SET_WINDOWS s0=%u l0=%u s1=%u l1=%u", win_start0, win_len0, win_start1, win_len1);
                /* При смене ROI сбросить накопители усреднения, чтобы не смешивать разные окна */
                vnd_avg_reset();
                vnd_update_lcd_params();
            }
            break;

