kslabs/BMI30.stm32h7/USB_DEVICE/App/usb_vendor_app.c
        case VND_CMD_SET_STREAM_MODE:
            if(len >= 2)
            {
                uint8_t m = data[1];
                if(m > VND_STREAM_MODE_AVG_ROI) m = VND_STREAM_MODE_LATEST;
                vnd_stream_mode = m;

                if(vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
                    /* avg_n: опционально */
                    uint8_t n = (len >= 3) ? data[2] : 24;
                    if(n < (uint8_t)VND_AVG_MIN_N) n = (uint8_t)VND_AVG_MIN_N;
                    if(n > VND_AVG_MAX_N) n = VND_AVG_MAX_N;
                    vnd_avg_n = n;
                    vnd_avg_reset();

                    /* ВАЖНО: не делаем vnd_dc_load_once() здесь — этот обработчик может быть в USB IRQ.
                       Просим выполнить загрузку DC в main-loop (Vendor_Stream_Task) как можно раньше. */
                    vnd_dc_load_request = 1;
                }

                /* Печать в UART (COM4) — чтобы однозначно видеть применённый режим/avg_n */
                printf("[CMD_IND] SET_STREAM_MODE m=%u len=%u avg_n=%u\r\n", (unsigned)vnd_stream_mode, (unsigned)len, (unsigned)vnd_avg_n);

                /* LOSSLESS_ROI идёт через обычный парный FIFO-путь. AVG_ROI остаётся
                   на отдельной AVG-очереди; async для обоих ROI-режимов запрещён. */
                if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI){
                    vnd_ch_mode = 2;
                    async_mode = 0;
                    vnd_strict_pairing = 0;
                    async_mode_host_set = 1;
                } else if(vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
                    vnd_ch_mode = 2;
                    async_mode = 0;
                    async_mode_host_set = 1;
                }

                /* При смене режима сбрасываем lock размера кадра, чтобы избежать рассинхронизации формата. */
                cur_samples_per_frame = 0;
                cur_expected_frame_size = 0;

                /* Для требуемого режима "lossless ROI" выставляем дефолтное окно 200 семплов
                   со сдвигом по частоте (база 200 Гц -> старт 280).
                   Хост всё равно может переопределить через SET_WINDOWS.
                   Не перезаписываем ROI, если хост уже установил его (win_auto==0). */
                if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI){
                    if(win_auto != 0){
                        vnd_apply_auto_roi_window();
                    }
                }
                if(streaming){
                    /* USB-only switch: do not restart ADC/DMA/TIM15/sync on payload
                       mode changes. The ADC cadence stays the timing reference; only
                       the software frame builder must forget cached async frames. */
                    vnd_async_state_reset_req = 1u;
                    vnd_tx_kick = 1u;
                    cdc_logf("SET_STREAM_MODE: USB-only switch m=%u, ADC restart skipped",
                             (unsigned)vnd_stream_mode);
                }
                vnd_update_lcd_params();
            }
            break;

        case VND_CMD_SET_DC_SPEED:
            /* Complete runtime contract: one LE u32 millisecond value.
               0 disables learning, 1 is fastest, 1000 is one second. */
            if((len == 5u) && vnd_dc_apply_speed_payload(&data[1], 4u))
            {
                printf("[DC_SPEED] settle=%lums enabled=%u\r\n",
                       (unsigned long)vnd_dc_speed_settle_ms,
                       (unsigned)(vnd_dc_speed_settle_ms != 0u));
                cdc_logf("EVT SET_DC_SPEED settle=%lu enabled=%u",
                         (unsigned long)vnd_dc_speed_settle_ms,
                         (unsigned)(vnd_dc_speed_settle_ms != 0u));
            }
            else
            {
                vnd_dc_speed_reject_count++;
                printf("[DC_SPEED] rejected len=%lu expected=5\r\n", (unsigned long)len);
                cdc_logf("EVT SET_DC_SPEED rejected len=%lu", (unsigned long)len);
            }
            break;

        case VND_CMD_GET_DC_CONFIG:
            {
                uint8_t cfg[VND_DC_CONFIG_MAX];
                uint16_t l = vnd_build_dc_config(cfg, sizeof(cfg));
                if(l && !vnd_ep_busy && !vnd_inflight){
                    vnd_tx_ready = 0; vnd_ep_busy = 1; vnd_last_tx_len = l; vnd_last_tx_start_ms = HAL_GetTick();
                    vnd_mark_service_inflight();
                    if(USBD_VND_Transmit(&hUsbDeviceHS, cfg, l) == USBD_OK){
                        vnd_tx_meta_after(cfg, l);
                    } else {
                        vnd_rollback_tx_start();
                    }
                }
            }
            break;

        case VND_CMD_SAVE_DC_TO_FLASH:
            vnd_dc_request_save_to_flash();
            printf("[CMD_IND] SAVE_DC_TO_FLASH requested\r\n");
            cdc_logf("EVT SAVE_DC_TO_FLASH requested");
            break;
            
        case VND_CMD_SET_LCD_ROLE_OVERLAY:
            if(len >= 2)
            {
                uint8_t enable = (data[1] != 0u) ? 1u : 0u;
                uint8_t period_s = vnd_lcd_role_overlay_period_s;
                uint8_t duration_s = vnd_lcd_role_overlay_duration_s;
                if(len >= 3u) {
                    period_s = data[2];
                }
                if(len >= 4u) {
                    duration_s = data[3];
                }
                vnd_lcd_role_overlay_configure(enable, period_s, duration_s);
                printf("[CMD_IND] SET_LCD_ROLE_OVERLAY en=%u period=%u duration=%u\r\n",
                       (unsigned)enable,
                       (unsigned)vnd_lcd_role_overlay_period_s,
                       (unsigned)vnd_lcd_role_overlay_duration_s);
                cdc_logf("EVT LCD_ROLE_OVERLAY en=%u period=%u duration=%u",
                         (unsigned)enable,
                         (unsigned)vnd_lcd_role_overlay_period_s,
                         (unsigned)vnd_lcd_role_overlay_duration_s);
            }
            break;

        case VND_CMD_SET_SYNC_MODE:
            if(len >= 2)
            {
                uint8_t mode = data[1];
                if ((mode == VND_SYNC_MODE_AUTO) || (mode == VND_SYNC_MODE_AUTO_LEGACY)) {
                    vnd_sync_release_host_forced();
                    printf("[CMD_IND] SET_SYNC_MODE AUTO\r\n");
                    cdc_logf("EVT SET_SYNC_MODE AUTO");
                } else if ((mode == VND_SYNC_MODE_MASTER) ||
                           (mode == VND_SYNC_MODE_SLAVE)) {
                    /* Persistent local MASTER/SLAVE assignments require host
                       UTC Unix time in milliseconds for wire compatibility. */
                    if(len >= 10u) {
                        uint64_t assigned_unix_ms =
                            (uint64_t)vnd_dc_rd_le32(data + 2u) |
                            ((uint64_t)vnd_dc_rd_le32(data + 6u) << 32);
                        uint8_t accepted = (mode == VND_SYNC_MODE_MASTER)
                            ? rs485_role_assign_master_from_host(assigned_unix_ms)
                            : rs485_role_assign_slave_from_host(assigned_unix_ms);
                        const char *role_name = (mode == VND_SYNC_MODE_MASTER)
                            ? "MASTER" : "SLAVE";
                        if(accepted != 0u) {
                            printf("[CMD_IND] SET_SYNC_MODE %s unix_ms=%llu\r\n",
                                   role_name,
                                   (unsigned long long)assigned_unix_ms);
                            cdc_logf("EVT SET_SYNC_MODE %s unix_ms=%llu",
                                     role_name,
                                     (unsigned long long)assigned_unix_ms);
                        } else {
                            printf("[CMD_IND] SET_SYNC_MODE %s rejected\r\n", role_name);
                            cdc_logf("EVT SET_SYNC_MODE %s rejected", role_name);
                        }
                    } else {
                        printf("[CMD_IND] SET_SYNC_MODE role=%u rejected: timestamp required\r\n",
                               (unsigned)mode);
                        cdc_logf("EVT SET_SYNC_MODE role=%u rejected timestamp_required",
                                 (unsigned)mode);
                    }
                } else {
                    if(mode > VND_SYNC_MODE_OFF) {
                        mode = VND_SYNC_MODE_OFF;
                    }
                    vnd_sync_apply_host_forced_mode(mode);
                    printf("[CMD_IND] SET_SYNC_MODE %u\r\n", (unsigned)mode);
                    cdc_logf("EVT SET_SYNC_MODE mode=%u", (unsigned)mode);
                }
            }
            break;

        case VND_CMD_SET_RS485_ID:
            if(len >= 2)
            {
                uint8_t node_id = data[1];
                if(node_id <= 31u) {
                    rs485_set_local_node_id_from_host(node_id);
                    printf("[CMD_IND] SET_RS485_ID %u\r\n", (unsigned)node_id);
                } else {
                    printf("[CMD_IND] SET_RS485_ID rejected %u\r\n",
                           (unsigned)node_id);
                }
            }
            break;

        case VND_CMD_SET_BLOCK_HZ:
            if(len >= 3)
            {
                uint16_t hz = (uint16_t)(data[1] | (data[2] << 8));
                if(hz == 0xFFFF) hz = 100;
                if(hz < 20) hz = 20;
                if(hz > 400) hz = 400;
                diag_hz = hz;
                diag_period_ms = 1000 / diag_hz;
                VND_LOG("SET_BLOCK_HZ %u", diag_hz);
                cdc_logf("EVT SET_BLOCK_HZ %u", (unsigned)diag_hz);
                /* NEW: авто-подбор профиля под желаемую частоту блоков, если мы в полном режиме (full_mode) */
                if(full_mode){
                    /* Целевые buf_rate_hz профилей: 200(A), 300(B/C/D), 400(E) */
                    uint16_t target = hz; /* запрос хоста: кадров в секунду */
                    uint8_t new_prof = adc_stream_get_profile();
                    if(target >= 380){ new_prof = ADC_PROFILE_E_400HZ; }
                    else if(target >= 250){ new_prof = ADC_PROFILE_B_DEFAULT; }
                    else { new_prof = ADC_PROFILE_A_200HZ; }
                    if(new_prof != adc_stream_get_profile()){
                        int rc = adc_stream_set_profile(new_prof);
                        VND_LOG("AUTO_PROFILE_BY_BLOCK_HZ hz=%u -> prof=%u rc=%d", target, new_prof, rc);
                        if(rc == 0){
                            uint16_t cur_samples = adc_stream_get_active_samples();
                            uint16_t cur_rate = adc_stream_get_buf_rate();
                            cdc_logf("EVT AUTO_PROFILE hz=%u prof=%u samples=%u rate=%u", (unsigned)target, (unsigned)new_prof, (unsigned)cur_samples, (unsigned)cur_rate);
                            /* Сброс lock размера, чтобы новые параметры применились */
                            cur_samples_per_frame = 0; cur_expected_frame_size = 0;
                        }
                    }
                }
                vnd_update_lcd_params();
            }
            break;
        case VND_CMD_SET_ASYNC_MODE:
            if(len >= 2){
                uint8_t mode = data[1];
#if USE_TEST_SAWTOOTH
                /* Игнорируем запросы async в тестовом режиме — нужен парный путь */
                async_mode = 0; vnd_strict_pairing = 0;
                cdc_logf("EVT SET_ASYNC ignored (test mode)");
#else
                async_mode = (mode & 0x01) ? 1 : 0;
                async_mode_host_set = 1;
                /* bit7 включает строгую парность (A&B на один seq); по умолчанию 0 = независимые каналы */
                vnd_strict_pairing = (mode & 0x80) ? 1 : 0;
                /* ROI-режимы требуют собственного FIFO/AVG пайплайна: async для них запрещён. */
                if((vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI) && async_mode){
                    async_mode = 0;
                }
                if(vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI){
                    vnd_ch_mode = 2;
                    async_mode = 0;
                    vnd_strict_pairing = 0;
                }
                /* Запретить async при одноканальном режиме (A-only/B-only) для стабильности.
                   LOSSLESS_ROI сам принудительно включает BOTH выше. */
                if(vnd_ch_mode != 2 && async_mode){ async_mode = 0; }
                VND_LOG("SET_ASYNC_MODE async=%u strict_pair=%u", (unsigned)async_mode, (unsigned)vnd_strict_pairing);
                cdc_logf("EVT SET_ASYNC async=%u strict=%u", (unsigned)async_mode, (unsigned)vnd_strict_pairing);
                /* Сбросим ожидания и канал передачи */
                pending_B = 0; sending_channel = 0xFF;
#endif
            }
            break;
        case VND_CMD_SET_CHMODE:
            if(len >= 2){
                uint8_t m = data[1];
#if USE_TEST_SAWTOOTH
                /* В тестовом режиме принудительно оба канала */
                vnd_ch_mode = 2; async_mode = 0;
                cdc_logf("EVT SET_CHMODE forced BOTH (test mode)");
#else
                if(m > 2) m = 2; /* default both */
                vnd_ch_mode = m;
                /* При A-only/B-only принудительно выключаем async */
                if(vnd_ch_mode != 2 && async_mode){ async_mode = 0; }
                VND_LOG("SET_CHMODE %u", (unsigned)vnd_ch_mode);
                cdc_logf("EVT SET_CHMODE %u", (unsigned)vnd_ch_mode);
#endif
                /* Переключение режимов на лету: сброс ожиданий B, чтобы не зависать */
                pending_B = 0; sending_channel = 0xFF;
            }
            break;
        case VND_CMD_SET_FULL_MODE:
            if(len >= 2)
            {
                uint8_t full = data[1] ? 1 : 0;
                full_mode = full;
                VND_LOG("SET_FULL_MODE %u", full_mode);
                cdc_logf("EVT SET_FULL_MODE %u", (unsigned)full_mode);
                if(streaming){
                    /* Переключение режима на лету: сброс пары и разрешение TEST не требуется */
                    pending_B = 0; sending_channel = 0xFF;
                }
                if(full_mode){
                    /* Возврат к нормальному режиму ADC */
                    diag_mode_active = 0; diag_prepared_seq = 0xFFFFFFFFu;
                    /* При входе в полный режим – использовать фактический размер профиля ADC, снять lock и пересчитать период */
                    vnd_frame_samples_req = 0; /* 0 = использовать g_active_samples из профиля */
                    cur_samples_per_frame = 0;
                    cur_expected_frame_size = 0;
                    vnd_recompute_pair_timing(vnd_frame_samples_req);
                } else {
                    /* Включаем диагностический режим (пила) */
                    diag_mode_active = 1;
                    diag_samples = (cur_samples_per_frame != 0) ? cur_samples_per_frame : VND_DEFAULT_TEST_SAMPLES;
                    if(diag_samples > VND_MAX_SAMPLES) diag_samples = VND_MAX_SAMPLES;
                    cur_samples_per_frame = diag_samples;
                    cur_expected_frame_size = (uint16_t)(VND_FRAME_HDR_SIZE + cur_samples_per_frame*2u);
                    /* Разрешаем немедленную отправку диагностических кадров */
                    diag_next_ms = HAL_GetTick(); diag_prepared_seq = 0xFFFFFFFFu;
                }
                vnd_update_lcd_params();
            }
            break;
        case VND_CMD_SET_TRUNC_SAMPLES:
            if(len >= 3){
                uint16_t ns = (uint16_t)(data[1] | (data[2] << 8));
                vnd_trunc_samples = ns;
                VND_LOG("SET_TRUNC_SAMPLES %u", (unsigned)vnd_trunc_samples);
                cdc_logf("EVT SET_TRUNC %u", (unsigned)vnd_trunc_samples);
                /* Сбросим текущий lock размера, чтобы статус отразил новые размеры, применится при следующем кадре */
                cur_samples_per_frame = 0;
                cur_expected_frame_size = 0;
            }
            break;
        case VND_CMD_SET_PROFILE:
            if(len >= 2)
            {
                uint8_t profile = data[1];
                uint8_t prof_id = ADC_PROFILE_B_DEFAULT;
                // Маппинг host profile -> firmware profile ID:
                // 0 -> ADC_PROFILE_A_200HZ (1360 samples @ 200Hz)
                // 1 -> ADC_PROFILE_B_DEFAULT (912 samples @ 300Hz)
                // 2 -> ADC_PROFILE_C_HIGH (944 samples @ 300Hz)
                // 3 -> ADC_PROFILE_D_MAX (976 samples @ 300Hz)
                // 4 -> ADC_PROFILE_E_400HZ (680 samples @ 400Hz HIGH-FPS)
                if(profile == 0) prof_id = ADC_PROFILE_A_200HZ;
                else if(profile == 1) prof_id = ADC_PROFILE_B_DEFAULT;
                else if(profile == 2) prof_id = ADC_PROFILE_C_HIGH;
                else if(profile == 3) prof_id = ADC_PROFILE_D_MAX;
                else if(profile == 4) prof_id = ADC_PROFILE_E_400HZ;
                int rc = adc_stream_set_profile(prof_id);
                VND_LOG("SET_PROFILE %u -> prof_id=%u rc=%d", profile, prof_id, rc);
                /* ДИАГНОСТИКА: вывести текущее состояние после смены профиля */
                if(rc == 0) {
                    host_profile = profile; /* запомним для LCD ровно то, что прислал хост */
                    uint16_t cur_samples = adc_stream_get_active_samples();
                    uint16_t cur_rate = adc_stream_get_buf_rate();
                    cdc_logf("EVT SET_PROFILE p=%u samples=%u rate=%u Hz", profile, cur_samples, cur_rate);
                    vnd_update_lcd_params();
                }
            }
            break;
        case VND_CMD_SET_ROI_US:
            if(len >= 5)
            {
                uint32_t start_sample = (uint32_t)(data[1] | (data[2] << 8) | (data[3] << 16) | (data[4] << 24));
                uint16_t samples = adc_stream_get_active_samples();
                uint16_t roi_len = (uint16_t)VND_ROI_LEN_DEFAULT;
                if(samples == 0u) samples = 600u;
                if(samples < roi_len) roi_len = samples;
                uint32_t max_start = (samples > roi_len) ? (uint32_t)(samples - roi_len) : 0u;
                if(start_sample > max_start) start_sample = max_start;
                win_start0 = (uint16_t)start_sample;
                win_len0 = roi_len;
                win_start1 = 0u;
                win_len1 = 0u;
                win_auto = 0;
                VND_LOG("SET_ROI_US start=%lu -> s0=%u l0=%u", (unsigned long)start_sample, win_start0, win_len0);
                /* При смене ROI сбросить накопители усреднения, чтобы не смешивать разные окна */
                vnd_avg_reset();
                vnd_update_lcd_params();
            }
            break;
        case VND_CMD_SET_BUF_RATE_FINE:
            if(len >= 3)
            {
                uint16_t buf_rate_hz = (uint16_t)(data[1] | (data[2] << 8));
                adc_stream_set_buf_rate_fine(buf_rate_hz);
                VND_LOG("CMD_IND SET_BUF_RATE_FINE %u Hz OK", (unsigned)buf_rate_hz);
                cdc_logf("CMD_IND SET_BUF_RATE_FINE %u Hz OK", (unsigned)buf_rate_hz);
                if(win_auto && (vnd_stream_mode == VND_STREAM_MODE_LOSSLESS_ROI || vnd_stream_mode == VND_STREAM_MODE_AVG_ROI)){
                    uint16_t prev_start = win_start0;
                    vnd_apply_auto_roi_window();
                    if(win_start0 != prev_start){
                        vnd_avg_reset();
                        vnd_update_lcd_params();
                        VND_LOG("AUTO_WINDOW s0=%u l0=%u", win_start0, win_len0);
                    }
                }
            }
            break;
        default:
            VND_LOG("IGN %02X", cmd);
            break;
    }
}

/* Duplicate vnd_diag_send64_once removed */
uint32_t vnd_get_last_txcplt_ms(void)
{
    return vnd_last_txcplt_ms;
}

uint32_t vnd_get_last_frame_txcplt_ms(void)
{
    return vnd_last_frame_txcplt_ms;
}

